<abi-corpus version='2.0' path='build/src/libnetplan.so.0.0' architecture='elf-amd-x86_64' soname='libnetplan.so.0.0'>
  <elf-needed>
    <dependency name='libglib-2.0.so.0'/>
    <dependency name='libgio-2.0.so.0'/>
    <dependency name='libgobject-2.0.so.0'/>
    <dependency name='libyaml-0.so.2'/>
    <dependency name='libuuid.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_netplan_iter_defs_per_devtype_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_netplan_iter_defs_per_devtype_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_netplan_iter_defs_per_devtype_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_netplan_netdef_id' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_netplan_netdef_pertype_iter_free' type='func-type' binding='global-binding' visibility='default-visibility' alias='_netplan_iter_defs_per_devtype_free' is-defined='yes'/>
    <elf-symbol name='_netplan_netdef_pertype_iter_next' type='func-type' binding='global-binding' visibility='default-visibility' alias='_netplan_iter_defs_per_devtype_next' is-defined='yes'/>

    <elf-symbol name='netplan_sriov_cleanup' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_clear' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_dump_yaml' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_finish_nm_write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_finish_ovs_write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_finish_sriov_write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_get_backend' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_get_netdef' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_get_netdefs_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_import_parser_results' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_new' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_reset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_util_dump_yaml_subtree' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='process_input_file' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='process_yaml_hierarchy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='safe_mkdir_p_dir' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='systemd_escape' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='tunnel_mode_to_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='unlink_glob' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wifi_get_freq24' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wifi_get_freq5' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='write_netplan_conf' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='write_netplan_conf_full' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='NETPLAN_OPTIONAL_ADDRESS_TYPES' size='96' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='NETPLAN_WIFI_WOWLAN_TYPES' size='160' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='global_backend' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='global_state' size='168' type='object-type' binding='global-binding' visibility='default-visibility' alias='netdefs' is-defined='yes'/>
    <elf-symbol name='netdefs' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netdefs_ordered' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_backend_to_name' size='32' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='ovs_settings_global' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wifi_frequency_24' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='wifi_frequency_5' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='../src/abi_compat.c' comp-dir-path='/home/lukas/canonical/netplan/build' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='8' id='type-id-2'>
      <subrange length='1' type-id='type-id-3' id='type-id-4'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='160' id='type-id-5'>
      <subrange length='20' type-id='type-id-3' id='type-id-6'/>
    </array-type-def>
    <class-decl name='_GData' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-7'/>
    <class-decl name='_GHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-8'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-9'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-10'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-11'/>
    <class-decl name='netdef_pertype_iter' size-in-bits='448' is-struct='yes' visibility='default' filepath='../src/util.c' line='528' column='1' id='type-id-12'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-13' visibility='default' filepath='../src/util.c' line='529' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='iter' type-id='type-id-14' visibility='default' filepath='../src/util.c' line='530' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='np_state' type-id='type-id-15' visibility='default' filepath='../src/util.c' line='531' column='1'/>
      </data-member>
    </class-decl>
    <type-decl name='int' size-in-bits='32' id='type-id-16'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-17'/>
    <type-decl name='signed char' size-in-bits='8' id='type-id-18'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-19'/>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-20'/>
    <array-type-def dimensions='1' type-id='type-id-20' size-in-bits='128' id='type-id-21'>
      <subrange length='16' type-id='type-id-3' id='type-id-22'/>
    </array-type-def>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-23'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-24'/>
    <type-decl name='variadic parameter type' id='type-id-25'/>
    <type-decl name='void' id='type-id-26'/>
    <typedef-decl name='NetplanNetDefinition' type-id='type-id-27' filepath='../include/netplan.h' line='28' column='1' id='type-id-28'/>
    <typedef-decl name='NetplanState' type-id='type-id-29' filepath='../include/netplan.h' line='29' column='1' id='type-id-30'/>
    <enum-decl name='NetplanBackend' naming-typedef-id='type-id-31' filepath='../include/netplan.h' line='31' column='1' id='type-id-32'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='NETPLAN_BACKEND_NONE' value='0'/>
      <enumerator name='NETPLAN_BACKEND_NETWORKD' value='1'/>
      <enumerator name='NETPLAN_BACKEND_NM' value='2'/>
      <enumerator name='NETPLAN_BACKEND_OVS' value='3'/>
      <enumerator name='NETPLAN_BACKEND_MAX_' value='4'/>
    </enum-decl>
    <typedef-decl name='NetplanBackend' type-id='type-id-32' filepath='../include/netplan.h' line='37' column='1' id='type-id-31'/>
    <enum-decl name='NetplanDefType' naming-typedef-id='type-id-13' filepath='../include/parse.h' line='26' column='1' id='type-id-33'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='NETPLAN_DEF_TYPE_NONE' value='0'/>
      <enumerator name='NETPLAN_DEF_TYPE_ETHERNET' value='1'/>
      <enumerator name='NETPLAN_DEF_TYPE_WIFI' value='2'/>
      <enumerator name='NETPLAN_DEF_TYPE_MODEM' value='3'/>
      <enumerator name='NETPLAN_DEF_TYPE_VIRTUAL' value='4'/>
      <enumerator name='NETPLAN_DEF_TYPE_BRIDGE' value='4'/>
      <enumerator name='NETPLAN_DEF_TYPE_BOND' value='5'/>
      <enumerator name='NETPLAN_DEF_TYPE_VLAN' value='6'/>
      <enumerator name='NETPLAN_DEF_TYPE_TUNNEL' value='7'/>
      <enumerator name='NETPLAN_DEF_TYPE_PORT' value='8'/>
      <enumerator name='NETPLAN_DEF_TYPE_NM' value='9'/>
      <enumerator name='NETPLAN_DEF_TYPE_MAX_' value='10'/>
    </enum-decl>
    <typedef-decl name='NetplanDefType' type-id='type-id-33' filepath='../include/parse.h' line='42' column='1' id='type-id-13'/>
    <typedef-decl name='NetplanParser' type-id='type-id-34' filepath='../include/parse.h' line='44' column='1' id='type-id-35'/>
    <enum-decl name='NetplanOptionalAddressFlag' naming-typedef-id='type-id-36' filepath='../src/abi.h' line='25' column='1' id='type-id-37'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='NETPLAN_OPTIONAL_IPV4_LL' value='1'/>
      <enumerator name='NETPLAN_OPTIONAL_IPV6_RA' value='2'/>
      <enumerator name='NETPLAN_OPTIONAL_DHCP4' value='4'/>
      <enumerator name='NETPLAN_OPTIONAL_DHCP6' value='8'/>
      <enumerator name='NETPLAN_OPTIONAL_STATIC' value='16'/>
    </enum-decl>
    <typedef-decl name='NetplanOptionalAddressFlag' type-id='type-id-37' filepath='../src/abi.h' line='31' column='1' id='type-id-36'/>
    <class-decl name='dhcp_overrides' size-in-bits='384' is-struct='yes' visibility='default' filepath='../src/abi.h' line='34' column='1' id='type-id-38'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='use_dns' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='use_ntp' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='send_hostname' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='37' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='use_hostname' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='use_mtu' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='39' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='use_routes' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='40' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='use_domains' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='hostname' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='metric' type-id='type-id-41' visibility='default' filepath='../src/abi.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='NetplanDHCPOverrides' type-id='type-id-38' filepath='../src/abi.h' line='44' column='1' id='type-id-42'/>
    <enum-decl name='NetplanRAMode' naming-typedef-id='type-id-43' filepath='../src/abi.h' line='46' column='1' id='type-id-44'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='NETPLAN_RA_MODE_KERNEL' value='0'/>
      <enumerator name='NETPLAN_RA_MODE_ENABLED' value='1'/>
      <enumerator name='NETPLAN_RA_MODE_DISABLED' value='2'/>
    </enum-decl>
    <typedef-decl name='NetplanRAMode' type-id='type-id-44' filepath='../src/abi.h' line='50' column='1' id='type-id-43'/>
    <enum-decl name='NetplanWifiWowlanFlag' naming-typedef-id='type-id-45' filepath='../src/abi.h' line='52' column='1' id='type-id-46'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_DEFAULT' value='1'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_ANY' value='2'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_DISCONNECT' value='4'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_MAGIC' value='8'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_GTK_REKEY_FAILURE' value='16'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_EAP_IDENTITY_REQ' value='32'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_4WAY_HANDSHAKE' value='64'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_RFKILL_RELEASE' value='128'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_TCP' value='256'/>
    </enum-decl>
    <typedef-decl name='NetplanWifiWowlanFlag' type-id='type-id-46' filepath='../src/abi.h' line='62' column='1' id='type-id-45'/>
    <enum-decl name='NetplanTunnelMode' naming-typedef-id='type-id-47' filepath='../src/abi.h' line='73' column='1' id='type-id-48'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_UNKNOWN' value='0'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_IPIP' value='1'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_GRE' value='2'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_SIT' value='3'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_ISATAP' value='4'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_VTI' value='5'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_IP6IP6' value='6'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_IPIP6' value='7'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_IP6GRE' value='8'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_VTI6' value='9'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_GRETAP' value='101'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_IP6GRETAP' value='102'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_WIREGUARD' value='103'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_MAX_' value='104'/>
    </enum-decl>
    <typedef-decl name='NetplanTunnelMode' type-id='type-id-48' filepath='../src/abi.h' line='91' column='1' id='type-id-47'/>
    <enum-decl name='NetplanAuthKeyManagementType' naming-typedef-id='type-id-49' filepath='../src/abi.h' line='93' column='1' id='type-id-50'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='NETPLAN_AUTH_KEY_MANAGEMENT_NONE' value='0'/>
      <enumerator name='NETPLAN_AUTH_KEY_MANAGEMENT_WPA_PSK' value='1'/>
      <enumerator name='NETPLAN_AUTH_KEY_MANAGEMENT_WPA_EAP' value='2'/>
      <enumerator name='NETPLAN_AUTH_KEY_MANAGEMENT_8021X' value='3'/>
      <enumerator name='NETPLAN_AUTH_KEY_MANAGEMENT_MAX' value='4'/>
    </enum-decl>
    <typedef-decl name='NetplanAuthKeyManagementType' type-id='type-id-50' filepath='../src/abi.h' line='99' column='1' id='type-id-49'/>
    <enum-decl name='NetplanAuthEAPMethod' naming-typedef-id='type-id-51' filepath='../src/abi.h' line='101' column='1' id='type-id-52'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='NETPLAN_AUTH_EAP_NONE' value='0'/>
      <enumerator name='NETPLAN_AUTH_EAP_TLS' value='1'/>
      <enumerator name='NETPLAN_AUTH_EAP_PEAP' value='2'/>
      <enumerator name='NETPLAN_AUTH_EAP_TTLS' value='3'/>
      <enumerator name='NETPLAN_AUTH_EAP_METHOD_MAX' value='4'/>
    </enum-decl>
    <typedef-decl name='NetplanAuthEAPMethod' type-id='type-id-52' filepath='../src/abi.h' line='107' column='1' id='type-id-51'/>
    <class-decl name='authentication_settings' size-in-bits='576' is-struct='yes' visibility='default' filepath='../src/abi.h' line='109' column='1' id='type-id-53'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='key_management' type-id='type-id-49' visibility='default' filepath='../src/abi.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='eap_method' type-id='type-id-51' visibility='default' filepath='../src/abi.h' line='111' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='identity' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='anonymous_identity' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='password' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='ca_certificate' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='client_certificate' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='116' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='client_key' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='117' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='client_key_password' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='phase2_auth' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='119' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='NetplanAuthenticationSettings' type-id='type-id-53' filepath='../src/abi.h' line='120' column='1' id='type-id-54'/>
    <class-decl name='ovs_controller' size-in-bits='128' is-struct='yes' visibility='default' filepath='../src/abi.h' line='122' column='1' id='type-id-55'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='connection_mode' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='addresses' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='124' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='NetplanOVSController' type-id='type-id-55' filepath='../src/abi.h' line='125' column='1' id='type-id-57'/>
    <class-decl name='ovs_settings' size-in-bits='1152' is-struct='yes' visibility='default' filepath='../src/abi.h' line='127' column='1' id='type-id-58'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='external_ids' type-id='type-id-59' visibility='default' filepath='../src/abi.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='other_config' type-id='type-id-59' visibility='default' filepath='../src/abi.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lacp' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fail_mode' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mcast_snooping' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='132' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='protocols' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='133' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='rstp' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='controller' type-id='type-id-57' visibility='default' filepath='../src/abi.h' line='135' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ssl' type-id='type-id-54' visibility='default' filepath='../src/abi.h' line='136' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='NetplanOVSSettings' type-id='type-id-58' filepath='../src/abi.h' line='137' column='1' id='type-id-60'/>
    <union-decl name='NetplanBackendSettings' size-in-bits='320' naming-typedef-id='type-id-61' visibility='default' filepath='../src/abi.h' line='139' column='1' id='type-id-62'>
      <data-member access='public'>
        <var-decl name='nm' type-id='type-id-63' visibility='default' filepath='../src/abi.h' line='146' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='networkd' type-id='type-id-64' visibility='default' filepath='../src/abi.h' line='149' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='NetplanNMSettings' size-in-bits='320' is-struct='yes' visibility='default' filepath='../src/abi.h' line='140' column='1' id='type-id-63'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uuid' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='stable_id' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='device' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='passthrough' type-id='type-id-65' visibility='default' filepath='../src/abi.h' line='145' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='NetplanNetworkdSettings' size-in-bits='64' is-struct='yes' visibility='default' filepath='../src/abi.h' line='147' column='1' id='type-id-64'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='unit' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='148' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='NetplanBackendSettings' type-id='type-id-62' filepath='../src/abi.h' line='150' column='1' id='type-id-61'/>
    <class-decl name='netplan_net_definition' size-in-bits='8832' is-struct='yes' visibility='default' filepath='../src/abi.h' line='155' column='1' id='type-id-27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-13' visibility='default' filepath='../src/abi.h' line='156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='backend' type-id='type-id-31' visibility='default' filepath='../src/abi.h' line='157' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='158' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uuid' type-id='type-id-66' visibility='default' filepath='../src/abi.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='optional' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='163' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='optional_addresses' type-id='type-id-36' visibility='default' filepath='../src/abi.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='critical' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='dhcp4' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dhcp6' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dhcp_identifier' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='dhcp4_overrides' type-id='type-id-42' visibility='default' filepath='../src/abi.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='dhcp6_overrides' type-id='type-id-42' visibility='default' filepath='../src/abi.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='accept_ra' type-id='type-id-43' visibility='default' filepath='../src/abi.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='ip4_addresses' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='ip6_addresses' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='address_options' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='ip6_privacy' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='ip6_addr_gen_mode' type-id='type-id-41' visibility='default' filepath='../src/abi.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='ip6_addr_gen_token' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='gateway4' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='gateway6' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='ip4_nameservers' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='ip6_nameservers' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='search_domains' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='routes' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='ip_rules' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='wireguard_peers' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='linklocal' type-id='type-id-67' visibility='default' filepath='../src/abi.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='bridge' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='bond' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='peer' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='vlan_id' type-id='type-id-41' visibility='default' filepath='../src/abi.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='vlan_link' type-id='type-id-68' visibility='default' filepath='../src/abi.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='has_vlans' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='set_mac' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='mtubytes' type-id='type-id-41' visibility='default' filepath='../src/abi.h' line='209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='ipv6_mtubytes' type-id='type-id-41' visibility='default' filepath='../src/abi.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='set_name' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='215' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='match' type-id='type-id-69' visibility='default' filepath='../src/abi.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='has_match' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3040'>
        <var-decl name='wake_on_lan' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='wowlan' type-id='type-id-45' visibility='default' filepath='../src/abi.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3104'>
        <var-decl name='emit_lldp' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='access_points' type-id='type-id-59' visibility='default' filepath='../src/abi.h' line='228' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='bond_params' type-id='type-id-70' visibility='default' filepath='../src/abi.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='modem_params' type-id='type-id-71' visibility='default' filepath='../src/abi.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='bridge_params' type-id='type-id-72' visibility='default' filepath='../src/abi.h' line='277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='custom_bridging' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='278' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='tunnel' type-id='type-id-73' visibility='default' filepath='../src/abi.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='auth' type-id='type-id-54' visibility='default' filepath='../src/abi.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6528'>
        <var-decl name='has_auth' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6592'>
        <var-decl name='sriov_link' type-id='type-id-74' visibility='default' filepath='../src/abi.h' line='296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='sriov_vlan_filter' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6688'>
        <var-decl name='sriov_explicit_vf_count' type-id='type-id-41' visibility='default' filepath='../src/abi.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='ovs_settings' type-id='type-id-60' visibility='default' filepath='../src/abi.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='7872'>
        <var-decl name='backend_settings' type-id='type-id-61' visibility='default' filepath='../src/abi.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8192'>
        <var-decl name='filename' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8256'>
        <var-decl name='tunnel_ttl' type-id='type-id-41' visibility='default' filepath='../src/abi.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8320'>
        <var-decl name='activation_mode' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8384'>
        <var-decl name='ignore_carrier' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8416'>
        <var-decl name='receive_checksum_offload' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8448'>
        <var-decl name='transmit_checksum_offload' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='318' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8480'>
        <var-decl name='tcp_segmentation_offload' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='tcp6_segmentation_offload' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='320' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8544'>
        <var-decl name='generic_segmentation_offload' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='321' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8576'>
        <var-decl name='generic_receive_offload' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='322' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8608'>
        <var-decl name='large_receive_offload' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8640'>
        <var-decl name='_private' type-id='type-id-75' visibility='default' filepath='../src/abi.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8704'>
        <var-decl name='embedded_switch_mode' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8768'>
        <var-decl name='sriov_delay_virtual_functions_rebind' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='329' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/abi.h' line='188' column='1' id='type-id-67'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ipv4' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ipv6' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='190' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/abi.h' line='216' column='1' id='type-id-69'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='driver' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mac' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='original_name' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='220' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='1216' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/abi.h' line='230' column='1' id='type-id-70'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mode' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lacp_rate' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='monitor_interval' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='min_links' type-id='type-id-41' visibility='default' filepath='../src/abi.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='transmit_hash_policy' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='selection_logic' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='all_slaves_active' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='arp_interval' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='arp_ip_targets' type-id='type-id-56' visibility='default' filepath='../src/abi.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='arp_validate' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='arp_all_targets' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='up_delay' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='down_delay' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='fail_over_mac_policy' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='gratuitous_arp' type-id='type-id-41' visibility='default' filepath='../src/abi.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='packets_per_slave' type-id='type-id-41' visibility='default' filepath='../src/abi.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='primary_reselect_policy' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='resend_igmp' type-id='type-id-41' visibility='default' filepath='../src/abi.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='learn_interval' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='primary_slave' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='251' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='640' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/abi.h' line='255' column='1' id='type-id-71'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='apn' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='auto_config' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='device_id' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='network_id' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='259' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='number' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='password' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pin' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sim_id' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='263' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='sim_operator_id' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='username' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='265' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='384' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/abi.h' line='268' column='1' id='type-id-72'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ageing_time' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='priority' type-id='type-id-41' visibility='default' filepath='../src/abi.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='port_priority' type-id='type-id-41' visibility='default' filepath='../src/abi.h' line='271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='forward_delay' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hello_time' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='max_age' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='274' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='path_cost' type-id='type-id-41' visibility='default' filepath='../src/abi.h' line='275' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='stp' type-id='type-id-39' visibility='default' filepath='../src/abi.h' line='276' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='448' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/abi.h' line='280' column='1' id='type-id-73'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mode' type-id='type-id-47' visibility='default' filepath='../src/abi.h' line='281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='local_ip' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='remote_ip' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='283' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='input_key' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='284' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='output_key' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='private_key' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='fwmark' type-id='type-id-41' visibility='default' filepath='../src/abi.h' line='287' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='port' type-id='type-id-41' visibility='default' filepath='../src/abi.h' line='288' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='private_netdef_data' size-in-bits='64' is-struct='yes' visibility='default' filepath='../src/types.h' line='52' column='1' id='type-id-76'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dirty_fields' type-id='type-id-59' visibility='default' filepath='../src/types.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='NetplanWifiMode' naming-typedef-id='type-id-77' filepath='../src/types.h' line='56' column='1' id='type-id-78'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='NETPLAN_WIFI_MODE_INFRASTRUCTURE' value='0'/>
      <enumerator name='NETPLAN_WIFI_MODE_ADHOC' value='1'/>
      <enumerator name='NETPLAN_WIFI_MODE_AP' value='2'/>
      <enumerator name='NETPLAN_WIFI_MODE_OTHER' value='3'/>
      <enumerator name='NETPLAN_WIFI_MODE_MAX_' value='4'/>
    </enum-decl>
    <typedef-decl name='NetplanWifiMode' type-id='type-id-78' filepath='../src/types.h' line='62' column='1' id='type-id-77'/>
    <class-decl name='NetplanWireguardPeer' size-in-bits='320' is-struct='yes' naming-typedef-id='type-id-79' visibility='default' filepath='../src/types.h' line='64' column='1' id='type-id-80'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='endpoint' type-id='type-id-40' visibility='default' filepath='../src/types.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='public_key' type-id='type-id-40' visibility='default' filepath='../src/types.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='preshared_key' type-id='type-id-40' visibility='default' filepath='../src/types.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='allowed_ips' type-id='type-id-56' visibility='default' filepath='../src/types.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='keepalive' type-id='type-id-41' visibility='default' filepath='../src/types.h' line='69' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='NetplanWireguardPeer' type-id='type-id-80' filepath='../src/types.h' line='70' column='1' id='type-id-79'/>
    <enum-decl name='NetplanWifiBand' naming-typedef-id='type-id-81' filepath='../src/types.h' line='72' column='1' id='type-id-82'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='NETPLAN_WIFI_BAND_DEFAULT' value='0'/>
      <enumerator name='NETPLAN_WIFI_BAND_5' value='1'/>
      <enumerator name='NETPLAN_WIFI_BAND_24' value='2'/>
    </enum-decl>
    <typedef-decl name='NetplanWifiBand' type-id='type-id-82' filepath='../src/types.h' line='76' column='1' id='type-id-81'/>
    <class-decl name='NetplanAddressOptions' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-83' visibility='default' filepath='../src/types.h' line='78' column='1' id='type-id-84'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='address' type-id='type-id-40' visibility='default' filepath='../src/types.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lifetime' type-id='type-id-40' visibility='default' filepath='../src/types.h' line='80' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='label' type-id='type-id-40' visibility='default' filepath='../src/types.h' line='81' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='NetplanAddressOptions' type-id='type-id-84' filepath='../src/types.h' line='82' column='1' id='type-id-83'/>
    <class-decl name='NetplanWifiAccessPoint' size-in-bits='1280' is-struct='yes' naming-typedef-id='type-id-85' visibility='default' filepath='../src/types.h' line='84' column='1' id='type-id-86'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mode' type-id='type-id-77' visibility='default' filepath='../src/types.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ssid' type-id='type-id-40' visibility='default' filepath='../src/types.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='band' type-id='type-id-81' visibility='default' filepath='../src/types.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bssid' type-id='type-id-40' visibility='default' filepath='../src/types.h' line='88' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='hidden' type-id='type-id-39' visibility='default' filepath='../src/types.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='channel' type-id='type-id-41' visibility='default' filepath='../src/types.h' line='90' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='auth' type-id='type-id-54' visibility='default' filepath='../src/types.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='has_auth' type-id='type-id-39' visibility='default' filepath='../src/types.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='backend_settings' type-id='type-id-61' visibility='default' filepath='../src/types.h' line='95' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='NetplanWifiAccessPoint' type-id='type-id-86' filepath='../src/types.h' line='96' column='1' id='type-id-85'/>
    <class-decl name='NetplanIPRoute' size-in-bits='640' is-struct='yes' naming-typedef-id='type-id-87' visibility='default' filepath='../src/types.h' line='98' column='1' id='type-id-88'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='family' type-id='type-id-41' visibility='default' filepath='../src/types.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-40' visibility='default' filepath='../src/types.h' line='100' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='scope' type-id='type-id-40' visibility='default' filepath='../src/types.h' line='101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='table' type-id='type-id-41' visibility='default' filepath='../src/types.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='from' type-id='type-id-40' visibility='default' filepath='../src/types.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='to' type-id='type-id-40' visibility='default' filepath='../src/types.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='via' type-id='type-id-40' visibility='default' filepath='../src/types.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='onlink' type-id='type-id-39' visibility='default' filepath='../src/types.h' line='108' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='metric' type-id='type-id-41' visibility='default' filepath='../src/types.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='mtubytes' type-id='type-id-41' visibility='default' filepath='../src/types.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='congestion_window' type-id='type-id-41' visibility='default' filepath='../src/types.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='advertised_receive_window' type-id='type-id-41' visibility='default' filepath='../src/types.h' line='116' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='NetplanIPRoute' type-id='type-id-88' filepath='../src/types.h' line='117' column='1' id='type-id-87'/>
    <class-decl name='NetplanIPRule' size-in-bits='320' is-struct='yes' naming-typedef-id='type-id-89' visibility='default' filepath='../src/types.h' line='119' column='1' id='type-id-90'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='family' type-id='type-id-41' visibility='default' filepath='../src/types.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='from' type-id='type-id-40' visibility='default' filepath='../src/types.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='to' type-id='type-id-40' visibility='default' filepath='../src/types.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='table' type-id='type-id-41' visibility='default' filepath='../src/types.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='priority' type-id='type-id-41' visibility='default' filepath='../src/types.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fwmark' type-id='type-id-41' visibility='default' filepath='../src/types.h' line='129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='tos' type-id='type-id-41' visibility='default' filepath='../src/types.h' line='131' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='NetplanIPRule' type-id='type-id-90' filepath='../src/types.h' line='132' column='1' id='type-id-89'/>
    <class-decl name='netplan_state' size-in-bits='1344' is-struct='yes' visibility='default' filepath='../src/types.h' line='134' column='1' id='type-id-29'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='netdefs' type-id='type-id-59' visibility='default' filepath='../src/types.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='netdefs_ordered' type-id='type-id-91' visibility='default' filepath='../src/types.h' line='141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='backend' type-id='type-id-31' visibility='default' filepath='../src/types.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ovs_settings' type-id='type-id-60' visibility='default' filepath='../src/types.h' line='143' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='netplan_parser' size-in-bits='2944' is-struct='yes' visibility='default' filepath='../src/types.h' line='146' column='1' id='type-id-34'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='doc' type-id='type-id-92' visibility='default' filepath='../src/types.h' line='147' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='parsed_defs' type-id='type-id-59' visibility='default' filepath='../src/types.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='ordered' type-id='type-id-91' visibility='default' filepath='../src/types.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='global_backend' type-id='type-id-31' visibility='default' filepath='../src/types.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='global_ovs_settings' type-id='type-id-60' visibility='default' filepath='../src/types.h' line='155' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='current' type-id='type-id-93' visibility='default' filepath='../src/types.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='missing_id' type-id='type-id-59' visibility='default' filepath='../src/types.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='ids_in_file' type-id='type-id-59' visibility='default' filepath='../src/types.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='missing_ids_found' type-id='type-id-16' visibility='default' filepath='../src/types.h' line='194' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='576' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/types.h' line='158' column='1' id='type-id-93'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='netdef' type-id='type-id-68' visibility='default' filepath='../src/types.h' line='160' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='auth' type-id='type-id-94' visibility='default' filepath='../src/types.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='access_point' type-id='type-id-95' visibility='default' filepath='../src/types.h' line='164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='wireguard_peer' type-id='type-id-96' visibility='default' filepath='../src/types.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='addr_options' type-id='type-id-97' visibility='default' filepath='../src/types.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='route' type-id='type-id-98' visibility='default' filepath='../src/types.h' line='167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ip_rule' type-id='type-id-99' visibility='default' filepath='../src/types.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='filename' type-id='type-id-100' visibility='default' filepath='../src/types.h' line='169' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='backend' type-id='type-id-31' visibility='default' filepath='../src/types.h' line='174' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GArray' type-id='type-id-101' filepath='/usr/include/glib-2.0/glib/garray.h' line='37' column='1' id='type-id-102'/>
    <class-decl name='_GArray' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/glib/garray.h' line='41' column='1' id='type-id-101'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-103' visibility='default' filepath='/usr/include/glib-2.0/glib/garray.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-41' visibility='default' filepath='/usr/include/glib-2.0/glib/garray.h' line='44' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GData' type-id='type-id-7' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='36' column='1' id='type-id-104'/>
    <typedef-decl name='GError' type-id='type-id-105' filepath='/usr/include/glib-2.0/glib/gerror.h' line='41' column='1' id='type-id-106'/>
    <class-decl name='_GError' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='43' column='1' id='type-id-105'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='type-id-107' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='code' type-id='type-id-108' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='message' type-id='type-id-103' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='47' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GHashTable' type-id='type-id-8' filepath='/usr/include/glib-2.0/glib/ghash.h' line='37' column='1' id='type-id-109'/>
    <typedef-decl name='GList' type-id='type-id-110' filepath='/usr/include/glib-2.0/glib/glist.h' line='37' column='1' id='type-id-111'/>
    <class-decl name='_GList' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/glib/glist.h' line='39' column='1' id='type-id-110'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-112' visibility='default' filepath='/usr/include/glib-2.0/glib/glist.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-91' visibility='default' filepath='/usr/include/glib-2.0/glib/glist.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='prev' type-id='type-id-91' visibility='default' filepath='/usr/include/glib-2.0/glib/glist.h' line='43' column='1'/>
      </data-member>
    </class-decl>
    <enum-decl name='GLogLevelFlags' naming-typedef-id='type-id-113' filepath='/usr/include/glib-2.0/glib/gmessages.h' line='54' column='1' id='type-id-114'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='G_LOG_FLAG_RECURSION' value='1'/>
      <enumerator name='G_LOG_FLAG_FATAL' value='2'/>
      <enumerator name='G_LOG_LEVEL_ERROR' value='4'/>
      <enumerator name='G_LOG_LEVEL_CRITICAL' value='8'/>
      <enumerator name='G_LOG_LEVEL_WARNING' value='16'/>
      <enumerator name='G_LOG_LEVEL_MESSAGE' value='32'/>
      <enumerator name='G_LOG_LEVEL_INFO' value='64'/>
      <enumerator name='G_LOG_LEVEL_DEBUG' value='128'/>
      <enumerator name='G_LOG_LEVEL_MASK' value='-4'/>
    </enum-decl>
    <typedef-decl name='GLogLevelFlags' type-id='type-id-114' filepath='/usr/include/glib-2.0/glib/gmessages.h' line='68' column='1' id='type-id-113'/>
    <typedef-decl name='GQuark' type-id='type-id-115' filepath='/usr/include/glib-2.0/glib/gquark.h' line='36' column='1' id='type-id-107'/>
    <typedef-decl name='gchar' type-id='type-id-1' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='46' column='1' id='type-id-116'/>
    <typedef-decl name='gint' type-id='type-id-16' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='49' column='1' id='type-id-108'/>
    <typedef-decl name='gboolean' type-id='type-id-108' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='50' column='1' id='type-id-39'/>
    <typedef-decl name='guint' type-id='type-id-23' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='55' column='1' id='type-id-41'/>
    <typedef-decl name='gpointer' type-id='type-id-117' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='103' column='1' id='type-id-112'/>
    <typedef-decl name='gconstpointer' type-id='type-id-117' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='104' column='1' id='type-id-118'/>
    <typedef-decl name='uuid_t' type-id='type-id-21' filepath='/usr/include/uuid/uuid.h' line='44' column='1' id='type-id-66'/>
    <typedef-decl name='__off_t' type-id='type-id-17' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-119'/>
    <typedef-decl name='__off64_t' type-id='type-id-17' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-120'/>
    <typedef-decl name='FILE' type-id='type-id-121' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-122'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-26' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-123'/>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-121'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-16' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-40' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-40' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-40' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-40' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-40' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-40' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-40' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-40' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-40' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-40' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-40' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-124' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-125' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-16' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-16' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-119' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-24' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-18' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-2' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-126' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-120' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-127' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-128' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-125' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-117' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-129' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-16' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-5' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='yaml_char_t' type-id='type-id-20' filepath='/usr/include/yaml.h' line='80' column='1' id='type-id-130'/>
    <class-decl name='yaml_version_directive_s' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='83' column='1' id='type-id-131'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='major' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='minor' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='yaml_version_directive_t' type-id='type-id-131' filepath='/usr/include/yaml.h' line='88' column='1' id='type-id-132'/>
    <class-decl name='yaml_tag_directive_s' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='91' column='1' id='type-id-133'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prefix' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='95' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='yaml_tag_directive_t' type-id='type-id-133' filepath='/usr/include/yaml.h' line='96' column='1' id='type-id-135'/>
    <class-decl name='yaml_mark_s' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='147' column='1' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='index' type-id='type-id-129' visibility='default' filepath='/usr/include/yaml.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='line' type-id='type-id-129' visibility='default' filepath='/usr/include/yaml.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='column' type-id='type-id-129' visibility='default' filepath='/usr/include/yaml.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='yaml_mark_t' type-id='type-id-136' filepath='/usr/include/yaml.h' line='156' column='1' id='type-id-137'/>
    <enum-decl name='yaml_scalar_style_e' filepath='/usr/include/yaml.h' line='166' column='1' id='type-id-138'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='YAML_ANY_SCALAR_STYLE' value='0'/>
      <enumerator name='YAML_PLAIN_SCALAR_STYLE' value='1'/>
      <enumerator name='YAML_SINGLE_QUOTED_SCALAR_STYLE' value='2'/>
      <enumerator name='YAML_DOUBLE_QUOTED_SCALAR_STYLE' value='3'/>
      <enumerator name='YAML_LITERAL_SCALAR_STYLE' value='4'/>
      <enumerator name='YAML_FOLDED_SCALAR_STYLE' value='5'/>
    </enum-decl>
    <typedef-decl name='yaml_scalar_style_t' type-id='type-id-138' filepath='/usr/include/yaml.h' line='182' column='1' id='type-id-139'/>
    <enum-decl name='yaml_sequence_style_e' filepath='/usr/include/yaml.h' line='185' column='1' id='type-id-140'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='YAML_ANY_SEQUENCE_STYLE' value='0'/>
      <enumerator name='YAML_BLOCK_SEQUENCE_STYLE' value='1'/>
      <enumerator name='YAML_FLOW_SEQUENCE_STYLE' value='2'/>
    </enum-decl>
    <typedef-decl name='yaml_sequence_style_t' type-id='type-id-140' filepath='/usr/include/yaml.h' line='193' column='1' id='type-id-141'/>
    <enum-decl name='yaml_mapping_style_e' filepath='/usr/include/yaml.h' line='196' column='1' id='type-id-142'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='YAML_ANY_MAPPING_STYLE' value='0'/>
      <enumerator name='YAML_BLOCK_MAPPING_STYLE' value='1'/>
      <enumerator name='YAML_FLOW_MAPPING_STYLE' value='2'/>
    </enum-decl>
    <typedef-decl name='yaml_mapping_style_t' type-id='type-id-142' filepath='/usr/include/yaml.h' line='205' column='1' id='type-id-143'/>
    <enum-decl name='yaml_node_type_e' filepath='/usr/include/yaml.h' line='692' column='1' id='type-id-144'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='YAML_NO_NODE' value='0'/>
      <enumerator name='YAML_SCALAR_NODE' value='1'/>
      <enumerator name='YAML_SEQUENCE_NODE' value='2'/>
      <enumerator name='YAML_MAPPING_NODE' value='3'/>
    </enum-decl>
    <typedef-decl name='yaml_node_type_t' type-id='type-id-144' filepath='/usr/include/yaml.h' line='702' column='1' id='type-id-145'/>
    <typedef-decl name='yaml_node_t' type-id='type-id-146' filepath='/usr/include/yaml.h' line='705' column='1' id='type-id-147'/>
    <typedef-decl name='yaml_node_item_t' type-id='type-id-16' filepath='/usr/include/yaml.h' line='708' column='1' id='type-id-148'/>
    <class-decl name='yaml_node_pair_s' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='711' column='1' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='key' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='713' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='value' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='715' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='yaml_node_pair_t' type-id='type-id-149' filepath='/usr/include/yaml.h' line='716' column='1' id='type-id-150'/>
    <class-decl name='yaml_node_s' size-in-bits='768' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='719' column='1' id='type-id-146'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-145' visibility='default' filepath='/usr/include/yaml.h' line='722' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tag' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data' type-id='type-id-151' visibility='default' filepath='/usr/include/yaml.h' line='770' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='start_mark' type-id='type-id-137' visibility='default' filepath='/usr/include/yaml.h' line='773' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='end_mark' type-id='type-id-137' visibility='default' filepath='/usr/include/yaml.h' line='775' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='256' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='728' column='1' id='type-id-151'>
      <data-member access='public'>
        <var-decl name='scalar' type-id='type-id-152' visibility='default' filepath='/usr/include/yaml.h' line='738' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sequence' type-id='type-id-153' visibility='default' filepath='/usr/include/yaml.h' line='753' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mapping' type-id='type-id-154' visibility='default' filepath='/usr/include/yaml.h' line='768' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='731' column='1' id='type-id-152'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='733' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='length' type-id='type-id-129' visibility='default' filepath='/usr/include/yaml.h' line='735' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='style' type-id='type-id-139' visibility='default' filepath='/usr/include/yaml.h' line='737' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='741' column='1' id='type-id-153'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='items' type-id='type-id-155' visibility='default' filepath='/usr/include/yaml.h' line='750' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='style' type-id='type-id-141' visibility='default' filepath='/usr/include/yaml.h' line='752' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='743' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-156' visibility='default' filepath='/usr/include/yaml.h' line='745' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-156' visibility='default' filepath='/usr/include/yaml.h' line='747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-156' visibility='default' filepath='/usr/include/yaml.h' line='749' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='756' column='1' id='type-id-154'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pairs' type-id='type-id-157' visibility='default' filepath='/usr/include/yaml.h' line='765' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='style' type-id='type-id-143' visibility='default' filepath='/usr/include/yaml.h' line='767' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='758' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-158' visibility='default' filepath='/usr/include/yaml.h' line='760' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-158' visibility='default' filepath='/usr/include/yaml.h' line='762' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-158' visibility='default' filepath='/usr/include/yaml.h' line='764' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_document_s' size-in-bits='832' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='780' column='1' id='type-id-159'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nodes' type-id='type-id-160' visibility='default' filepath='/usr/include/yaml.h' line='790' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='version_directive' type-id='type-id-161' visibility='default' filepath='/usr/include/yaml.h' line='793' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tag_directives' type-id='type-id-162' visibility='default' filepath='/usr/include/yaml.h' line='801' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='start_implicit' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='804' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='end_implicit' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='806' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='start_mark' type-id='type-id-137' visibility='default' filepath='/usr/include/yaml.h' line='809' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='end_mark' type-id='type-id-137' visibility='default' filepath='/usr/include/yaml.h' line='811' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='783' column='1' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-163' visibility='default' filepath='/usr/include/yaml.h' line='785' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-163' visibility='default' filepath='/usr/include/yaml.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-163' visibility='default' filepath='/usr/include/yaml.h' line='789' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='796' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-164' visibility='default' filepath='/usr/include/yaml.h' line='798' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-164' visibility='default' filepath='/usr/include/yaml.h' line='800' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='yaml_document_t' type-id='type-id-159' filepath='/usr/include/yaml.h' line='813' column='1' id='type-id-92'/>
    <typedef-decl name='size_t' type-id='type-id-3' filepath='/usr/lib/gcc/x86_64-linux-gnu/11/include/stddef.h' line='209' column='1' id='type-id-129'/>
    <typedef-decl name='guint32' type-id='type-id-23' filepath='/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h' line='54' column='1' id='type-id-115'/>
    <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-165'/>
    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-104' size-in-bits='64' id='type-id-65'/>
    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-166'/>
    <pointer-type-def type-id='type-id-166' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-111' size-in-bits='64' id='type-id-91'/>
    <pointer-type-def type-id='type-id-83' size-in-bits='64' id='type-id-97'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-94'/>
    <pointer-type-def type-id='type-id-87' size-in-bits='64' id='type-id-98'/>
    <pointer-type-def type-id='type-id-89' size-in-bits='64' id='type-id-99'/>
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-68'/>
    <pointer-type-def type-id='type-id-35' size-in-bits='64' id='type-id-168'/>
    <pointer-type-def type-id='type-id-168' size-in-bits='64' id='type-id-169'/>
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-15'/>
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-170'/>
    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-95'/>
    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-96'/>
    <pointer-type-def type-id='type-id-121' size-in-bits='64' id='type-id-125'/>
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-127'/>
    <pointer-type-def type-id='type-id-123' size-in-bits='64' id='type-id-126'/>
    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-124'/>
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-128'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-40'/>
    <qualified-type-def type-id='type-id-28' const='yes' id='type-id-171'/>
    <pointer-type-def type-id='type-id-171' size-in-bits='64' id='type-id-172'/>
    <qualified-type-def type-id='type-id-30' const='yes' id='type-id-173'/>
    <pointer-type-def type-id='type-id-173' size-in-bits='64' id='type-id-174'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-175'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-100'/>
    <qualified-type-def type-id='type-id-116' const='yes' id='type-id-176'/>
    <pointer-type-def type-id='type-id-176' size-in-bits='64' id='type-id-177'/>
    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-103'/>
    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-178'/>
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-74'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-75'/>
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-117'/>
    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-134'/>
    <pointer-type-def type-id='type-id-148' size-in-bits='64' id='type-id-156'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-158'/>
    <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-163'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-164'/>
    <pointer-type-def type-id='type-id-132' size-in-bits='64' id='type-id-161'/>
    <class-decl name='_GData' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-7'/>
    <class-decl name='_GHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-8'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-9'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-10'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-11'/>
    <function-decl name='netplan_state_new' mangled-name='netplan_state_new' filepath='../include/netplan.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_new'>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='netplan_state_reset' mangled-name='netplan_state_reset' filepath='../include/netplan.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_reset'>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='netplan_state_clear' mangled-name='netplan_state_clear' filepath='../include/netplan.h' line='46' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_clear'>
      <parameter type-id='type-id-170'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='netplan_state_get_backend' mangled-name='netplan_state_get_backend' filepath='../include/netplan.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_get_backend'>
      <parameter type-id='type-id-174'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='netplan_state_get_netdefs_size' mangled-name='netplan_state_get_netdefs_size' filepath='../include/netplan.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_get_netdefs_size'>
      <parameter type-id='type-id-174'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='netplan_state_get_netdef' mangled-name='netplan_state_get_netdef' filepath='../include/netplan.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_get_netdef'>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='netplan_state_dump_yaml' mangled-name='netplan_state_dump_yaml' filepath='../include/netplan.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_dump_yaml'>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='netplan_netdef_write_yaml' mangled-name='netplan_netdef_write_yaml' filepath='../include/netplan.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_netdef_write_yaml'>
      <parameter type-id='type-id-174'/>
      <parameter type-id='type-id-172'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='netplan_netdef_get_filename' mangled-name='netplan_netdef_get_filename' filepath='../include/netplan.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_netdef_get_filename'>
      <parameter type-id='type-id-172'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='netplan_parser_load_keyfile' mangled-name='netplan_parser_load_keyfile' filepath='../include/parse-nm.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_load_keyfile'>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='netplan_parser_new' mangled-name='netplan_parser_new' filepath='../include/parse.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_new'>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-168'/>
    </function-decl>
    <function-decl name='netplan_parser_reset' mangled-name='netplan_parser_reset' filepath='../include/parse.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_reset'>
      <parameter type-id='type-id-168'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='netplan_parser_clear' mangled-name='netplan_parser_clear' filepath='../include/parse.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_clear'>
      <parameter type-id='type-id-169'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='netplan_parser_load_yaml' mangled-name='netplan_parser_load_yaml' filepath='../include/parse.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_load_yaml'>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='netplan_state_import_parser_results' mangled-name='netplan_state_import_parser_results' filepath='../include/parse.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_import_parser_results'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <var-decl name='global_state' type-id='type-id-30' mangled-name='global_state' visibility='default' filepath='../src/abi_compat.c' line='64' column='1' elf-symbol-id='global_state'/>
    <function-decl name='netplan_get_global_backend' mangled-name='netplan_get_global_backend' filepath='../src/abi_compat.c' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_get_global_backend'>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='netplan_clear_netdefs' mangled-name='netplan_clear_netdefs' filepath='../src/abi_compat.c' line='78' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_clear_netdefs'>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='netplan_parse_yaml' mangled-name='netplan_parse_yaml' filepath='../src/abi_compat.c' line='88' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parse_yaml'>
      <parameter type-id='type-id-100' name='filename' filepath='../src/abi_compat.c' line='88' column='1'/>
      <parameter type-id='type-id-167' name='error' filepath='../src/abi_compat.c' line='88' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='netplan_finish_parse' mangled-name='netplan_finish_parse' filepath='../src/abi_compat.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_finish_parse'>
      <parameter type-id='type-id-167' name='error' filepath='../src/abi_compat.c' line='97' column='1'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='write_netplan_conf' mangled-name='write_netplan_conf' filepath='../src/abi_compat.c' line='111' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='write_netplan_conf'>
      <parameter type-id='type-id-172' name='def' filepath='../src/abi_compat.c' line='111' column='1'/>
      <parameter type-id='type-id-100' name='rootdir' filepath='../src/abi_compat.c' line='111' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='write_netplan_conf_full' mangled-name='write_netplan_conf_full' filepath='../src/abi_compat.c' line='126' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='write_netplan_conf_full'>
      <parameter type-id='type-id-100' name='file_hint' filepath='../src/abi_compat.c' line='126' column='1'/>
      <parameter type-id='type-id-100' name='rootdir' filepath='../src/abi_compat.c' line='126' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='netplan_parse_keyfile' mangled-name='netplan_parse_keyfile' filepath='../src/abi_compat.c' line='140' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parse_keyfile'>
      <parameter type-id='type-id-100' name='filename' filepath='../src/abi_compat.c' line='140' column='1'/>
      <parameter type-id='type-id-167' name='error' filepath='../src/abi_compat.c' line='140' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='process_input_file' mangled-name='process_input_file' filepath='../src/abi_compat.c' line='146' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='process_input_file'>
      <parameter type-id='type-id-100' name='f' filepath='../src/abi_compat.c' line='146' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='process_yaml_hierarchy' mangled-name='process_yaml_hierarchy' filepath='../src/abi_compat.c' line='158' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='process_yaml_hierarchy'>
      <parameter type-id='type-id-100' name='rootdir' filepath='../src/abi_compat.c' line='158' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='_write_netplan_conf' mangled-name='_write_netplan_conf' filepath='../src/abi_compat.c' line='173' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_write_netplan_conf'>
      <parameter type-id='type-id-100' name='netdef_id' filepath='../src/abi_compat.c' line='173' column='1'/>
      <parameter type-id='type-id-100' name='rootdir' filepath='../src/abi_compat.c' line='173' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='netplan_get_filename_by_id' mangled-name='netplan_get_filename_by_id' filepath='../src/abi_compat.c' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_get_filename_by_id'>
      <parameter type-id='type-id-100' name='netdef_id' filepath='../src/abi_compat.c' line='191' column='1'/>
      <parameter type-id='type-id-100' name='rootdir' filepath='../src/abi_compat.c' line='191' column='1'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='_netplan_state_new_netdef_pertype_iter' mangled-name='_netplan_state_new_netdef_pertype_iter' filepath='../src/abi_compat.c' line='214' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_netplan_state_new_netdef_pertype_iter'>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-178'/>
    </function-decl>
    <function-decl name='_netplan_iter_defs_per_devtype_init' mangled-name='_netplan_iter_defs_per_devtype_init' filepath='../src/abi_compat.c' line='217' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_netplan_iter_defs_per_devtype_init'>
      <parameter type-id='type-id-100' name='devtype' filepath='../src/abi_compat.c' line='217' column='1'/>
      <return type-id='type-id-178'/>
    </function-decl>
    <function-decl name='netplan_state_has_nondefault_globals' filepath='../src/types.h' line='228' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-174'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='netplan_parser_load_yaml_hierarchy' mangled-name='netplan_parser_load_yaml_hierarchy' filepath='../src/util-internal.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_load_yaml_hierarchy'>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_build_path' filepath='/usr/include/glib-2.0/glib/gfileutils.h' line='165' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='g_hash_table_lookup' filepath='/usr/include/glib-2.0/glib/ghash.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='g_free' filepath='/usr/include/glib-2.0/glib/gmem.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_log' filepath='/usr/include/glib-2.0/glib/gmessages.h' line='103' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-113'/>
      <parameter type-id='type-id-177'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_fprintf' filepath='/usr/include/glib-2.0/glib/gprintf.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-177'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='g_strdup' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='217' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='exit' filepath='/usr/include/stdlib.h' line='624' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../src/error.c' comp-dir-path='/home/lukas/canonical/netplan/build' language='LANG_C99'>
    <class-decl name='_GBufferedInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-179'/>
    <class-decl name='_GCancellablePrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-180'/>
    <class-decl name='_GDataInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-181'/>
    <class-decl name='_GFile' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-182'/>
    <class-decl name='_GFileInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-183'/>
    <class-decl name='_GInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-184'/>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-185'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-23' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-117' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-117' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GBufferedInputStreamPrivate' type-id='type-id-179' filepath='/usr/include/glib-2.0/gio/gbufferedinputstream.h' line='45' column='1' id='type-id-186'/>
    <class-decl name='_GBufferedInputStream' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gio/gbufferedinputstream.h' line='47' column='1' id='type-id-187'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-188' visibility='default' filepath='/usr/include/glib-2.0/gio/gbufferedinputstream.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='priv' type-id='type-id-189' visibility='default' filepath='/usr/include/glib-2.0/gio/gbufferedinputstream.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GCancellablePrivate' type-id='type-id-180' filepath='/usr/include/glib-2.0/gio/gcancellable.h' line='45' column='1' id='type-id-190'/>
    <class-decl name='_GCancellable' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gio/gcancellable.h' line='47' column='1' id='type-id-191'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-192' visibility='default' filepath='/usr/include/glib-2.0/gio/gcancellable.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-193' visibility='default' filepath='/usr/include/glib-2.0/gio/gcancellable.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GDataInputStreamPrivate' type-id='type-id-181' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='46' column='1' id='type-id-194'/>
    <class-decl name='_GDataInputStream' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='48' column='1' id='type-id-195'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-196' visibility='default' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='priv' type-id='type-id-197' visibility='default' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GFileInputStreamPrivate' type-id='type-id-183' filepath='/usr/include/glib-2.0/gio/gfileinputstream.h' line='48' column='1' id='type-id-198'/>
    <class-decl name='_GFileInputStream' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gio/gfileinputstream.h' line='50' column='1' id='type-id-199'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-200' visibility='default' filepath='/usr/include/glib-2.0/gio/gfileinputstream.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-201' visibility='default' filepath='/usr/include/glib-2.0/gio/gfileinputstream.h' line='55' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GFilterInputStream' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gio/gfilterinputstream.h' line='46' column='1' id='type-id-202'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-200' visibility='default' filepath='/usr/include/glib-2.0/gio/gfilterinputstream.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='base_stream' type-id='type-id-203' visibility='default' filepath='/usr/include/glib-2.0/gio/gfilterinputstream.h' line='51' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GInputStreamPrivate' type-id='type-id-184' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='45' column='1' id='type-id-204'/>
    <class-decl name='_GInputStream' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='47' column='1' id='type-id-205'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-192' visibility='default' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-206' visibility='default' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GBufferedInputStream' type-id='type-id-187' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='36' column='1' id='type-id-196'/>
    <typedef-decl name='GCancellable' type-id='type-id-191' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='38' column='1' id='type-id-207'/>
    <typedef-decl name='GDataInputStream' type-id='type-id-195' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='44' column='1' id='type-id-208'/>
    <typedef-decl name='GFilterInputStream' type-id='type-id-202' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='74' column='1' id='type-id-188'/>
    <typedef-decl name='GFile' type-id='type-id-182' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='84' column='1' id='type-id-209'/>
    <typedef-decl name='GFileInputStream' type-id='type-id-199' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='96' column='1' id='type-id-210'/>
    <typedef-decl name='GInputStream' type-id='type-id-205' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='108' column='1' id='type-id-200'/>
    <typedef-decl name='GString' type-id='type-id-211' filepath='/usr/include/glib-2.0/glib/gstring.h' line='39' column='1' id='type-id-212'/>
    <class-decl name='_GString' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/glib/gstring.h' line='41' column='1' id='type-id-211'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='str' type-id='type-id-103' visibility='default' filepath='/usr/include/glib-2.0/glib/gstring.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-213' visibility='default' filepath='/usr/include/glib-2.0/glib/gstring.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='allocated_len' type-id='type-id-213' visibility='default' filepath='/usr/include/glib-2.0/glib/gstring.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GObject' type-id='type-id-214' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='190' column='1' id='type-id-192'/>
    <class-decl name='_GObject' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='265' column='1' id='type-id-214'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type_instance' type-id='type-id-215' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ref_count' type-id='type-id-41' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='qdata' type-id='type-id-65' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='271' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GType' type-id='type-id-213' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='400' column='1' id='type-id-216'/>
    <typedef-decl name='GTypeClass' type-id='type-id-217' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='407' column='1' id='type-id-218'/>
    <typedef-decl name='GTypeInstance' type-id='type-id-219' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='409' column='1' id='type-id-215'/>
    <class-decl name='_GTypeClass' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='424' column='1' id='type-id-217'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-216' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='427' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GTypeInstance' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='434' column='1' id='type-id-219'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_class' type-id='type-id-220' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='437' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='gsize' type-id='type-id-3' filepath='/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h' line='80' column='1' id='type-id-213'/>
    <pointer-type-def type-id='type-id-186' size-in-bits='64' id='type-id-189'/>
    <pointer-type-def type-id='type-id-207' size-in-bits='64' id='type-id-221'/>
    <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-193'/>
    <pointer-type-def type-id='type-id-208' size-in-bits='64' id='type-id-222'/>
    <pointer-type-def type-id='type-id-194' size-in-bits='64' id='type-id-197'/>
    <pointer-type-def type-id='type-id-209' size-in-bits='64' id='type-id-223'/>
    <pointer-type-def type-id='type-id-210' size-in-bits='64' id='type-id-224'/>
    <pointer-type-def type-id='type-id-198' size-in-bits='64' id='type-id-201'/>
    <pointer-type-def type-id='type-id-200' size-in-bits='64' id='type-id-203'/>
    <pointer-type-def type-id='type-id-204' size-in-bits='64' id='type-id-206'/>
    <pointer-type-def type-id='type-id-212' size-in-bits='64' id='type-id-225'/>
    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-220'/>
    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-226'/>
    <pointer-type-def type-id='type-id-185' size-in-bits='64' id='type-id-227'/>
    <pointer-type-def type-id='type-id-103' size-in-bits='64' id='type-id-228'/>
    <pointer-type-def type-id='type-id-213' size-in-bits='64' id='type-id-229'/>
    <class-decl name='_GBufferedInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-179'/>
    <class-decl name='_GCancellablePrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-180'/>
    <class-decl name='_GDataInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-181'/>
    <class-decl name='_GFile' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-182'/>
    <class-decl name='_GFileInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-183'/>
    <class-decl name='_GInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-184'/>
    <function-decl name='g_data_input_stream_new' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-203'/>
      <return type-id='type-id-222'/>
    </function-decl>
    <function-decl name='g_data_input_stream_read_line' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-222'/>
      <parameter type-id='type-id-229'/>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='g_file_new_for_path' filepath='/usr/include/glib-2.0/gio/gfile.h' line='608' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-223'/>
    </function-decl>
    <function-decl name='g_file_read' filepath='/usr/include/glib-2.0/gio/gfile.h' line='671' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-223'/>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-224'/>
    </function-decl>
    <function-decl name='g_input_stream_get_type' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-216'/>
    </function-decl>
    <function-decl name='g_set_error' filepath='/usr/include/glib-2.0/glib/gerror.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-108'/>
      <parameter type-id='type-id-177'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_markup_error_quark' filepath='/usr/include/glib-2.0/glib/gmarkup.h' line='73' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-107'/>
    </function-decl>
    <function-decl name='g_vasprintf' filepath='/usr/include/glib-2.0/glib/gprintf.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-228'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-227'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='g_string_sized_new' filepath='/usr/include/glib-2.0/glib/gstring.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-225'/>
    </function-decl>
    <function-decl name='g_string_free' filepath='/usr/include/glib-2.0/glib/gstring.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-225'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='g_string_append_printf' filepath='/usr/include/glib-2.0/glib/gstring.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-225'/>
      <parameter type-id='type-id-177'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_object_unref' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='523' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_type_check_instance_cast' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='2422' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-226'/>
      <parameter type-id='type-id-216'/>
      <return type-id='type-id-226'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../src/names.c' comp-dir-path='/home/lukas/canonical/netplan/build' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-230' size-in-bits='256' id='type-id-231'>
      <subrange length='4' type-id='type-id-3' id='type-id-232'/>
    </array-type-def>
    <qualified-type-def type-id='type-id-100' const='yes' id='type-id-230'/>
    <var-decl name='netplan_backend_to_str' type-id='type-id-231' mangled-name='netplan_backend_to_name' visibility='default' filepath='../src/names.c' line='25' column='1' elf-symbol-id='netplan_backend_to_name'/>
    <function-decl name='netplan_backend_name' mangled-name='netplan_backend_name' filepath='../src/names.c' line='100' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_backend_name'>
      <parameter type-id='type-id-31' name='val' filepath='../src/names.c' line='100' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='netplan_tunnel_mode_name' mangled-name='tunnel_mode_to_string' filepath='../src/names.c' line='104' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='tunnel_mode_to_string'>
      <parameter type-id='type-id-47' name='val' filepath='../src/names.c' line='104' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='g_strcmp0' filepath='/usr/include/glib-2.0/glib/gtestutils.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-16'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../src/netplan.c' comp-dir-path='/home/lukas/canonical/netplan/build' language='LANG_C99'>
    <enum-decl name='NetplanAddrGenMode' naming-typedef-id='type-id-233' filepath='../src/types.h' line='30' column='1' id='type-id-234'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='NETPLAN_ADDRGEN_DEFAULT' value='0'/>
      <enumerator name='NETPLAN_ADDRGEN_EUI64' value='1'/>
      <enumerator name='NETPLAN_ADDRGEN_STABLEPRIVACY' value='2'/>
      <enumerator name='NETPLAN_ADDRGEN_MAX' value='3'/>
    </enum-decl>
    <typedef-decl name='NetplanAddrGenMode' type-id='type-id-234' filepath='../src/types.h' line='35' column='1' id='type-id-233'/>
    <typedef-decl name='GDataForeachFunc' type-id='type-id-235' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='38' column='1' id='type-id-236'/>
    <typedef-decl name='GHashTableIter' type-id='type-id-237' filepath='/usr/include/glib-2.0/glib/ghash.h' line='43' column='1' id='type-id-14'/>
    <class-decl name='_GHashTableIter' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='45' column='1' id='type-id-237'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy1' type-id='type-id-112' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dummy2' type-id='type-id-112' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dummy3' type-id='type-id-112' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dummy4' type-id='type-id-16' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dummy5' type-id='type-id-39' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dummy6' type-id='type-id-112' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='53' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GCompareFunc' type-id='type-id-238' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='106' column='1' id='type-id-239'/>
    <typedef-decl name='GEqualFunc' type-id='type-id-240' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='111' column='1' id='type-id-241'/>
    <typedef-decl name='GDestroyNotify' type-id='type-id-242' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='113' column='1' id='type-id-243'/>
    <typedef-decl name='GHashFunc' type-id='type-id-244' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='116' column='1' id='type-id-245'/>
    <enum-decl name='yaml_encoding_e' filepath='/usr/include/yaml.h' line='99' column='1' id='type-id-246'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='YAML_ANY_ENCODING' value='0'/>
      <enumerator name='YAML_UTF8_ENCODING' value='1'/>
      <enumerator name='YAML_UTF16LE_ENCODING' value='2'/>
      <enumerator name='YAML_UTF16BE_ENCODING' value='3'/>
    </enum-decl>
    <typedef-decl name='yaml_encoding_t' type-id='type-id-246' filepath='/usr/include/yaml.h' line='108' column='1' id='type-id-247'/>
    <enum-decl name='yaml_break_e' filepath='/usr/include/yaml.h' line='112' column='1' id='type-id-248'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='YAML_ANY_BREAK' value='0'/>
      <enumerator name='YAML_CR_BREAK' value='1'/>
      <enumerator name='YAML_LN_BREAK' value='2'/>
      <enumerator name='YAML_CRLN_BREAK' value='3'/>
    </enum-decl>
    <typedef-decl name='yaml_break_t' type-id='type-id-248' filepath='/usr/include/yaml.h' line='121' column='1' id='type-id-249'/>
    <enum-decl name='yaml_error_type_e' filepath='/usr/include/yaml.h' line='124' column='1' id='type-id-250'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='YAML_NO_ERROR' value='0'/>
      <enumerator name='YAML_MEMORY_ERROR' value='1'/>
      <enumerator name='YAML_READER_ERROR' value='2'/>
      <enumerator name='YAML_SCANNER_ERROR' value='3'/>
      <enumerator name='YAML_PARSER_ERROR' value='4'/>
      <enumerator name='YAML_COMPOSER_ERROR' value='5'/>
      <enumerator name='YAML_WRITER_ERROR' value='6'/>
      <enumerator name='YAML_EMITTER_ERROR' value='7'/>
    </enum-decl>
    <typedef-decl name='yaml_error_type_t' type-id='type-id-250' filepath='/usr/include/yaml.h' line='144' column='1' id='type-id-251'/>
    <enum-decl name='yaml_event_type_e' filepath='/usr/include/yaml.h' line='355' column='1' id='type-id-252'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='YAML_NO_EVENT' value='0'/>
      <enumerator name='YAML_STREAM_START_EVENT' value='1'/>
      <enumerator name='YAML_STREAM_END_EVENT' value='2'/>
      <enumerator name='YAML_DOCUMENT_START_EVENT' value='3'/>
      <enumerator name='YAML_DOCUMENT_END_EVENT' value='4'/>
      <enumerator name='YAML_ALIAS_EVENT' value='5'/>
      <enumerator name='YAML_SCALAR_EVENT' value='6'/>
      <enumerator name='YAML_SEQUENCE_START_EVENT' value='7'/>
      <enumerator name='YAML_SEQUENCE_END_EVENT' value='8'/>
      <enumerator name='YAML_MAPPING_START_EVENT' value='9'/>
      <enumerator name='YAML_MAPPING_END_EVENT' value='10'/>
    </enum-decl>
    <typedef-decl name='yaml_event_type_t' type-id='type-id-252' filepath='/usr/include/yaml.h' line='383' column='1' id='type-id-253'/>
    <class-decl name='yaml_event_s' size-in-bits='832' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='386' column='1' id='type-id-254'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-253' visibility='default' filepath='/usr/include/yaml.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-255' visibility='default' filepath='/usr/include/yaml.h' line='471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='start_mark' type-id='type-id-137' visibility='default' filepath='/usr/include/yaml.h' line='474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='end_mark' type-id='type-id-137' visibility='default' filepath='/usr/include/yaml.h' line='476' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='392' column='1' id='type-id-255'>
      <data-member access='public'>
        <var-decl name='stream_start' type-id='type-id-256' visibility='default' filepath='/usr/include/yaml.h' line='398' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='document_start' type-id='type-id-257' visibility='default' filepath='/usr/include/yaml.h' line='415' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='document_end' type-id='type-id-258' visibility='default' filepath='/usr/include/yaml.h' line='421' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='alias' type-id='type-id-259' visibility='default' filepath='/usr/include/yaml.h' line='427' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='scalar' type-id='type-id-260' visibility='default' filepath='/usr/include/yaml.h' line='445' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sequence_start' type-id='type-id-261' visibility='default' filepath='/usr/include/yaml.h' line='457' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mapping_start' type-id='type-id-262' visibility='default' filepath='/usr/include/yaml.h' line='469' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='395' column='1' id='type-id-256'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='encoding' type-id='type-id-247' visibility='default' filepath='/usr/include/yaml.h' line='397' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='401' column='1' id='type-id-257'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version_directive' type-id='type-id-161' visibility='default' filepath='/usr/include/yaml.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tag_directives' type-id='type-id-162' visibility='default' filepath='/usr/include/yaml.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='implicit' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='414' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='418' column='1' id='type-id-258'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='implicit' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='420' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='424' column='1' id='type-id-259'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='anchor' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='426' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='384' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='430' column='1' id='type-id-260'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='anchor' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='432' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tag' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='434' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='length' type-id='type-id-129' visibility='default' filepath='/usr/include/yaml.h' line='438' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='plain_implicit' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='quoted_implicit' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='style' type-id='type-id-139' visibility='default' filepath='/usr/include/yaml.h' line='444' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='448' column='1' id='type-id-261'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='anchor' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tag' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='implicit' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='style' type-id='type-id-141' visibility='default' filepath='/usr/include/yaml.h' line='456' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='460' column='1' id='type-id-262'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='anchor' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tag' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='implicit' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='style' type-id='type-id-143' visibility='default' filepath='/usr/include/yaml.h' line='468' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='yaml_event_t' type-id='type-id-254' filepath='/usr/include/yaml.h' line='478' column='1' id='type-id-263'/>
    <typedef-decl name='yaml_write_handler_t' type-id='type-id-264' filepath='/usr/include/yaml.h' line='1478' column='1' id='type-id-265'/>
    <enum-decl name='yaml_emitter_state_e' filepath='/usr/include/yaml.h' line='1481' column='1' id='type-id-266'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='YAML_EMIT_STREAM_START_STATE' value='0'/>
      <enumerator name='YAML_EMIT_FIRST_DOCUMENT_START_STATE' value='1'/>
      <enumerator name='YAML_EMIT_DOCUMENT_START_STATE' value='2'/>
      <enumerator name='YAML_EMIT_DOCUMENT_CONTENT_STATE' value='3'/>
      <enumerator name='YAML_EMIT_DOCUMENT_END_STATE' value='4'/>
      <enumerator name='YAML_EMIT_FLOW_SEQUENCE_FIRST_ITEM_STATE' value='5'/>
      <enumerator name='YAML_EMIT_FLOW_SEQUENCE_ITEM_STATE' value='6'/>
      <enumerator name='YAML_EMIT_FLOW_MAPPING_FIRST_KEY_STATE' value='7'/>
      <enumerator name='YAML_EMIT_FLOW_MAPPING_KEY_STATE' value='8'/>
      <enumerator name='YAML_EMIT_FLOW_MAPPING_SIMPLE_VALUE_STATE' value='9'/>
      <enumerator name='YAML_EMIT_FLOW_MAPPING_VALUE_STATE' value='10'/>
      <enumerator name='YAML_EMIT_BLOCK_SEQUENCE_FIRST_ITEM_STATE' value='11'/>
      <enumerator name='YAML_EMIT_BLOCK_SEQUENCE_ITEM_STATE' value='12'/>
      <enumerator name='YAML_EMIT_BLOCK_MAPPING_FIRST_KEY_STATE' value='13'/>
      <enumerator name='YAML_EMIT_BLOCK_MAPPING_KEY_STATE' value='14'/>
      <enumerator name='YAML_EMIT_BLOCK_MAPPING_SIMPLE_VALUE_STATE' value='15'/>
      <enumerator name='YAML_EMIT_BLOCK_MAPPING_VALUE_STATE' value='16'/>
      <enumerator name='YAML_EMIT_END_STATE' value='17'/>
    </enum-decl>
    <typedef-decl name='yaml_emitter_state_t' type-id='type-id-266' filepath='/usr/include/yaml.h' line='1518' column='1' id='type-id-267'/>
    <class-decl name='yaml_anchors_s' size-in-bits='96' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='1523' column='1' id='type-id-268'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='references' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1525' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='anchor' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1527' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='serialized' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1529' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='yaml_anchors_t' type-id='type-id-268' filepath='/usr/include/yaml.h' line='1530' column='1' id='type-id-269'/>
    <class-decl name='yaml_emitter_s' size-in-bits='3456' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='1539' column='1' id='type-id-270'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='error' type-id='type-id-251' visibility='default' filepath='/usr/include/yaml.h' line='1547' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='problem' type-id='type-id-100' visibility='default' filepath='/usr/include/yaml.h' line='1549' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='write_handler' type-id='type-id-271' visibility='default' filepath='/usr/include/yaml.h' line='1561' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='write_handler_data' type-id='type-id-117' visibility='default' filepath='/usr/include/yaml.h' line='1564' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='output' type-id='type-id-272' visibility='default' filepath='/usr/include/yaml.h' line='1580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='buffer' type-id='type-id-273' visibility='default' filepath='/usr/include/yaml.h' line='1592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='raw_buffer' type-id='type-id-274' visibility='default' filepath='/usr/include/yaml.h' line='1604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='encoding' type-id='type-id-247' visibility='default' filepath='/usr/include/yaml.h' line='1607' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='canonical' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1619' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='best_indent' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1621' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='best_width' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1623' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='unicode' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1625' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='line_break' type-id='type-id-249' visibility='default' filepath='/usr/include/yaml.h' line='1627' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='states' type-id='type-id-275' visibility='default' filepath='/usr/include/yaml.h' line='1637' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='state' type-id='type-id-267' visibility='default' filepath='/usr/include/yaml.h' line='1640' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='events' type-id='type-id-276' visibility='default' filepath='/usr/include/yaml.h' line='1652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='indents' type-id='type-id-277' visibility='default' filepath='/usr/include/yaml.h' line='1662' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='tag_directives' type-id='type-id-278' visibility='default' filepath='/usr/include/yaml.h' line='1672' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='indent' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1675' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='flow_level' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1678' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='root_context' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1681' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='sequence_context' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1683' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='mapping_context' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1685' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='simple_key_context' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1687' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='line' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1690' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='column' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1692' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='whitespace' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1694' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='indention' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1696' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='open_ended' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1698' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='anchor_data' type-id='type-id-279' visibility='default' filepath='/usr/include/yaml.h' line='1708' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='tag_data' type-id='type-id-280' visibility='default' filepath='/usr/include/yaml.h' line='1720' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='scalar_data' type-id='type-id-281' visibility='default' filepath='/usr/include/yaml.h' line='1740' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='opened' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1752' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3232'>
        <var-decl name='closed' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1754' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='anchors' type-id='type-id-282' visibility='default' filepath='/usr/include/yaml.h' line='1757' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='last_anchor_id' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1760' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='document' type-id='type-id-283' visibility='default' filepath='/usr/include/yaml.h' line='1763' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='192' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1567' column='1' id='type-id-272'>
      <data-member access='public'>
        <var-decl name='string' type-id='type-id-284' visibility='default' filepath='/usr/include/yaml.h' line='1576' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='file' type-id='type-id-165' visibility='default' filepath='/usr/include/yaml.h' line='1579' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1569' column='1' id='type-id-284'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-285' visibility='default' filepath='/usr/include/yaml.h' line='1571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-129' visibility='default' filepath='/usr/include/yaml.h' line='1573' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size_written' type-id='type-id-286' visibility='default' filepath='/usr/include/yaml.h' line='1575' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1583' column='1' id='type-id-273'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='1585' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='1587' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pointer' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='1589' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='last' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='1591' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1595' column='1' id='type-id-274'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-285' visibility='default' filepath='/usr/include/yaml.h' line='1597' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-285' visibility='default' filepath='/usr/include/yaml.h' line='1599' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pointer' type-id='type-id-285' visibility='default' filepath='/usr/include/yaml.h' line='1601' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='last' type-id='type-id-285' visibility='default' filepath='/usr/include/yaml.h' line='1603' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1630' column='1' id='type-id-275'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-287' visibility='default' filepath='/usr/include/yaml.h' line='1632' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-287' visibility='default' filepath='/usr/include/yaml.h' line='1634' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-287' visibility='default' filepath='/usr/include/yaml.h' line='1636' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1643' column='1' id='type-id-276'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-288' visibility='default' filepath='/usr/include/yaml.h' line='1645' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-288' visibility='default' filepath='/usr/include/yaml.h' line='1647' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='head' type-id='type-id-288' visibility='default' filepath='/usr/include/yaml.h' line='1649' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tail' type-id='type-id-288' visibility='default' filepath='/usr/include/yaml.h' line='1651' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1655' column='1' id='type-id-277'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-289' visibility='default' filepath='/usr/include/yaml.h' line='1657' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-289' visibility='default' filepath='/usr/include/yaml.h' line='1659' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-289' visibility='default' filepath='/usr/include/yaml.h' line='1661' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1665' column='1' id='type-id-278'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-164' visibility='default' filepath='/usr/include/yaml.h' line='1667' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-164' visibility='default' filepath='/usr/include/yaml.h' line='1669' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-164' visibility='default' filepath='/usr/include/yaml.h' line='1671' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1701' column='1' id='type-id-279'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='anchor' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='1703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='anchor_length' type-id='type-id-129' visibility='default' filepath='/usr/include/yaml.h' line='1705' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='alias' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1707' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1711' column='1' id='type-id-280'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='1713' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='handle_length' type-id='type-id-129' visibility='default' filepath='/usr/include/yaml.h' line='1715' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='suffix' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='1717' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='suffix_length' type-id='type-id-129' visibility='default' filepath='/usr/include/yaml.h' line='1719' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1723' column='1' id='type-id-281'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='1725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='length' type-id='type-id-129' visibility='default' filepath='/usr/include/yaml.h' line='1727' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='multiline' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1729' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flow_plain_allowed' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1731' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='block_plain_allowed' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1733' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='single_quoted_allowed' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1735' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='block_allowed' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1737' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='style' type-id='type-id-139' visibility='default' filepath='/usr/include/yaml.h' line='1739' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='yaml_emitter_t' type-id='type-id-270' filepath='/usr/include/yaml.h' line='1769' column='1' id='type-id-290'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-291'/>
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-292'/>
    <qualified-type-def type-id='type-id-60' const='yes' id='type-id-293'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' id='type-id-294'/>
    <qualified-type-def type-id='type-id-100' restrict='yes' id='type-id-295'/>
    <pointer-type-def type-id='type-id-112' size-in-bits='64' id='type-id-296'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-289'/>
    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-286'/>
    <pointer-type-def type-id='type-id-297' size-in-bits='64' id='type-id-240'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-238'/>
    <pointer-type-def type-id='type-id-299' size-in-bits='64' id='type-id-244'/>
    <pointer-type-def type-id='type-id-20' size-in-bits='64' id='type-id-285'/>
    <pointer-type-def type-id='type-id-300' size-in-bits='64' id='type-id-235'/>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' id='type-id-242'/>
    <pointer-type-def type-id='type-id-269' size-in-bits='64' id='type-id-282'/>
    <pointer-type-def type-id='type-id-92' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-267' size-in-bits='64' id='type-id-287'/>
    <pointer-type-def type-id='type-id-290' size-in-bits='64' id='type-id-302'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-288'/>
    <pointer-type-def type-id='type-id-265' size-in-bits='64' id='type-id-271'/>
    <function-decl name='netplan_def_type_name' filepath='../src/names.h' line='27' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='netplan_auth_key_management_type_name' filepath='../src/names.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='netplan_auth_eap_method_name' filepath='../src/names.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-51'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='netplan_addr_gen_mode_name' filepath='../src/names.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-233'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='netplan_wifi_mode_name' filepath='../src/names.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-77'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='get_default_backend_for_type' filepath='../src/util-internal.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-13'/>
      <return type-id='type-id-31'/>
    </function-decl>
    <function-decl name='has_openvswitch' filepath='../src/util-internal.h' line='90' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-294'/>
      <parameter type-id='type-id-31'/>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-289'/>
    </function-decl>
    <function-decl name='g_array_new' filepath='/usr/include/glib-2.0/glib/garray.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='g_array_free' filepath='/usr/include/glib-2.0/glib/garray.h' line='84' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='g_array_append_vals' filepath='/usr/include/glib-2.0/glib/garray.h' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-56'/>
      <parameter type-id='type-id-118'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <function-decl name='g_datalist_foreach' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-291'/>
      <parameter type-id='type-id-236'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_file_error_quark' filepath='/usr/include/glib-2.0/glib/gfileutils.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-107'/>
    </function-decl>
    <function-decl name='g_hash_table_new_full' filepath='/usr/include/glib-2.0/glib/ghash.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-241'/>
      <parameter type-id='type-id-243'/>
      <parameter type-id='type-id-243'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_hash_table_insert' filepath='/usr/include/glib-2.0/glib/ghash.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_hash_table_contains' filepath='/usr/include/glib-2.0/glib/ghash.h' line='98' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_hash_table_size' filepath='/usr/include/glib-2.0/glib/ghash.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='g_hash_table_iter_init' filepath='/usr/include/glib-2.0/glib/ghash.h' line='132' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-292'/>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_hash_table_iter_next' filepath='/usr/include/glib-2.0/glib/ghash.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-292'/>
      <parameter type-id='type-id-296'/>
      <parameter type-id='type-id-296'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_hash_table_iter_remove' filepath='/usr/include/glib-2.0/glib/ghash.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-292'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_str_equal' filepath='/usr/include/glib-2.0/glib/ghash.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-118'/>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_str_hash' filepath='/usr/include/glib-2.0/glib/ghash.h' line='162' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='g_list_find_custom' filepath='/usr/include/glib-2.0/glib/glist.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-118'/>
      <parameter type-id='type-id-239'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='g_quark_to_string' filepath='/usr/include/glib-2.0/glib/gquark.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-107'/>
      <return type-id='type-id-177'/>
    </function-decl>
    <function-decl name='g_strdup_printf' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='g_strconcat' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='231' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='g_strsplit' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='275' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-108'/>
      <return type-id='type-id-228'/>
    </function-decl>
    <function-decl name='g_strfreev' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-228'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-165'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='fdopen' filepath='/usr/include/stdio.h' line='293' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-165'/>
    </function-decl>
    <function-decl name='strchr' filepath='/usr/include/string.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-129'/>
    </function-decl>
    <function-decl name='strerror' filepath='/usr/include/string.h' line='419' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='dup' filepath='/usr/include/unistd.h' line='552' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='yaml_stream_start_event_initialize' filepath='/usr/include/yaml.h' line='490' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-288'/>
      <parameter type-id='type-id-247'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='yaml_stream_end_event_initialize' filepath='/usr/include/yaml.h' line='502' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-288'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='yaml_document_start_event_initialize' filepath='/usr/include/yaml.h' line='524' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-288'/>
      <parameter type-id='type-id-161'/>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-164'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='yaml_document_end_event_initialize' filepath='/usr/include/yaml.h' line='543' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-288'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='yaml_scalar_event_initialize' filepath='/usr/include/yaml.h' line='580' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-288'/>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-139'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='yaml_sequence_start_event_initialize' filepath='/usr/include/yaml.h' line='603' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-288'/>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-141'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='yaml_sequence_end_event_initialize' filepath='/usr/include/yaml.h' line='616' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-288'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='yaml_mapping_start_event_initialize' filepath='/usr/include/yaml.h' line='635' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-288'/>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-143'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='yaml_mapping_end_event_initialize' filepath='/usr/include/yaml.h' line='648' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-288'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='yaml_emitter_initialize' filepath='/usr/include/yaml.h' line='1783' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-302'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='yaml_emitter_delete' filepath='/usr/include/yaml.h' line='1792' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-302'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='yaml_emitter_set_output_file' filepath='/usr/include/yaml.h' line='1824' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-302'/>
      <parameter type-id='type-id-165'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='yaml_emitter_emit' filepath='/usr/include/yaml.h' line='1915' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-302'/>
      <parameter type-id='type-id-288'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-264'>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-285'/>
      <parameter type-id='type-id-129'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-297'>
      <parameter type-id='type-id-118'/>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-39'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-298'>
      <parameter type-id='type-id-118'/>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-108'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-299'>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-41'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-300'>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-26'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-301'>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-26'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../src/networkd.c' comp-dir-path='/home/lukas/canonical/netplan/build' language='LANG_C99'>
    <typedef-decl name='GHFunc' type-id='type-id-303' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='117' column='1' id='type-id-304'/>
    <typedef-decl name='__mode_t' type-id='type-id-23' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='150' column='1' id='type-id-305'/>
    <typedef-decl name='guint64' type-id='type-id-3' filepath='/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h' line='64' column='1' id='type-id-306'/>
    <typedef-decl name='gssize' type-id='type-id-17' filepath='/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h' line='79' column='1' id='type-id-307'/>
    <qualified-type-def type-id='type-id-24' const='yes' id='type-id-308'/>
    <pointer-type-def type-id='type-id-308' size-in-bits='64' id='type-id-309'/>
    <pointer-type-def type-id='type-id-309' size-in-bits='64' id='type-id-310'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-311'/>
    <pointer-type-def type-id='type-id-312' size-in-bits='64' id='type-id-303'/>
    <function-decl name='netplan_netdef_write_network_file' mangled-name='netplan_netdef_write_network_file' filepath='../src/networkd.c' line='594' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_netdef_write_network_file'>
      <parameter type-id='type-id-174' name='np_state' filepath='../src/networkd.c' line='595' column='1'/>
      <parameter type-id='type-id-172' name='def' filepath='../src/networkd.c' line='596' column='1'/>
      <parameter type-id='type-id-100' name='rootdir' filepath='../src/networkd.c' line='597' column='1'/>
      <parameter type-id='type-id-100' name='path' filepath='../src/networkd.c' line='598' column='1'/>
      <parameter type-id='type-id-311' name='has_been_written' filepath='../src/networkd.c' line='599' column='1'/>
      <parameter type-id='type-id-167' name='error' filepath='../src/networkd.c' line='600' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='netplan_netdef_write_networkd' mangled-name='netplan_netdef_write_networkd' filepath='../src/networkd.c' line='1105' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_netdef_write_networkd'>
      <parameter type-id='type-id-174' name='np_state' filepath='../src/networkd.c' line='1106' column='1'/>
      <parameter type-id='type-id-172' name='def' filepath='../src/networkd.c' line='1107' column='1'/>
      <parameter type-id='type-id-100' name='rootdir' filepath='../src/networkd.c' line='1108' column='1'/>
      <parameter type-id='type-id-311' name='has_been_written' filepath='../src/networkd.c' line='1109' column='1'/>
      <parameter type-id='type-id-167' name='error' filepath='../src/networkd.c' line='1110' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='netplan_networkd_cleanup' mangled-name='netplan_networkd_cleanup' filepath='../src/networkd.c' line='1169' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_networkd_cleanup'>
      <parameter type-id='type-id-100' name='rootdir' filepath='../src/networkd.c' line='1169' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='safe_mkdir_p_dir' mangled-name='safe_mkdir_p_dir' filepath='../src/util-internal.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='safe_mkdir_p_dir'>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_string_free_to_file' mangled-name='g_string_free_to_file' filepath='../src/util-internal.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='g_string_free_to_file'>
      <parameter type-id='type-id-225'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='unlink_glob' mangled-name='unlink_glob' filepath='../src/util-internal.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='unlink_glob'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='get_global_network' mangled-name='get_global_network' filepath='../src/util-internal.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_global_network'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='wifi_get_freq24' mangled-name='wifi_get_freq24' filepath='../src/util-internal.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wifi_get_freq24'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='wifi_get_freq5' mangled-name='wifi_get_freq5' filepath='../src/util-internal.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='wifi_get_freq5'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='systemd_escape' mangled-name='systemd_escape' filepath='../src/util-internal.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='systemd_escape'>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='is_wireguard_key' mangled-name='is_wireguard_key' filepath='../src/validation.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='is_wireguard_key'>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-310'/>
    </function-decl>
    <function-decl name='g_hash_table_foreach' filepath='/usr/include/glib-2.0/glib/ghash.h' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-304'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_ascii_strtoull' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-228'/>
      <parameter type-id='type-id-41'/>
      <return type-id='type-id-306'/>
    </function-decl>
    <function-decl name='g_strjoin' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='234' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='g_string_new' filepath='/usr/include/glib-2.0/glib/gstring.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-225'/>
    </function-decl>
    <function-decl name='g_string_append' filepath='/usr/include/glib-2.0/glib/gstring.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-225'/>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-225'/>
    </function-decl>
    <function-decl name='g_string_insert_c' filepath='/usr/include/glib-2.0/glib/gstring.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-225'/>
      <parameter type-id='type-id-307'/>
      <parameter type-id='type-id-116'/>
      <return type-id='type-id-225'/>
    </function-decl>
    <function-decl name='g_string_overwrite' filepath='/usr/include/glib-2.0/glib/gstring.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-225'/>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-225'/>
    </function-decl>
    <function-decl name='g_string_printf' filepath='/usr/include/glib-2.0/glib/gstring.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-225'/>
      <parameter type-id='type-id-177'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_assertion_message_expr' filepath='/usr/include/glib-2.0/glib/gtestutils.h' line='540' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='strncmp' filepath='/usr/include/string.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-129'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='symlink' filepath='/usr/include/unistd.h' line='832' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='umask' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='380' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-305'/>
      <return type-id='type-id-305'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-312'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-26'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../src/nm.c' comp-dir-path='/home/lukas/canonical/netplan/build' language='LANG_C99'>
    <class-decl name='_GKeyFile' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-313'/>
    <typedef-decl name='GKeyFile' type-id='type-id-313' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='48' column='1' id='type-id-314'/>
    <typedef-decl name='GFunc' type-id='type-id-315' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='114' column='1' id='type-id-316'/>
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-317'/>
    <qualified-type-def type-id='type-id-177' const='yes' id='type-id-318'/>
    <pointer-type-def type-id='type-id-318' size-in-bits='64' id='type-id-319'/>
    <qualified-type-def type-id='type-id-20' const='yes' id='type-id-320'/>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' id='type-id-321'/>
    <pointer-type-def type-id='type-id-322' size-in-bits='64' id='type-id-315'/>
    <class-decl name='_GKeyFile' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-313'/>
    <function-decl name='netplan_netdef_write_nm' mangled-name='netplan_netdef_write_nm' filepath='../src/nm.c' line='922' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_netdef_write_nm'>
      <parameter type-id='type-id-174' name='np_state' filepath='../src/nm.c' line='923' column='1'/>
      <parameter type-id='type-id-172' name='netdef' filepath='../src/nm.c' line='924' column='1'/>
      <parameter type-id='type-id-100' name='rootdir' filepath='../src/nm.c' line='925' column='1'/>
      <parameter type-id='type-id-311' name='has_been_written' filepath='../src/nm.c' line='926' column='1'/>
      <parameter type-id='type-id-167' name='error' filepath='../src/nm.c' line='927' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='netplan_state_finish_nm_write' mangled-name='netplan_state_finish_nm_write' filepath='../src/nm.c' line='982' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_finish_nm_write'>
      <parameter type-id='type-id-174' name='np_state' filepath='../src/nm.c' line='983' column='1'/>
      <parameter type-id='type-id-100' name='rootdir' filepath='../src/nm.c' line='984' column='1'/>
      <parameter type-id='type-id-167' name='error' filepath='../src/nm.c' line='985' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='netplan_nm_cleanup' mangled-name='netplan_nm_cleanup' filepath='../src/nm.c' line='1013' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_nm_cleanup'>
      <parameter type-id='type-id-100' name='rootdir' filepath='../src/nm.c' line='1013' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_key_file_new' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-317'/>
    </function-decl>
    <function-decl name='g_key_file_unref' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_key_file_save_to_file' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_key_file_has_key' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_key_file_set_value' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_key_file_get_string' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='g_key_file_set_string' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_key_file_set_boolean' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_key_file_set_integer' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-108'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_key_file_set_uint64' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='196' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-306'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_key_file_set_string_list' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='217' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-319'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_key_file_set_comment' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_key_file_remove_key' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='290' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_list_foreach' filepath='/usr/include/glib-2.0/glib/glist.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-316'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_ascii_strcasecmp' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='g_strjoinv' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='283' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-228'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='g_strv_length' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='290' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-228'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='g_uri_escape_string' filepath='/usr/include/glib-2.0/glib/guri.h' line='401' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-39'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='strpbrk' filepath='/usr/include/string.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='unlink' filepath='/usr/include/unistd.h' line='858' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='uuid_generate' filepath='/usr/include/uuid/uuid.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-285'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='uuid_is_null' filepath='/usr/include/uuid/uuid.h' line='100' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-321'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='uuid_unparse' filepath='/usr/include/uuid/uuid.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-321'/>
      <parameter type-id='type-id-40'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-322'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-26'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../src/openvswitch.c' comp-dir-path='/home/lukas/canonical/netplan/build' language='LANG_C99'>
    <function-decl name='netplan_netdef_write_ovs' mangled-name='netplan_netdef_write_ovs' filepath='../src/openvswitch.c' line='320' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_netdef_write_ovs'>
      <parameter type-id='type-id-174' name='np_state' filepath='../src/openvswitch.c' line='320' column='1'/>
      <parameter type-id='type-id-172' name='def' filepath='../src/openvswitch.c' line='320' column='1'/>
      <parameter type-id='type-id-100' name='rootdir' filepath='../src/openvswitch.c' line='320' column='1'/>
      <parameter type-id='type-id-311' name='has_been_written' filepath='../src/openvswitch.c' line='320' column='1'/>
      <parameter type-id='type-id-167' name='error' filepath='../src/openvswitch.c' line='320' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='netplan_state_finish_ovs_write' mangled-name='netplan_state_finish_ovs_write' filepath='../src/openvswitch.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_finish_ovs_write'>
      <parameter type-id='type-id-174' name='np_state' filepath='../src/openvswitch.c' line='461' column='1'/>
      <parameter type-id='type-id-100' name='rootdir' filepath='../src/openvswitch.c' line='461' column='1'/>
      <parameter type-id='type-id-167' name='error' filepath='../src/openvswitch.c' line='461' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='netplan_ovs_cleanup' mangled-name='netplan_ovs_cleanup' filepath='../src/openvswitch.c' line='507' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_ovs_cleanup'>
      <parameter type-id='type-id-100' name='rootdir' filepath='../src/openvswitch.c' line='507' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_str_has_prefix' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_string_erase' filepath='/usr/include/glib-2.0/glib/gstring.h' line='127' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-225'/>
      <parameter type-id='type-id-307'/>
      <parameter type-id='type-id-307'/>
      <return type-id='type-id-225'/>
    </function-decl>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-16'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../src/parse-nm.c' comp-dir-path='/home/lukas/canonical/netplan/build' language='LANG_C99'>
    <enum-decl name='GKeyFileFlags' naming-typedef-id='type-id-323' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='51' column='1' id='type-id-324'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='G_KEY_FILE_NONE' value='0'/>
      <enumerator name='G_KEY_FILE_KEEP_COMMENTS' value='1'/>
      <enumerator name='G_KEY_FILE_KEEP_TRANSLATIONS' value='2'/>
    </enum-decl>
    <typedef-decl name='GKeyFileFlags' type-id='type-id-324' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='55' column='1' id='type-id-323'/>
    <function-decl name='netplan_get_id_from_nm_filename' mangled-name='netplan_get_id_from_nm_filename' filepath='../include/util.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_get_id_from_nm_filename'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='get_unspecified_address' mangled-name='get_unspecified_address' filepath='../src/util-internal.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_unspecified_address'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='netplan_netdef_new' filepath='../src/util-internal.h' line='75' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='g_key_file_free' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_key_file_load_from_file' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-323'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_key_file_get_groups' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-229'/>
      <return type-id='type-id-228'/>
    </function-decl>
    <function-decl name='g_key_file_get_keys' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='111' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-229'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-228'/>
    </function-decl>
    <function-decl name='g_key_file_has_group' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_key_file_get_boolean' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='161' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_key_file_get_integer' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='g_key_file_get_uint64' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='191' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-306'/>
    </function-decl>
    <function-decl name='g_key_file_get_string_list' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-229'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-228'/>
    </function-decl>
    <function-decl name='g_key_file_remove_group' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='295' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-317'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='strtoul' filepath='/usr/include/stdlib.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-325'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-3'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../src/parse.c' comp-dir-path='/home/lukas/canonical/netplan/build' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-326' size-in-bits='768' id='type-id-327'>
      <subrange length='6' type-id='type-id-3' id='type-id-328'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-326' size-in-bits='infinite' id='type-id-329'>
      <subrange length='infinite' id='type-id-330'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-331' size-in-bits='1280' id='type-id-332'>
      <subrange length='10' type-id='type-id-3' id='type-id-333'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-331' size-in-bits='infinite' id='type-id-334'>
      <subrange length='infinite' id='type-id-330'/>
    </array-type-def>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-335'/>
    <class-decl name='NetplanWifiWowlanType' size-in-bits='128' is-struct='yes' visibility='default' filepath='../src/abi.h' line='64' column='1' id='type-id-331'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-40' visibility='default' filepath='../src/abi.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flag' type-id='type-id-45' visibility='default' filepath='../src/abi.h' line='66' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='NetplanOptionalAddressType' size-in-bits='128' is-struct='yes' visibility='default' filepath='../src/types.h' line='37' column='1' id='type-id-326'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-40' visibility='default' filepath='../src/types.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flag' type-id='type-id-36' visibility='default' filepath='../src/types.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GHRFunc' type-id='type-id-336' filepath='/usr/include/glib-2.0/glib/ghash.h' line='39' column='1' id='type-id-337'/>
    <typedef-decl name='__re_long_size_t' type-id='type-id-3' filepath='/usr/include/regex.h' line='56' column='1' id='type-id-338'/>
    <typedef-decl name='reg_syntax_t' type-id='type-id-3' filepath='/usr/include/regex.h' line='72' column='1' id='type-id-339'/>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/regex.h' line='413' column='1' id='type-id-340'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='__buffer' type-id='type-id-341' visibility='default' filepath='/usr/include/regex.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='__allocated' type-id='type-id-338' visibility='default' filepath='/usr/include/regex.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='__used' type-id='type-id-338' visibility='default' filepath='/usr/include/regex.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='__syntax' type-id='type-id-339' visibility='default' filepath='/usr/include/regex.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='__fastmap' type-id='type-id-40' visibility='default' filepath='/usr/include/regex.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='__translate' type-id='type-id-285' visibility='default' filepath='/usr/include/regex.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-129' visibility='default' filepath='/usr/include/regex.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='__can_be_null' type-id='type-id-23' visibility='default' filepath='/usr/include/regex.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='449'>
        <var-decl name='__regs_allocated' type-id='type-id-23' visibility='default' filepath='/usr/include/regex.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='451'>
        <var-decl name='__fastmap_accurate' type-id='type-id-23' visibility='default' filepath='/usr/include/regex.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='452'>
        <var-decl name='__no_sub' type-id='type-id-23' visibility='default' filepath='/usr/include/regex.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='453'>
        <var-decl name='__not_bol' type-id='type-id-23' visibility='default' filepath='/usr/include/regex.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='454'>
        <var-decl name='__not_eol' type-id='type-id-23' visibility='default' filepath='/usr/include/regex.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='455'>
        <var-decl name='__newline_anchor' type-id='type-id-23' visibility='default' filepath='/usr/include/regex.h' line='475' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='regex_t' type-id='type-id-340' filepath='/usr/include/regex.h' line='478' column='1' id='type-id-342'/>
    <typedef-decl name='regoff_t' type-id='type-id-16' filepath='/usr/include/regex.h' line='490' column='1' id='type-id-343'/>
    <class-decl name='regmatch_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-344' visibility='default' filepath='/usr/include/regex.h' line='517' column='1' id='type-id-345'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rm_so' type-id='type-id-343' visibility='default' filepath='/usr/include/regex.h' line='519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rm_eo' type-id='type-id-343' visibility='default' filepath='/usr/include/regex.h' line='520' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='regmatch_t' type-id='type-id-345' filepath='/usr/include/regex.h' line='521' column='1' id='type-id-344'/>
    <enum-decl name='yaml_token_type_e' filepath='/usr/include/yaml.h' line='215' column='1' id='type-id-346'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='YAML_NO_TOKEN' value='0'/>
      <enumerator name='YAML_STREAM_START_TOKEN' value='1'/>
      <enumerator name='YAML_STREAM_END_TOKEN' value='2'/>
      <enumerator name='YAML_VERSION_DIRECTIVE_TOKEN' value='3'/>
      <enumerator name='YAML_TAG_DIRECTIVE_TOKEN' value='4'/>
      <enumerator name='YAML_DOCUMENT_START_TOKEN' value='5'/>
      <enumerator name='YAML_DOCUMENT_END_TOKEN' value='6'/>
      <enumerator name='YAML_BLOCK_SEQUENCE_START_TOKEN' value='7'/>
      <enumerator name='YAML_BLOCK_MAPPING_START_TOKEN' value='8'/>
      <enumerator name='YAML_BLOCK_END_TOKEN' value='9'/>
      <enumerator name='YAML_FLOW_SEQUENCE_START_TOKEN' value='10'/>
      <enumerator name='YAML_FLOW_SEQUENCE_END_TOKEN' value='11'/>
      <enumerator name='YAML_FLOW_MAPPING_START_TOKEN' value='12'/>
      <enumerator name='YAML_FLOW_MAPPING_END_TOKEN' value='13'/>
      <enumerator name='YAML_BLOCK_ENTRY_TOKEN' value='14'/>
      <enumerator name='YAML_FLOW_ENTRY_TOKEN' value='15'/>
      <enumerator name='YAML_KEY_TOKEN' value='16'/>
      <enumerator name='YAML_VALUE_TOKEN' value='17'/>
      <enumerator name='YAML_ALIAS_TOKEN' value='18'/>
      <enumerator name='YAML_ANCHOR_TOKEN' value='19'/>
      <enumerator name='YAML_TAG_TOKEN' value='20'/>
      <enumerator name='YAML_SCALAR_TOKEN' value='21'/>
    </enum-decl>
    <typedef-decl name='yaml_token_type_t' type-id='type-id-346' filepath='/usr/include/yaml.h' line='266' column='1' id='type-id-347'/>
    <class-decl name='yaml_token_s' size-in-bits='640' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='269' column='1' id='type-id-348'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-347' visibility='default' filepath='/usr/include/yaml.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-349' visibility='default' filepath='/usr/include/yaml.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='start_mark' type-id='type-id-137' visibility='default' filepath='/usr/include/yaml.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='end_mark' type-id='type-id-137' visibility='default' filepath='/usr/include/yaml.h' line='334' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='192' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='275' column='1' id='type-id-349'>
      <data-member access='public'>
        <var-decl name='stream_start' type-id='type-id-256' visibility='default' filepath='/usr/include/yaml.h' line='281' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='alias' type-id='type-id-350' visibility='default' filepath='/usr/include/yaml.h' line='287' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='anchor' type-id='type-id-350' visibility='default' filepath='/usr/include/yaml.h' line='293' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='tag' type-id='type-id-351' visibility='default' filepath='/usr/include/yaml.h' line='301' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='scalar' type-id='type-id-152' visibility='default' filepath='/usr/include/yaml.h' line='311' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='version_directive' type-id='type-id-352' visibility='default' filepath='/usr/include/yaml.h' line='319' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='tag_directive' type-id='type-id-353' visibility='default' filepath='/usr/include/yaml.h' line='327' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='284' column='1' id='type-id-350'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='286' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='296' column='1' id='type-id-351'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='suffix' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='300' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='314' column='1' id='type-id-352'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='major' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='minor' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='318' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='322' column='1' id='type-id-353'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prefix' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='326' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='yaml_token_t' type-id='type-id-348' filepath='/usr/include/yaml.h' line='336' column='1' id='type-id-354'/>
    <typedef-decl name='yaml_read_handler_t' type-id='type-id-355' filepath='/usr/include/yaml.h' line='988' column='1' id='type-id-356'/>
    <class-decl name='yaml_simple_key_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='995' column='1' id='type-id-357'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='possible' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='997' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='required' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1000' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='token_number' type-id='type-id-129' visibility='default' filepath='/usr/include/yaml.h' line='1003' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mark' type-id='type-id-137' visibility='default' filepath='/usr/include/yaml.h' line='1006' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='yaml_simple_key_t' type-id='type-id-357' filepath='/usr/include/yaml.h' line='1007' column='1' id='type-id-358'/>
    <enum-decl name='yaml_parser_state_e' filepath='/usr/include/yaml.h' line='1012' column='1' id='type-id-359'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='YAML_PARSE_STREAM_START_STATE' value='0'/>
      <enumerator name='YAML_PARSE_IMPLICIT_DOCUMENT_START_STATE' value='1'/>
      <enumerator name='YAML_PARSE_DOCUMENT_START_STATE' value='2'/>
      <enumerator name='YAML_PARSE_DOCUMENT_CONTENT_STATE' value='3'/>
      <enumerator name='YAML_PARSE_DOCUMENT_END_STATE' value='4'/>
      <enumerator name='YAML_PARSE_BLOCK_NODE_STATE' value='5'/>
      <enumerator name='YAML_PARSE_BLOCK_NODE_OR_INDENTLESS_SEQUENCE_STATE' value='6'/>
      <enumerator name='YAML_PARSE_FLOW_NODE_STATE' value='7'/>
      <enumerator name='YAML_PARSE_BLOCK_SEQUENCE_FIRST_ENTRY_STATE' value='8'/>
      <enumerator name='YAML_PARSE_BLOCK_SEQUENCE_ENTRY_STATE' value='9'/>
      <enumerator name='YAML_PARSE_INDENTLESS_SEQUENCE_ENTRY_STATE' value='10'/>
      <enumerator name='YAML_PARSE_BLOCK_MAPPING_FIRST_KEY_STATE' value='11'/>
      <enumerator name='YAML_PARSE_BLOCK_MAPPING_KEY_STATE' value='12'/>
      <enumerator name='YAML_PARSE_BLOCK_MAPPING_VALUE_STATE' value='13'/>
      <enumerator name='YAML_PARSE_FLOW_SEQUENCE_FIRST_ENTRY_STATE' value='14'/>
      <enumerator name='YAML_PARSE_FLOW_SEQUENCE_ENTRY_STATE' value='15'/>
      <enumerator name='YAML_PARSE_FLOW_SEQUENCE_ENTRY_MAPPING_KEY_STATE' value='16'/>
      <enumerator name='YAML_PARSE_FLOW_SEQUENCE_ENTRY_MAPPING_VALUE_STATE' value='17'/>
      <enumerator name='YAML_PARSE_FLOW_SEQUENCE_ENTRY_MAPPING_END_STATE' value='18'/>
      <enumerator name='YAML_PARSE_FLOW_MAPPING_FIRST_KEY_STATE' value='19'/>
      <enumerator name='YAML_PARSE_FLOW_MAPPING_KEY_STATE' value='20'/>
      <enumerator name='YAML_PARSE_FLOW_MAPPING_VALUE_STATE' value='21'/>
      <enumerator name='YAML_PARSE_FLOW_MAPPING_EMPTY_VALUE_STATE' value='22'/>
      <enumerator name='YAML_PARSE_END_STATE' value='23'/>
    </enum-decl>
    <typedef-decl name='yaml_parser_state_t' type-id='type-id-359' filepath='/usr/include/yaml.h' line='1061' column='1' id='type-id-360'/>
    <class-decl name='yaml_alias_data_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='1067' column='1' id='type-id-361'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='anchor' type-id='type-id-134' visibility='default' filepath='/usr/include/yaml.h' line='1069' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='index' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1071' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mark' type-id='type-id-137' visibility='default' filepath='/usr/include/yaml.h' line='1073' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='yaml_alias_data_t' type-id='type-id-361' filepath='/usr/include/yaml.h' line='1074' column='1' id='type-id-362'/>
    <class-decl name='yaml_parser_s' size-in-bits='3840' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='1083' column='1' id='type-id-363'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='error' type-id='type-id-251' visibility='default' filepath='/usr/include/yaml.h' line='1091' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='problem' type-id='type-id-100' visibility='default' filepath='/usr/include/yaml.h' line='1093' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='problem_offset' type-id='type-id-129' visibility='default' filepath='/usr/include/yaml.h' line='1095' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='problem_value' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1097' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='problem_mark' type-id='type-id-137' visibility='default' filepath='/usr/include/yaml.h' line='1099' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='context' type-id='type-id-100' visibility='default' filepath='/usr/include/yaml.h' line='1101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='context_mark' type-id='type-id-137' visibility='default' filepath='/usr/include/yaml.h' line='1103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='read_handler' type-id='type-id-364' visibility='default' filepath='/usr/include/yaml.h' line='1115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='read_handler_data' type-id='type-id-117' visibility='default' filepath='/usr/include/yaml.h' line='1118' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='input' type-id='type-id-365' visibility='default' filepath='/usr/include/yaml.h' line='1134' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='eof' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='buffer' type-id='type-id-273' visibility='default' filepath='/usr/include/yaml.h' line='1149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='unread' type-id='type-id-129' visibility='default' filepath='/usr/include/yaml.h' line='1152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='raw_buffer' type-id='type-id-274' visibility='default' filepath='/usr/include/yaml.h' line='1164' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='encoding' type-id='type-id-247' visibility='default' filepath='/usr/include/yaml.h' line='1167' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='offset' type-id='type-id-129' visibility='default' filepath='/usr/include/yaml.h' line='1170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='mark' type-id='type-id-137' visibility='default' filepath='/usr/include/yaml.h' line='1173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='stream_start_produced' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='stream_end_produced' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='flow_level' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='tokens' type-id='type-id-366' visibility='default' filepath='/usr/include/yaml.h' line='1203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tokens_parsed' type-id='type-id-129' visibility='default' filepath='/usr/include/yaml.h' line='1206' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='token_available' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1209' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='indents' type-id='type-id-277' visibility='default' filepath='/usr/include/yaml.h' line='1219' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='indent' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1222' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='simple_key_allowed' type-id='type-id-16' visibility='default' filepath='/usr/include/yaml.h' line='1225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='simple_keys' type-id='type-id-367' visibility='default' filepath='/usr/include/yaml.h' line='1235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='states' type-id='type-id-368' visibility='default' filepath='/usr/include/yaml.h' line='1254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='state' type-id='type-id-360' visibility='default' filepath='/usr/include/yaml.h' line='1257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='marks' type-id='type-id-369' visibility='default' filepath='/usr/include/yaml.h' line='1267' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='tag_directives' type-id='type-id-278' visibility='default' filepath='/usr/include/yaml.h' line='1277' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='aliases' type-id='type-id-370' visibility='default' filepath='/usr/include/yaml.h' line='1296' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='document' type-id='type-id-283' visibility='default' filepath='/usr/include/yaml.h' line='1299' column='1'/>
      </data-member>
    </class-decl>
    <union-decl name='__anonymous_union__' size-in-bits='192' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1121' column='1' id='type-id-365'>
      <data-member access='public'>
        <var-decl name='string' type-id='type-id-371' visibility='default' filepath='/usr/include/yaml.h' line='1130' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='file' type-id='type-id-165' visibility='default' filepath='/usr/include/yaml.h' line='1133' column='1'/>
      </data-member>
    </union-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1123' column='1' id='type-id-371'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-321' visibility='default' filepath='/usr/include/yaml.h' line='1125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-321' visibility='default' filepath='/usr/include/yaml.h' line='1127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='current' type-id='type-id-321' visibility='default' filepath='/usr/include/yaml.h' line='1129' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1194' column='1' id='type-id-366'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-372' visibility='default' filepath='/usr/include/yaml.h' line='1196' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-372' visibility='default' filepath='/usr/include/yaml.h' line='1198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='head' type-id='type-id-372' visibility='default' filepath='/usr/include/yaml.h' line='1200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tail' type-id='type-id-372' visibility='default' filepath='/usr/include/yaml.h' line='1202' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1228' column='1' id='type-id-367'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-373' visibility='default' filepath='/usr/include/yaml.h' line='1230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-373' visibility='default' filepath='/usr/include/yaml.h' line='1232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-373' visibility='default' filepath='/usr/include/yaml.h' line='1234' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1247' column='1' id='type-id-368'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-374' visibility='default' filepath='/usr/include/yaml.h' line='1249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-374' visibility='default' filepath='/usr/include/yaml.h' line='1251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-374' visibility='default' filepath='/usr/include/yaml.h' line='1253' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1260' column='1' id='type-id-369'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-375' visibility='default' filepath='/usr/include/yaml.h' line='1262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-375' visibility='default' filepath='/usr/include/yaml.h' line='1264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-375' visibility='default' filepath='/usr/include/yaml.h' line='1266' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1289' column='1' id='type-id-370'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-376' visibility='default' filepath='/usr/include/yaml.h' line='1291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-376' visibility='default' filepath='/usr/include/yaml.h' line='1293' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-376' visibility='default' filepath='/usr/include/yaml.h' line='1295' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='yaml_parser_t' type-id='type-id-363' filepath='/usr/include/yaml.h' line='1305' column='1' id='type-id-377'/>
    <pointer-type-def type-id='type-id-97' size-in-bits='64' id='type-id-378'/>
    <pointer-type-def type-id='type-id-98' size-in-bits='64' id='type-id-379'/>
    <pointer-type-def type-id='type-id-99' size-in-bits='64' id='type-id-380'/>
    <pointer-type-def type-id='type-id-60' size-in-bits='64' id='type-id-381'/>
    <pointer-type-def type-id='type-id-95' size-in-bits='64' id='type-id-382'/>
    <pointer-type-def type-id='type-id-96' size-in-bits='64' id='type-id-383'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-384'/>
    <qualified-type-def type-id='type-id-384' restrict='yes' id='type-id-325'/>
    <qualified-type-def type-id='type-id-35' const='yes' id='type-id-385'/>
    <pointer-type-def type-id='type-id-385' size-in-bits='64' id='type-id-386'/>
    <qualified-type-def type-id='type-id-342' const='yes' id='type-id-387'/>
    <pointer-type-def type-id='type-id-387' size-in-bits='64' id='type-id-388'/>
    <qualified-type-def type-id='type-id-388' restrict='yes' id='type-id-389'/>
    <qualified-type-def type-id='type-id-147' const='yes' id='type-id-390'/>
    <pointer-type-def type-id='type-id-390' size-in-bits='64' id='type-id-391'/>
    <qualified-type-def type-id='type-id-377' const='yes' id='type-id-392'/>
    <pointer-type-def type-id='type-id-392' size-in-bits='64' id='type-id-393'/>
    <pointer-type-def type-id='type-id-335' size-in-bits='64' id='type-id-341'/>
    <pointer-type-def type-id='type-id-342' size-in-bits='64' id='type-id-394'/>
    <qualified-type-def type-id='type-id-394' restrict='yes' id='type-id-395'/>
    <pointer-type-def type-id='type-id-344' size-in-bits='64' id='type-id-396'/>
    <qualified-type-def type-id='type-id-396' restrict='yes' id='type-id-397'/>
    <pointer-type-def type-id='type-id-398' size-in-bits='64' id='type-id-336'/>
    <pointer-type-def type-id='type-id-362' size-in-bits='64' id='type-id-376'/>
    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-375'/>
    <pointer-type-def type-id='type-id-360' size-in-bits='64' id='type-id-374'/>
    <pointer-type-def type-id='type-id-377' size-in-bits='64' id='type-id-399'/>
    <pointer-type-def type-id='type-id-356' size-in-bits='64' id='type-id-364'/>
    <pointer-type-def type-id='type-id-358' size-in-bits='64' id='type-id-373'/>
    <pointer-type-def type-id='type-id-354' size-in-bits='64' id='type-id-372'/>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-335'/>
    <function-decl name='parser_error' filepath='../src/error.h' line='29' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-393'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='yaml_error' filepath='../src/error.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-386'/>
      <parameter type-id='type-id-391'/>
      <parameter type-id='type-id-167'/>
      <parameter type-id='type-id-100'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <var-decl name='NETPLAN_OPTIONAL_ADDRESS_TYPES' type-id='type-id-329' mangled-name='NETPLAN_OPTIONAL_ADDRESS_TYPES' visibility='default' filepath='../src/types.h' line='43' column='1' elf-symbol-id='NETPLAN_OPTIONAL_ADDRESS_TYPES'/>
    <var-decl name='NETPLAN_WIFI_WOWLAN_TYPES' type-id='type-id-334' mangled-name='NETPLAN_WIFI_WOWLAN_TYPES' visibility='default' filepath='../src/types.h' line='45' column='1' elf-symbol-id='NETPLAN_WIFI_WOWLAN_TYPES'/>
    <function-decl name='reset_netdef' filepath='../src/types.h' line='207' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-13'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='reset_ovs_settings' filepath='../src/types.h' line='210' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-381'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='access_point_clear' filepath='../src/types.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-382'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='wireguard_peer_clear' filepath='../src/types.h' line='216' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-383'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='address_options_clear' filepath='../src/types.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-378'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='ip_rule_clear' filepath='../src/types.h' line='222' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-380'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='route_clear' filepath='../src/types.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-379'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='mark_data_as_dirty' filepath='../src/util-internal.h' line='66' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-168'/>
      <parameter type-id='type-id-117'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='is_ip4_address' filepath='../src/validation.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='is_ip6_address' filepath='../src/validation.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='is_hostname' filepath='../src/validation.h' line='27' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='validate_ovs_target' filepath='../src/validation.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-39'/>
      <parameter type-id='type-id-103'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='validate_netdef_grammar' filepath='../src/validation.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-386'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-163'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='validate_backend_rules' filepath='../src/validation.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-386'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='validate_sriov_rules' filepath='../src/validation.h' line='40' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-386'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='validate_default_route_consistency' filepath='../src/validation.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-386'/>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_datalist_init' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-291'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_datalist_id_set_data_full' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='52' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-291'/>
      <parameter type-id='type-id-107'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-243'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_clear_error' filepath='/usr/include/glib-2.0/glib/gerror.h' line='239' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_hash_table_new' filepath='/usr/include/glib-2.0/glib/ghash.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-241'/>
      <return type-id='type-id-59'/>
    </function-decl>
    <function-decl name='g_hash_table_destroy' filepath='/usr/include/glib-2.0/glib/ghash.h' line='67' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_hash_table_remove' filepath='/usr/include/glib-2.0/glib/ghash.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_hash_table_foreach_steal' filepath='/usr/include/glib-2.0/glib/ghash.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-59'/>
      <parameter type-id='type-id-337'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='g_list_free_full' filepath='/usr/include/glib-2.0/glib/glist.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-243'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_list_append' filepath='/usr/include/glib-2.0/glib/glist.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='g_list_prepend' filepath='/usr/include/glib-2.0/glib/glist.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='g_list_concat' filepath='/usr/include/glib-2.0/glib/glist.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='g_list_length' filepath='/usr/include/glib-2.0/glib/glist.h' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='g_malloc0_n' filepath='/usr/include/glib-2.0/glib/gmem.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-213'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='g_quark_from_string' filepath='/usr/include/glib-2.0/glib/gquark.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-107'/>
    </function-decl>
    <function-decl name='g_strerror' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='112' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-108'/>
      <return type-id='type-id-177'/>
    </function-decl>
    <function-decl name='g_strrstr' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='130' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='g_assertion_message_cmpstr' filepath='/usr/include/glib-2.0/glib/gtestutils.h' line='546' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='regcomp' filepath='/usr/include/regex.h' line='675' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-395'/>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='regexec' filepath='/usr/include/regex.h' line='679' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-389'/>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-397'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='strtol' filepath='/usr/include/stdlib.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-325'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-17'/>
    </function-decl>
    <function-decl name='memset' filepath='/usr/include/string.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-129'/>
      <return type-id='type-id-117'/>
    </function-decl>
    <function-decl name='strrchr' filepath='/usr/include/string.h' line='273' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='yaml_document_delete' filepath='/usr/include/yaml.h' line='847' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-283'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='yaml_document_get_node' filepath='/usr/include/yaml.h' line='862' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-283'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-163'/>
    </function-decl>
    <function-decl name='yaml_document_get_root_node' filepath='/usr/include/yaml.h' line='881' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-283'/>
      <return type-id='type-id-163'/>
    </function-decl>
    <function-decl name='yaml_parser_initialize' filepath='/usr/include/yaml.h' line='1319' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-399'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='yaml_parser_delete' filepath='/usr/include/yaml.h' line='1328' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-399'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='yaml_parser_set_input_file' filepath='/usr/include/yaml.h' line='1357' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-399'/>
      <parameter type-id='type-id-165'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='yaml_parser_load' filepath='/usr/include/yaml.h' line='1453' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-399'/>
      <parameter type-id='type-id-283'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-355'>
      <parameter type-id='type-id-117'/>
      <parameter type-id='type-id-285'/>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-286'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-398'>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-39'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../src/sriov.c' comp-dir-path='/home/lukas/canonical/netplan/build' language='LANG_C99'>
    <function-decl name='netplan_state_finish_sriov_write' mangled-name='netplan_state_finish_sriov_write' filepath='../src/sriov.c' line='68' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_finish_sriov_write'>
      <parameter type-id='type-id-174' name='np_state' filepath='../src/sriov.c' line='68' column='1'/>
      <parameter type-id='type-id-100' name='rootdir' filepath='../src/sriov.c' line='68' column='1'/>
      <parameter type-id='type-id-167' name='error' filepath='../src/sriov.c' line='68' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='netplan_sriov_cleanup' mangled-name='netplan_sriov_cleanup' filepath='../src/sriov.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_sriov_cleanup'>
      <parameter type-id='type-id-100' name='rootdir' filepath='../src/sriov.c' line='118' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_string_truncate' filepath='/usr/include/glib-2.0/glib/gstring.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-225'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-225'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../src/types.c' comp-dir-path='/home/lukas/canonical/netplan/build' language='LANG_C99'>
    <function-decl name='netplan_netdef_get_id' mangled-name='netplan_netdef_get_id' filepath='../src/types.c' line='444' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_netdef_get_id'>
      <parameter type-id='type-id-172' name='netdef' filepath='../src/types.c' line='444' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='netplan_netdef_get_embedded_switch_mode' mangled-name='netplan_netdef_get_embedded_switch_mode' filepath='../src/types.c' line='461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_netdef_get_embedded_switch_mode'>
      <parameter type-id='type-id-172' name='netdef' filepath='../src/types.c' line='461' column='1'/>
      <return type-id='type-id-100'/>
    </function-decl>
    <function-decl name='netplan_netdef_get_delay_virtual_functions_rebind' mangled-name='netplan_netdef_get_delay_virtual_functions_rebind' filepath='../src/types.c' line='468' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_netdef_get_delay_virtual_functions_rebind'>
      <parameter type-id='type-id-172' name='netdef' filepath='../src/types.c' line='468' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_datalist_clear' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-291'/>
      <return type-id='type-id-26'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../src/util.c' comp-dir-path='/home/lukas/canonical/netplan/build' language='LANG_C99'>
    <typedef-decl name='GSpawnChildSetupFunc' type-id='type-id-242' filepath='/usr/include/glib-2.0/glib/gspawn.h' line='138' column='1' id='type-id-400'/>
    <enum-decl name='GSpawnFlags' naming-typedef-id='type-id-401' filepath='/usr/include/glib-2.0/glib/gspawn.h' line='169' column='1' id='type-id-402'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='G_SPAWN_DEFAULT' value='0'/>
      <enumerator name='G_SPAWN_LEAVE_DESCRIPTORS_OPEN' value='1'/>
      <enumerator name='G_SPAWN_DO_NOT_REAP_CHILD' value='2'/>
      <enumerator name='G_SPAWN_SEARCH_PATH' value='4'/>
      <enumerator name='G_SPAWN_STDOUT_TO_DEV_NULL' value='8'/>
      <enumerator name='G_SPAWN_STDERR_TO_DEV_NULL' value='16'/>
      <enumerator name='G_SPAWN_CHILD_INHERITS_STDIN' value='32'/>
      <enumerator name='G_SPAWN_FILE_AND_ARGV_ZERO' value='64'/>
      <enumerator name='G_SPAWN_SEARCH_PATH_FROM_ENVP' value='128'/>
      <enumerator name='G_SPAWN_CLOEXEC_PIPES' value='256'/>
    </enum-decl>
    <typedef-decl name='GSpawnFlags' type-id='type-id-402' filepath='/usr/include/glib-2.0/glib/gspawn.h' line='182' column='1' id='type-id-401'/>
    <class-decl name='glob_t' size-in-bits='576' is-struct='yes' naming-typedef-id='type-id-403' visibility='default' filepath='/usr/include/glob.h' line='82' column='1' id='type-id-404'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gl_pathc' type-id='type-id-129' visibility='default' filepath='/usr/include/glob.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='gl_pathv' type-id='type-id-384' visibility='default' filepath='/usr/include/glob.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='gl_offs' type-id='type-id-129' visibility='default' filepath='/usr/include/glob.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='gl_flags' type-id='type-id-16' visibility='default' filepath='/usr/include/glob.h' line='87' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='gl_closedir' type-id='type-id-405' visibility='default' filepath='/usr/include/glob.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='gl_readdir' type-id='type-id-406' visibility='default' filepath='/usr/include/glob.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='gl_opendir' type-id='type-id-407' visibility='default' filepath='/usr/include/glob.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='gl_lstat' type-id='type-id-408' visibility='default' filepath='/usr/include/glob.h' line='102' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='gl_stat' type-id='type-id-408' visibility='default' filepath='/usr/include/glob.h' line='103' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='glob_t' type-id='type-id-404' filepath='/usr/include/glob.h' line='105' column='1' id='type-id-403'/>
    <pointer-type-def type-id='type-id-108' size-in-bits='64' id='type-id-409'/>
    <pointer-type-def type-id='type-id-403' size-in-bits='64' id='type-id-410'/>
    <qualified-type-def type-id='type-id-410' restrict='yes' id='type-id-411'/>
    <pointer-type-def type-id='type-id-412' size-in-bits='64' id='type-id-408'/>
    <pointer-type-def type-id='type-id-413' size-in-bits='64' id='type-id-414'/>
    <pointer-type-def type-id='type-id-415' size-in-bits='64' id='type-id-405'/>
    <pointer-type-def type-id='type-id-416' size-in-bits='64' id='type-id-407'/>
    <pointer-type-def type-id='type-id-417' size-in-bits='64' id='type-id-406'/>
    <qualified-type-def type-id='type-id-117' restrict='yes' id='type-id-418'/>
    <function-decl name='netplan_def_type_from_name' filepath='../src/names.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-13'/>
    </function-decl>
    <var-decl name='wifi_frequency_24' type-id='type-id-59' mangled-name='wifi_frequency_24' visibility='default' filepath='../src/util-internal.h' line='31' column='1' elf-symbol-id='wifi_frequency_24'/>
    <var-decl name='wifi_frequency_5' type-id='type-id-59' mangled-name='wifi_frequency_5' visibility='default' filepath='../src/util-internal.h' line='34' column='1' elf-symbol-id='wifi_frequency_5'/>
    <function-decl name='find_yaml_glob' mangled-name='find_yaml_glob' filepath='../src/util.c' line='110' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='find_yaml_glob'>
      <parameter type-id='type-id-100' name='rootdir' filepath='../src/util.c' line='110' column='1'/>
      <parameter type-id='type-id-410' name='out_glob' filepath='../src/util.c' line='110' column='1'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='netplan_util_dump_yaml_subtree' mangled-name='netplan_util_dump_yaml_subtree' filepath='../src/util.c' line='201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_util_dump_yaml_subtree'>
      <parameter type-id='type-id-100' name='prefix' filepath='../src/util.c' line='201' column='1'/>
      <parameter type-id='type-id-16' name='input_fd' filepath='../src/util.c' line='201' column='1'/>
      <parameter type-id='type-id-16' name='output_fd' filepath='../src/util.c' line='201' column='1'/>
      <parameter type-id='type-id-167' name='error' filepath='../src/util.c' line='201' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='netplan_delete_connection' mangled-name='netplan_delete_connection' filepath='../src/util.c' line='375' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_delete_connection'>
      <parameter type-id='type-id-100' name='id' filepath='../src/util.c' line='375' column='1'/>
      <parameter type-id='type-id-100' name='rootdir' filepath='../src/util.c' line='375' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='netplan_generate' mangled-name='netplan_generate' filepath='../src/util.c' line='433' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_generate'>
      <parameter type-id='type-id-100' name='rootdir' filepath='../src/util.c' line='433' column='1'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='_netplan_netdef_pertype_iter_next' mangled-name='_netplan_netdef_pertype_iter_next' filepath='../src/util.c' line='548' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_netplan_netdef_pertype_iter_next'>
      <parameter type-id='type-id-178' name='it' filepath='../src/util.c' line='548' column='1'/>
      <return type-id='type-id-68'/>
    </function-decl>
    <function-decl name='_netplan_netdef_pertype_iter_free' mangled-name='_netplan_netdef_pertype_iter_free' filepath='../src/util.c' line='564' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_netplan_netdef_pertype_iter_free'>
      <parameter type-id='type-id-178' name='it' filepath='../src/util.c' line='564' column='1'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_error_free' filepath='/usr/include/glib-2.0/glib/gerror.h' line='206' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-166'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_file_set_contents' filepath='/usr/include/glib-2.0/glib/gfileutils.h' line='123' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-307'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_mkdir_with_parents' filepath='/usr/include/glib-2.0/glib/gfileutils.h' line='182' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-108'/>
      <return type-id='type-id-108'/>
    </function-decl>
    <function-decl name='g_path_get_basename' filepath='/usr/include/glib-2.0/glib/gfileutils.h' line='211' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='g_path_get_dirname' filepath='/usr/include/glib-2.0/glib/gfileutils.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='g_hash_table_get_keys' filepath='/usr/include/glib-2.0/glib/ghash.h' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='g_hash_table_unref' filepath='/usr/include/glib-2.0/glib/ghash.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-59'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_direct_hash' filepath='/usr/include/glib-2.0/glib/ghash.h' line='183' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-41'/>
    </function-decl>
    <function-decl name='g_direct_equal' filepath='/usr/include/glib-2.0/glib/ghash.h' line='185' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-118'/>
      <parameter type-id='type-id-118'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_list_free' filepath='/usr/include/glib-2.0/glib/glist.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_list_sort' filepath='/usr/include/glib-2.0/glib/glist.h' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-91'/>
      <parameter type-id='type-id-239'/>
      <return type-id='type-id-91'/>
    </function-decl>
    <function-decl name='g_malloc0' filepath='/usr/include/glib-2.0/glib/gmem.h' line='81' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='g_spawn_sync' filepath='/usr/include/glib-2.0/glib/gspawn.h' line='254' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-228'/>
      <parameter type-id='type-id-228'/>
      <parameter type-id='type-id-401'/>
      <parameter type-id='type-id-400'/>
      <parameter type-id='type-id-112'/>
      <parameter type-id='type-id-228'/>
      <parameter type-id='type-id-228'/>
      <parameter type-id='type-id-409'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_spawn_check_wait_status' filepath='/usr/include/glib-2.0/glib/gspawn.h' line='276' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-108'/>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_strchug' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='176' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-103'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='g_strchomp' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='179' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-103'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='g_strndup' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='225' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='fseek' filepath='/usr/include/stdio.h' line='713' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-165'/>
      <parameter type-id='type-id-17'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='getenv' filepath='/usr/include/stdlib.h' line='641' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-40'/>
    </function-decl>
    <function-decl name='yaml_parser_parse' filepath='/usr/include/yaml.h' line='1428' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-399'/>
      <parameter type-id='type-id-288'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-412'>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-418'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-413'>
      <parameter type-id='type-id-100'/>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-415'>
      <parameter type-id='type-id-117'/>
      <return type-id='type-id-26'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-416'>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-117'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-417'>
      <parameter type-id='type-id-117'/>
      <return type-id='type-id-117'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../src/validation.c' comp-dir-path='/home/lukas/canonical/netplan/build' language='LANG_C99'>
    <enum-decl name='GFileTest' naming-typedef-id='type-id-419' filepath='/usr/include/glib-2.0/glib/gfileutils.h' line='67' column='1' id='type-id-420'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='G_FILE_TEST_IS_REGULAR' value='1'/>
      <enumerator name='G_FILE_TEST_IS_SYMLINK' value='2'/>
      <enumerator name='G_FILE_TEST_IS_DIR' value='4'/>
      <enumerator name='G_FILE_TEST_IS_EXECUTABLE' value='8'/>
      <enumerator name='G_FILE_TEST_EXISTS' value='16'/>
    </enum-decl>
    <typedef-decl name='GFileTest' type-id='type-id-420' filepath='/usr/include/glib-2.0/glib/gfileutils.h' line='73' column='1' id='type-id-419'/>
    <enum-decl name='GRegexCompileFlags' naming-typedef-id='type-id-421' filepath='/usr/include/glib-2.0/glib/gregex.h' line='297' column='1' id='type-id-422'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='G_REGEX_CASELESS' value='1'/>
      <enumerator name='G_REGEX_MULTILINE' value='2'/>
      <enumerator name='G_REGEX_DOTALL' value='4'/>
      <enumerator name='G_REGEX_EXTENDED' value='8'/>
      <enumerator name='G_REGEX_ANCHORED' value='16'/>
      <enumerator name='G_REGEX_DOLLAR_ENDONLY' value='32'/>
      <enumerator name='G_REGEX_UNGREEDY' value='512'/>
      <enumerator name='G_REGEX_RAW' value='2048'/>
      <enumerator name='G_REGEX_NO_AUTO_CAPTURE' value='4096'/>
      <enumerator name='G_REGEX_OPTIMIZE' value='8192'/>
      <enumerator name='G_REGEX_FIRSTLINE' value='262144'/>
      <enumerator name='G_REGEX_DUPNAMES' value='524288'/>
      <enumerator name='G_REGEX_NEWLINE_CR' value='1048576'/>
      <enumerator name='G_REGEX_NEWLINE_LF' value='2097152'/>
      <enumerator name='G_REGEX_NEWLINE_CRLF' value='3145728'/>
      <enumerator name='G_REGEX_NEWLINE_ANYCRLF' value='5242880'/>
      <enumerator name='G_REGEX_BSR_ANYCRLF' value='8388608'/>
      <enumerator name='G_REGEX_JAVASCRIPT_COMPAT' value='33554432'/>
    </enum-decl>
    <typedef-decl name='GRegexCompileFlags' type-id='type-id-422' filepath='/usr/include/glib-2.0/glib/gregex.h' line='316' column='1' id='type-id-421'/>
    <enum-decl name='GRegexMatchFlags' naming-typedef-id='type-id-423' filepath='/usr/include/glib-2.0/glib/gregex.h' line='387' column='1' id='type-id-424'>
      <underlying-type type-id='type-id-19'/>
      <enumerator name='G_REGEX_MATCH_ANCHORED' value='16'/>
      <enumerator name='G_REGEX_MATCH_NOTBOL' value='128'/>
      <enumerator name='G_REGEX_MATCH_NOTEOL' value='256'/>
      <enumerator name='G_REGEX_MATCH_NOTEMPTY' value='1024'/>
      <enumerator name='G_REGEX_MATCH_PARTIAL' value='32768'/>
      <enumerator name='G_REGEX_MATCH_NEWLINE_CR' value='1048576'/>
      <enumerator name='G_REGEX_MATCH_NEWLINE_LF' value='2097152'/>
      <enumerator name='G_REGEX_MATCH_NEWLINE_CRLF' value='3145728'/>
      <enumerator name='G_REGEX_MATCH_NEWLINE_ANY' value='4194304'/>
      <enumerator name='G_REGEX_MATCH_NEWLINE_ANYCRLF' value='5242880'/>
      <enumerator name='G_REGEX_MATCH_BSR_ANYCRLF' value='8388608'/>
      <enumerator name='G_REGEX_MATCH_BSR_ANY' value='16777216'/>
      <enumerator name='G_REGEX_MATCH_PARTIAL_SOFT' value='32768'/>
      <enumerator name='G_REGEX_MATCH_PARTIAL_HARD' value='134217728'/>
      <enumerator name='G_REGEX_MATCH_NOTEMPTY_ATSTART' value='268435456'/>
    </enum-decl>
    <typedef-decl name='GRegexMatchFlags' type-id='type-id-424' filepath='/usr/include/glib-2.0/glib/gregex.h' line='403' column='1' id='type-id-423'/>
    <typedef-decl name='GSList' type-id='type-id-425' filepath='/usr/include/glib-2.0/glib/gslist.h' line='37' column='1' id='type-id-426'/>
    <class-decl name='_GSList' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/glib/gslist.h' line='39' column='1' id='type-id-425'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-112' visibility='default' filepath='/usr/include/glib-2.0/glib/gslist.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-427' visibility='default' filepath='/usr/include/glib-2.0/glib/gslist.h' line='42' column='1'/>
      </data-member>
    </class-decl>
    <pointer-type-def type-id='type-id-426' size-in-bits='64' id='type-id-427'/>
    <function-decl name='inet_pton' filepath='/usr/include/arpa/inet.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <parameter type-id='type-id-295'/>
      <parameter type-id='type-id-418'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_datalist_get_data' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='119' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-291'/>
      <parameter type-id='type-id-177'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='g_file_test' filepath='/usr/include/glib-2.0/glib/gfileutils.h' line='115' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-419'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_malloc' filepath='/usr/include/glib-2.0/glib/gmem.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-213'/>
      <return type-id='type-id-112'/>
    </function-decl>
    <function-decl name='g_regex_match_simple' filepath='/usr/include/glib-2.0/glib/gregex.h' line='482' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-421'/>
      <parameter type-id='type-id-423'/>
      <return type-id='type-id-39'/>
    </function-decl>
    <function-decl name='g_slist_free_full' filepath='/usr/include/glib-2.0/glib/gslist.h' line='55' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-427'/>
      <parameter type-id='type-id-243'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_slist_prepend' filepath='/usr/include/glib-2.0/glib/gslist.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-427'/>
      <parameter type-id='type-id-112'/>
      <return type-id='type-id-427'/>
    </function-decl>
    <function-decl name='g_ascii_strup' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='194' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-307'/>
      <return type-id='type-id-103'/>
    </function-decl>
    <function-decl name='g_strsplit_set' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='279' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-177'/>
      <parameter type-id='type-id-108'/>
      <return type-id='type-id-228'/>
    </function-decl>
    <function-decl name='snprintf' filepath='/usr/include/stdio.h' line='378' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-40'/>
      <parameter type-id='type-id-129'/>
      <parameter type-id='type-id-100'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='atoi' filepath='/usr/include/stdlib.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='strncpy' filepath='/usr/include/string.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-40'/>
