<abi-corpus version='2.2' path='_build/src/libnetplan.so.1' architecture='elf-amd-x86_64' soname='libnetplan.so.1'>
  <elf-needed>
    <dependency name='libglib-2.0.so.0'/>
    <dependency name='libgio-2.0.so.0'/>
    <dependency name='libgobject-2.0.so.0'/>
    <dependency name='libyaml-0.so.2'/>
    <dependency name='libuuid.so.1'/>
    <dependency name='libc.so.6'/>
  </elf-needed>
  <elf-function-symbols>
    <elf-symbol name='_netplan_address_iter_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_netplan_address_iter_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_netplan_find_yaml_glob' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_netplan_g_string_free_to_file' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_netplan_nameserver_iter_free' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_netplan_nameserver_iter_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='_netplan_netdef_get_bond_mode' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>

    <elf-symbol name='netplan_netdef_get_set_name' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_netdef_get_sriov_link' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_netdef_get_type' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_netdef_get_vlan_link' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_netdef_get_vrf_link' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_netdef_has_match' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_netdef_match_interface' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_netdef_write_yaml' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_parser_clear' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_parser_get_error_count' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_parser_get_flags' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_parser_load_keyfile' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_parser_load_nullable_fields' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_parser_load_nullable_overrides' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_parser_load_yaml' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_parser_load_yaml_from_fd' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_parser_load_yaml_hierarchy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_parser_new' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_parser_reset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_parser_set_flags' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_clear' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_dump_yaml' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_finish_nm_write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_finish_ovs_write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_finish_sriov_write' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_get_backend' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_get_netdef' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_get_netdefs_size' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_import_parser_results' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_iterator_has_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_iterator_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_iterator_next' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_new' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_reset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_update_yaml_hierarchy' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_state_write_yaml_file' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_util_create_yaml_patch' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <elf-symbol name='netplan_util_dump_yaml_subtree' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <abi-instr address-size='64' path='../src/error.c' comp-dir-path='/root/netplan-slyon/_build' language='LANG_C99'>
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <type-decl name='int' size-in-bits='32' id='type-id-2'/>
    <type-decl name='long int' size-in-bits='64' id='type-id-3'/>
    <class-decl name='_GBufferedInputStream' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gio/gbufferedinputstream.h' line='44' column='1' id='type-id-4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-5' visibility='default' filepath='/usr/include/glib-2.0/gio/gbufferedinputstream.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='priv' type-id='type-id-6' visibility='default' filepath='/usr/include/glib-2.0/gio/gbufferedinputstream.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GCancellable' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gio/gcancellable.h' line='44' column='1' id='type-id-7'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-8' visibility='default' filepath='/usr/include/glib-2.0/gio/gcancellable.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-9' visibility='default' filepath='/usr/include/glib-2.0/gio/gcancellable.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GDataInputStream' size-in-bits='448' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='44' column='1' id='type-id-10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-11' visibility='default' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='priv' type-id='type-id-12' visibility='default' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GError' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='45' column='1' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='domain' type-id='type-id-14' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='code' type-id='type-id-15' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='message' type-id='type-id-16' visibility='default' filepath='/usr/include/glib-2.0/glib/gerror.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GFileInputStream' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gio/gfileinputstream.h' line='44' column='1' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-18' visibility='default' filepath='/usr/include/glib-2.0/gio/gfileinputstream.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='priv' type-id='type-id-19' visibility='default' filepath='/usr/include/glib-2.0/gio/gfileinputstream.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GFilterInputStream' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gio/gfilterinputstream.h' line='43' column='1' id='type-id-20'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-18' visibility='default' filepath='/usr/include/glib-2.0/gio/gfilterinputstream.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='base_stream' type-id='type-id-21' visibility='default' filepath='/usr/include/glib-2.0/gio/gfilterinputstream.h' line='48' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GInputStream' size-in-bits='256' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='44' column='1' id='type-id-22'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='parent_instance' type-id='type-id-8' visibility='default' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='priv' type-id='type-id-23' visibility='default' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GObject' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='252' column='1' id='type-id-24'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type_instance' type-id='type-id-25' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ref_count' type-id='type-id-26' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='257' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='qdata' type-id='type-id-27' visibility='default' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='258' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GString' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/glib/gstring.h' line='45' column='1' id='type-id-28'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='str' type-id='type-id-16' visibility='default' filepath='/usr/include/glib-2.0/glib/gstring.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-29' visibility='default' filepath='/usr/include/glib-2.0/glib/gstring.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='allocated_len' type-id='type-id-29' visibility='default' filepath='/usr/include/glib-2.0/glib/gstring.h' line='49' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GTypeClass' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='451' column='1' id='type-id-30'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_type' type-id='type-id-31' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='454' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GTypeInstance' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='461' column='1' id='type-id-32'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='g_class' type-id='type-id-33' visibility='default' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='464' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__va_list_tag' size-in-bits='192' is-struct='yes' visibility='default' id='type-id-34'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='gp_offset' type-id='type-id-35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='fp_offset' type-id='type-id-35' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='overflow_arg_area' type-id='type-id-36' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='reg_save_area' type-id='type-id-36' visibility='default'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GBufferedInputStream' type-id='type-id-4' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='38' column='1' id='type-id-11'/>
    <typedef-decl name='GCancellable' type-id='type-id-7' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='40' column='1' id='type-id-37'/>
    <typedef-decl name='GDataInputStream' type-id='type-id-10' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='46' column='1' id='type-id-38'/>
    <typedef-decl name='GError' type-id='type-id-13' filepath='/usr/include/glib-2.0/glib/gerror.h' line='43' column='1' id='type-id-39'/>
    <typedef-decl name='GFileInputStream' type-id='type-id-17' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='85' column='1' id='type-id-40'/>
    <typedef-decl name='GFilterInputStream' type-id='type-id-20' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='71' column='1' id='type-id-5'/>
    <typedef-decl name='GInputStream' type-id='type-id-22' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='97' column='1' id='type-id-18'/>
    <typedef-decl name='GObject' type-id='type-id-24' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='192' column='1' id='type-id-8'/>
    <typedef-decl name='GQuark' type-id='type-id-41' filepath='/usr/include/glib-2.0/glib/gquark.h' line='38' column='1' id='type-id-14'/>
    <typedef-decl name='GString' type-id='type-id-28' filepath='/usr/include/glib-2.0/glib/gstring.h' line='43' column='1' id='type-id-42'/>
    <typedef-decl name='GType' type-id='type-id-29' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='427' column='1' id='type-id-31'/>
    <typedef-decl name='GTypeClass' type-id='type-id-30' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='434' column='1' id='type-id-43'/>
    <typedef-decl name='GTypeInstance' type-id='type-id-32' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='436' column='1' id='type-id-25'/>
    <typedef-decl name='NetplanError' type-id='type-id-39' filepath='../include/types.h' line='96' column='1' id='type-id-44'/>
    <typedef-decl name='__ssize_t' type-id='type-id-3' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='194' column='1' id='type-id-45'/>
    <typedef-decl name='__uint64_t' type-id='type-id-46' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='45' column='1' id='type-id-47'/>
    <typedef-decl name='gchar' type-id='type-id-1' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='52' column='1' id='type-id-48'/>
    <typedef-decl name='gint' type-id='type-id-2' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='55' column='1' id='type-id-15'/>
    <typedef-decl name='gsize' type-id='type-id-46' filepath='/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h' line='83' column='1' id='type-id-29'/>
    <typedef-decl name='guint' type-id='type-id-35' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='61' column='1' id='type-id-26'/>
    <typedef-decl name='guint32' type-id='type-id-35' filepath='/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h' line='57' column='1' id='type-id-41'/>
    <typedef-decl name='size_t' type-id='type-id-46' filepath='/usr/lib/gcc/x86_64-linux-gnu/13/include/stddef.h' line='214' column='1' id='type-id-49'/>
    <typedef-decl name='ssize_t' type-id='type-id-45' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='108' column='1' id='type-id-50'/>
    <typedef-decl name='uint64_t' type-id='type-id-47' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h' line='27' column='1' id='type-id-51'/>
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-35'/>
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-46'/>
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-52'/>
    <pointer-type-def type-id='type-id-38' size-in-bits='64' id='type-id-53'/>
    <pointer-type-def type-id='type-id-39' size-in-bits='64' id='type-id-54'/>
    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-55'/>
    <pointer-type-def type-id='type-id-40' size-in-bits='64' id='type-id-56'/>
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-21'/>
    <pointer-type-def type-id='type-id-42' size-in-bits='64' id='type-id-57'/>
    <pointer-type-def type-id='type-id-43' size-in-bits='64' id='type-id-33'/>
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-58'/>
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-59'/>
    <pointer-type-def type-id='type-id-59' size-in-bits='64' id='type-id-60'/>
    <pointer-type-def type-id='type-id-34' size-in-bits='64' id='type-id-61'/>
    <pointer-type-def type-id='type-id-1' size-in-bits='64' id='type-id-62'/>
    <qualified-type-def type-id='type-id-1' const='yes' id='type-id-63'/>
    <pointer-type-def type-id='type-id-63' size-in-bits='64' id='type-id-64'/>
    <qualified-type-def type-id='type-id-48' const='yes' id='type-id-65'/>
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-66'/>
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-16'/>
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-67'/>
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-68'/>
    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-6'/>
    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-9'/>
    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-27'/>
    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-12'/>
    <pointer-type-def type-id='type-id-73' size-in-bits='64' id='type-id-74'/>
    <pointer-type-def type-id='type-id-75' size-in-bits='64' id='type-id-19'/>
    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-23'/>
    <class-decl name='_GBufferedInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-77'/>
    <class-decl name='_GCancellablePrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-78'/>
    <class-decl name='_GData' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-79'/>
    <class-decl name='_GDataInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-80'/>
    <class-decl name='_GFile' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-81'/>
    <class-decl name='_GFileInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-82'/>
    <class-decl name='_GInputStreamPrivate' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-83'/>
    <function-decl name='netplan_error_clear' mangled-name='netplan_error_clear' filepath='../src/error.c' line='185' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_error_clear'>
      <parameter type-id='type-id-60' name='error' filepath='../src/error.c' line='185' column='1'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='netplan_error_message' mangled-name='netplan_error_message' filepath='../src/error.c' line='191' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_error_message'>
      <parameter type-id='type-id-59' name='error' filepath='../src/error.c' line='191' column='1'/>
      <parameter type-id='type-id-62' name='buf' filepath='../src/error.c' line='191' column='1'/>
      <parameter type-id='type-id-49' name='buf_size' filepath='../src/error.c' line='191' column='1'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='netplan_error_code' mangled-name='netplan_error_code' filepath='../src/error.c' line='197' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_error_code'>
      <parameter type-id='type-id-59' name='error' filepath='../src/error.c' line='197' column='1'/>
      <return type-id='type-id-51'/>
    </function-decl>
    <function-decl name='netplan_copy_string' filepath='../src/util-internal.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <typedef-decl name='GBufferedInputStreamPrivate' type-id='type-id-77' filepath='/usr/include/glib-2.0/gio/gbufferedinputstream.h' line='42' column='1' id='type-id-69'/>
    <typedef-decl name='GCancellablePrivate' type-id='type-id-78' filepath='/usr/include/glib-2.0/gio/gcancellable.h' line='42' column='1' id='type-id-70'/>
    <typedef-decl name='GDataInputStreamPrivate' type-id='type-id-80' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='42' column='1' id='type-id-72'/>
    <function-decl name='g_data_input_stream_new' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='68' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-21'/>
      <return type-id='type-id-53'/>
    </function-decl>
    <function-decl name='g_data_input_stream_read_line' filepath='/usr/include/glib-2.0/gio/gdatainputstream.h' line='109' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-53'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-62'/>
    </function-decl>
    <function-decl name='g_file_new_for_path' filepath='/usr/include/glib-2.0/gio/gfile.h' line='607' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-74'/>
    </function-decl>
    <function-decl name='g_file_read' filepath='/usr/include/glib-2.0/gio/gfile.h' line='691' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-74'/>
      <parameter type-id='type-id-52'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-56'/>
    </function-decl>
    <typedef-decl name='GFileInputStreamPrivate' type-id='type-id-82' filepath='/usr/include/glib-2.0/gio/gfileinputstream.h' line='42' column='1' id='type-id-75'/>
    <typedef-decl name='GInputStreamPrivate' type-id='type-id-83' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='42' column='1' id='type-id-76'/>
    <function-decl name='g_input_stream_get_type' filepath='/usr/include/glib-2.0/gio/ginputstream.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-31'/>
    </function-decl>
    <typedef-decl name='GFile' type-id='type-id-81' filepath='/usr/include/glib-2.0/gio/giotypes.h' line='74' column='1' id='type-id-73'/>
    <typedef-decl name='GData' type-id='type-id-79' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='38' column='1' id='type-id-71'/>
    <function-decl name='g_set_error' filepath='/usr/include/glib-2.0/glib/gerror.h' line='221' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-15'/>
      <parameter type-id='type-id-66'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_clear_error' filepath='/usr/include/glib-2.0/glib/gerror.h' line='241' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_free' filepath='/usr/include/glib-2.0/glib/gmem.h' line='74' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_vasprintf' filepath='/usr/include/glib-2.0/glib/gprintf.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-61'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='g_string_sized_new' filepath='/usr/include/glib-2.0/glib/gstring.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='g_string_free_and_steal' filepath='/usr/include/glib-2.0/glib/gstring.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-57'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_string_append_printf' filepath='/usr/include/glib-2.0/glib/gstring.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-66'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <typedef-decl name='gpointer' type-id='type-id-36' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='109' column='1' id='type-id-85'/>
    <function-decl name='g_object_unref' filepath='/usr/include/glib-2.0/gobject/gobject.h' line='515' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-85'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_type_check_instance_cast' filepath='/usr/include/glib-2.0/gobject/gtype.h' line='2621' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-58'/>
      <parameter type-id='type-id-31'/>
      <return type-id='type-id-58'/>
    </function-decl>
    <type-decl name='variadic parameter type' id='type-id-86'/>
    <type-decl name='void' id='type-id-84'/>
    <pointer-type-def type-id='type-id-84' id='type-id-36'/>
  </abi-instr>
  <abi-instr address-size='64' path='../src/names.c' comp-dir-path='/root/netplan-slyon/_build' language='LANG_C99'>
    <enum-decl name='NetplanBackend' naming-typedef-id='type-id-87' filepath='../include/types.h' line='86' column='1' id='type-id-88'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='NETPLAN_BACKEND_NONE' value='0'/>
      <enumerator name='NETPLAN_BACKEND_NETWORKD' value='1'/>
      <enumerator name='NETPLAN_BACKEND_NM' value='2'/>
      <enumerator name='NETPLAN_BACKEND_OVS' value='3'/>
      <enumerator name='NETPLAN_BACKEND_MAX_' value='4'/>
    </enum-decl>
    <enum-decl name='NetplanDefType' naming-typedef-id='type-id-90' filepath='../include/types.h' line='46' column='1' id='type-id-91'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='NETPLAN_DEF_TYPE_NONE' value='0'/>
      <enumerator name='NETPLAN_DEF_TYPE_ETHERNET' value='1'/>
      <enumerator name='NETPLAN_DEF_TYPE_WIFI' value='2'/>
      <enumerator name='NETPLAN_DEF_TYPE_MODEM' value='3'/>
      <enumerator name='NETPLAN_DEF_TYPE_VIRTUAL' value='4'/>
      <enumerator name='NETPLAN_DEF_TYPE_BRIDGE' value='4'/>
      <enumerator name='NETPLAN_DEF_TYPE_BOND' value='5'/>
      <enumerator name='NETPLAN_DEF_TYPE_VLAN' value='6'/>
      <enumerator name='NETPLAN_DEF_TYPE_TUNNEL' value='7'/>
      <enumerator name='NETPLAN_DEF_TYPE_PORT' value='8'/>
      <enumerator name='NETPLAN_DEF_TYPE_VRF' value='9'/>
      <enumerator name='NETPLAN_DEF_TYPE_NM' value='10'/>
      <enumerator name='NETPLAN_DEF_TYPE_DUMMY' value='11'/>
      <enumerator name='NETPLAN_DEF_TYPE_VETH' value='12'/>
      <enumerator name='NETPLAN_DEF_TYPE_NM_PLACEHOLDER_' value='13'/>
      <enumerator name='NETPLAN_DEF_TYPE_MAX_' value='14'/>
    </enum-decl>
    <typedef-decl name='NetplanBackend' type-id='type-id-88' filepath='../include/types.h' line='92' column='1' id='type-id-87'/>
    <typedef-decl name='NetplanDefType' type-id='type-id-91' filepath='../include/types.h' line='71' column='1' id='type-id-90'/>
    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-89'/>
    <function-decl name='netplan_backend_name' mangled-name='netplan_backend_name' filepath='../src/names.c' line='132' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_backend_name'>
      <parameter type-id='type-id-87' name='val' filepath='../src/names.c' line='132' column='1'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='netplan_def_type_name' mangled-name='netplan_def_type_name' filepath='../src/names.c' line='133' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_def_type_name'>
      <parameter type-id='type-id-90' name='val' filepath='../src/names.c' line='133' column='1'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='g_strcmp0' filepath='/usr/include/glib-2.0/glib/gtestutils.h' line='283' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../src/netplan.c' comp-dir-path='/root/netplan-slyon/_build' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='8' id='type-id-92'>
      <subrange length='1' lower-bound='0' upper-bound='0' type-id='type-id-46' id='type-id-93'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='160' id='type-id-94'>
      <subrange length='20' lower-bound='0' upper-bound='19' type-id='type-id-46' id='type-id-95'/>
    </array-type-def>
    <enum-decl name='GLogLevelFlags' naming-typedef-id='type-id-96' filepath='/usr/include/glib-2.0/glib/gmessages.h' line='56' column='1' id='type-id-97'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='G_LOG_FLAG_RECURSION' value='1'/>
      <enumerator name='G_LOG_FLAG_FATAL' value='2'/>
      <enumerator name='G_LOG_LEVEL_ERROR' value='4'/>
      <enumerator name='G_LOG_LEVEL_CRITICAL' value='8'/>
      <enumerator name='G_LOG_LEVEL_WARNING' value='16'/>
      <enumerator name='G_LOG_LEVEL_MESSAGE' value='32'/>
      <enumerator name='G_LOG_LEVEL_INFO' value='64'/>
      <enumerator name='G_LOG_LEVEL_DEBUG' value='128'/>
      <enumerator name='G_LOG_LEVEL_MASK' value='-4'/>
    </enum-decl>
    <enum-decl name='NetplanAddrGenMode' naming-typedef-id='type-id-98' filepath='../src/types-internal.h' line='30' column='1' id='type-id-99'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='NETPLAN_ADDRGEN_DEFAULT' value='0'/>
      <enumerator name='NETPLAN_ADDRGEN_EUI64' value='1'/>
      <enumerator name='NETPLAN_ADDRGEN_STABLEPRIVACY' value='2'/>
      <enumerator name='NETPLAN_ADDRGEN_MAX' value='3'/>
    </enum-decl>
    <enum-decl name='NetplanAuthEAPMethod' naming-typedef-id='type-id-100' filepath='../src/abi.h' line='151' column='1' id='type-id-101'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='NETPLAN_AUTH_EAP_NONE' value='0'/>
      <enumerator name='NETPLAN_AUTH_EAP_TLS' value='1'/>
      <enumerator name='NETPLAN_AUTH_EAP_PEAP' value='2'/>
      <enumerator name='NETPLAN_AUTH_EAP_TTLS' value='3'/>
      <enumerator name='NETPLAN_AUTH_EAP_LEAP' value='4'/>
      <enumerator name='NETPLAN_AUTH_EAP_PWD' value='5'/>
      <enumerator name='NETPLAN_AUTH_EAP_UNKNOWN' value='6'/>
      <enumerator name='NETPLAN_AUTH_EAP_METHOD_MAX' value='7'/>
    </enum-decl>
    <enum-decl name='NetplanAuthKeyManagementType' naming-typedef-id='type-id-102' filepath='../src/abi.h' line='140' column='1' id='type-id-103'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='NETPLAN_AUTH_KEY_MANAGEMENT_NONE' value='0'/>
      <enumerator name='NETPLAN_AUTH_KEY_MANAGEMENT_WPA_PSK' value='1'/>
      <enumerator name='NETPLAN_AUTH_KEY_MANAGEMENT_WPA_EAP' value='2'/>
      <enumerator name='NETPLAN_AUTH_KEY_MANAGEMENT_WPA_EAPSHA256' value='3'/>
      <enumerator name='NETPLAN_AUTH_KEY_MANAGEMENT_WPA_EAPSUITE_B_192' value='4'/>
      <enumerator name='NETPLAN_AUTH_KEY_MANAGEMENT_8021X' value='5'/>
      <enumerator name='NETPLAN_AUTH_KEY_MANAGEMENT_WPA_SAE' value='6'/>
      <enumerator name='NETPLAN_AUTH_KEY_MANAGEMENT_MAX' value='7'/>
    </enum-decl>
    <enum-decl name='NetplanAuthPMFMode' naming-typedef-id='type-id-104' filepath='../src/abi.h' line='162' column='1' id='type-id-105'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='NETPLAN_AUTH_PMF_MODE_NONE' value='0'/>
      <enumerator name='NETPLAN_AUTH_PMF_MODE_DISABLED' value='1'/>
      <enumerator name='NETPLAN_AUTH_PMF_MODE_OPTIONAL' value='2'/>
      <enumerator name='NETPLAN_AUTH_PMF_MODE_REQUIRED' value='3'/>
    </enum-decl>
    <enum-decl name='NetplanInfinibandMode' naming-typedef-id='type-id-106' filepath='../src/abi.h' line='89' column='1' id='type-id-107'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='NETPLAN_IB_MODE_KERNEL' value='0'/>
      <enumerator name='NETPLAN_IB_MODE_DATAGRAM' value='1'/>
      <enumerator name='NETPLAN_IB_MODE_CONNECTED' value='2'/>
      <enumerator name='NETPLAN_IB_MODE_MAX_' value='3'/>
    </enum-decl>
    <enum-decl name='NetplanKeyFlags' naming-typedef-id='type-id-108' filepath='../src/abi.h' line='184' column='1' id='type-id-109'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='NETPLAN_KEY_FLAG_NONE' value='0'/>
      <enumerator name='NETPLAN_KEY_FLAG_AGENT_OWNED' value='1'/>
      <enumerator name='NETPLAN_KEY_FLAG_NOT_SAVED' value='2'/>
      <enumerator name='NETPLAN_KEY_FLAG_NOT_REQUIRED' value='4'/>
      <enumerator name='NETPLAN_KEY_FLAG_MAX_' value='5'/>
    </enum-decl>
    <enum-decl name='NetplanOptionalAddressFlag' naming-typedef-id='type-id-110' filepath='../src/abi.h' line='27' column='1' id='type-id-111'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='NETPLAN_OPTIONAL_IPV4_LL' value='1'/>
      <enumerator name='NETPLAN_OPTIONAL_IPV6_RA' value='2'/>
      <enumerator name='NETPLAN_OPTIONAL_DHCP4' value='4'/>
      <enumerator name='NETPLAN_OPTIONAL_DHCP6' value='8'/>
      <enumerator name='NETPLAN_OPTIONAL_STATIC' value='16'/>
    </enum-decl>
    <enum-decl name='NetplanRAMode' naming-typedef-id='type-id-112' filepath='../src/abi.h' line='83' column='1' id='type-id-113'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='NETPLAN_RA_MODE_KERNEL' value='0'/>
      <enumerator name='NETPLAN_RA_MODE_ENABLED' value='1'/>
      <enumerator name='NETPLAN_RA_MODE_DISABLED' value='2'/>
    </enum-decl>
    <enum-decl name='NetplanTristate' naming-typedef-id='type-id-114' filepath='../src/abi.h' line='36' column='1' id='type-id-115'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='NETPLAN_TRISTATE_UNSET' value='-1'/>
      <enumerator name='NETPLAN_TRISTATE_FALSE' value='0'/>
      <enumerator name='NETPLAN_TRISTATE_TRUE' value='1'/>
    </enum-decl>
    <enum-decl name='NetplanTunnelMode' naming-typedef-id='type-id-116' filepath='../src/abi.h' line='118' column='1' id='type-id-117'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_UNKNOWN' value='0'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_IPIP' value='1'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_GRE' value='2'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_SIT' value='3'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_ISATAP' value='4'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_VTI' value='5'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_IP6IP6' value='6'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_IPIP6' value='7'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_IP6GRE' value='8'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_VTI6' value='9'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_GRETAP' value='10'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_IP6GRETAP' value='11'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_NM_MAX' value='12'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_VXLAN' value='100'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_WIREGUARD' value='101'/>
      <enumerator name='NETPLAN_TUNNEL_MODE_MAX_' value='102'/>
    </enum-decl>
    <enum-decl name='NetplanUseDomainMode' naming-typedef-id='type-id-118' filepath='../src/abi.h' line='57' column='1' id='type-id-119'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='NETPLAN_USE_DOMAIN_MODE_UNSET' value='-1'/>
      <enumerator name='NETPLAN_USE_DOMAIN_MODE_FALSE' value='0'/>
      <enumerator name='NETPLAN_USE_DOMAIN_MODE_TRUE' value='1'/>
      <enumerator name='NETPLAN_USE_DOMAIN_MODE_ROUTE' value='2'/>
    </enum-decl>
    <enum-decl name='NetplanWifiMode' naming-typedef-id='type-id-120' filepath='../src/types-internal.h' line='74' column='1' id='type-id-121'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='NETPLAN_WIFI_MODE_INFRASTRUCTURE' value='0'/>
      <enumerator name='NETPLAN_WIFI_MODE_ADHOC' value='1'/>
      <enumerator name='NETPLAN_WIFI_MODE_AP' value='2'/>
      <enumerator name='NETPLAN_WIFI_MODE_OTHER' value='3'/>
      <enumerator name='NETPLAN_WIFI_MODE_MAX_' value='4'/>
    </enum-decl>
    <enum-decl name='yaml_break_e' filepath='/usr/include/yaml.h' line='112' column='1' id='type-id-122'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='YAML_ANY_BREAK' value='0'/>
      <enumerator name='YAML_CR_BREAK' value='1'/>
      <enumerator name='YAML_LN_BREAK' value='2'/>
      <enumerator name='YAML_CRLN_BREAK' value='3'/>
    </enum-decl>
    <enum-decl name='yaml_emitter_state_e' filepath='/usr/include/yaml.h' line='1485' column='1' id='type-id-123'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='YAML_EMIT_STREAM_START_STATE' value='0'/>
      <enumerator name='YAML_EMIT_FIRST_DOCUMENT_START_STATE' value='1'/>
      <enumerator name='YAML_EMIT_DOCUMENT_START_STATE' value='2'/>
      <enumerator name='YAML_EMIT_DOCUMENT_CONTENT_STATE' value='3'/>
      <enumerator name='YAML_EMIT_DOCUMENT_END_STATE' value='4'/>
      <enumerator name='YAML_EMIT_FLOW_SEQUENCE_FIRST_ITEM_STATE' value='5'/>
      <enumerator name='YAML_EMIT_FLOW_SEQUENCE_ITEM_STATE' value='6'/>
      <enumerator name='YAML_EMIT_FLOW_MAPPING_FIRST_KEY_STATE' value='7'/>
      <enumerator name='YAML_EMIT_FLOW_MAPPING_KEY_STATE' value='8'/>
      <enumerator name='YAML_EMIT_FLOW_MAPPING_SIMPLE_VALUE_STATE' value='9'/>
      <enumerator name='YAML_EMIT_FLOW_MAPPING_VALUE_STATE' value='10'/>
      <enumerator name='YAML_EMIT_BLOCK_SEQUENCE_FIRST_ITEM_STATE' value='11'/>
      <enumerator name='YAML_EMIT_BLOCK_SEQUENCE_ITEM_STATE' value='12'/>
      <enumerator name='YAML_EMIT_BLOCK_MAPPING_FIRST_KEY_STATE' value='13'/>
      <enumerator name='YAML_EMIT_BLOCK_MAPPING_KEY_STATE' value='14'/>
      <enumerator name='YAML_EMIT_BLOCK_MAPPING_SIMPLE_VALUE_STATE' value='15'/>
      <enumerator name='YAML_EMIT_BLOCK_MAPPING_VALUE_STATE' value='16'/>
      <enumerator name='YAML_EMIT_END_STATE' value='17'/>
    </enum-decl>
    <enum-decl name='yaml_encoding_e' filepath='/usr/include/yaml.h' line='99' column='1' id='type-id-124'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='YAML_ANY_ENCODING' value='0'/>
      <enumerator name='YAML_UTF8_ENCODING' value='1'/>
      <enumerator name='YAML_UTF16LE_ENCODING' value='2'/>
      <enumerator name='YAML_UTF16BE_ENCODING' value='3'/>
    </enum-decl>
    <enum-decl name='yaml_error_type_e' filepath='/usr/include/yaml.h' line='124' column='1' id='type-id-125'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='YAML_NO_ERROR' value='0'/>
      <enumerator name='YAML_MEMORY_ERROR' value='1'/>
      <enumerator name='YAML_READER_ERROR' value='2'/>
      <enumerator name='YAML_SCANNER_ERROR' value='3'/>
      <enumerator name='YAML_PARSER_ERROR' value='4'/>
      <enumerator name='YAML_COMPOSER_ERROR' value='5'/>
      <enumerator name='YAML_WRITER_ERROR' value='6'/>
      <enumerator name='YAML_EMITTER_ERROR' value='7'/>
    </enum-decl>
    <enum-decl name='yaml_event_type_e' filepath='/usr/include/yaml.h' line='355' column='1' id='type-id-126'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='YAML_NO_EVENT' value='0'/>
      <enumerator name='YAML_STREAM_START_EVENT' value='1'/>
      <enumerator name='YAML_STREAM_END_EVENT' value='2'/>
      <enumerator name='YAML_DOCUMENT_START_EVENT' value='3'/>
      <enumerator name='YAML_DOCUMENT_END_EVENT' value='4'/>
      <enumerator name='YAML_ALIAS_EVENT' value='5'/>
      <enumerator name='YAML_SCALAR_EVENT' value='6'/>
      <enumerator name='YAML_SEQUENCE_START_EVENT' value='7'/>
      <enumerator name='YAML_SEQUENCE_END_EVENT' value='8'/>
      <enumerator name='YAML_MAPPING_START_EVENT' value='9'/>
      <enumerator name='YAML_MAPPING_END_EVENT' value='10'/>
    </enum-decl>
    <enum-decl name='yaml_mapping_style_e' filepath='/usr/include/yaml.h' line='196' column='1' id='type-id-127'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='YAML_ANY_MAPPING_STYLE' value='0'/>
      <enumerator name='YAML_BLOCK_MAPPING_STYLE' value='1'/>
      <enumerator name='YAML_FLOW_MAPPING_STYLE' value='2'/>
    </enum-decl>
    <enum-decl name='yaml_node_type_e' filepath='/usr/include/yaml.h' line='692' column='1' id='type-id-128'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='YAML_NO_NODE' value='0'/>
      <enumerator name='YAML_SCALAR_NODE' value='1'/>
      <enumerator name='YAML_SEQUENCE_NODE' value='2'/>
      <enumerator name='YAML_MAPPING_NODE' value='3'/>
    </enum-decl>
    <enum-decl name='yaml_scalar_style_e' filepath='/usr/include/yaml.h' line='166' column='1' id='type-id-129'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='YAML_ANY_SCALAR_STYLE' value='0'/>
      <enumerator name='YAML_PLAIN_SCALAR_STYLE' value='1'/>
      <enumerator name='YAML_SINGLE_QUOTED_SCALAR_STYLE' value='2'/>
      <enumerator name='YAML_DOUBLE_QUOTED_SCALAR_STYLE' value='3'/>
      <enumerator name='YAML_LITERAL_SCALAR_STYLE' value='4'/>
      <enumerator name='YAML_FOLDED_SCALAR_STYLE' value='5'/>
    </enum-decl>
    <enum-decl name='yaml_sequence_style_e' filepath='/usr/include/yaml.h' line='185' column='1' id='type-id-130'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='YAML_ANY_SEQUENCE_STYLE' value='0'/>
      <enumerator name='YAML_BLOCK_SEQUENCE_STYLE' value='1'/>
      <enumerator name='YAML_FLOW_SEQUENCE_STYLE' value='2'/>
    </enum-decl>
    <type-decl name='signed char' size-in-bits='8' id='type-id-131'/>
    <class-decl name='_GArray' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/glib/garray.h' line='43' column='1' id='type-id-132'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-16' visibility='default' filepath='/usr/include/glib-2.0/glib/garray.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='len' type-id='type-id-26' visibility='default' filepath='/usr/include/glib-2.0/glib/garray.h' line='46' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GHashTableIter' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='48' column='1' id='type-id-133'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dummy1' type-id='type-id-134' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='dummy2' type-id='type-id-134' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='dummy3' type-id='type-id-134' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='dummy4' type-id='type-id-2' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='dummy5' type-id='type-id-135' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='dummy6' type-id='type-id-134' visibility='default' filepath='/usr/include/glib-2.0/glib/ghash.h' line='56' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_GList' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/glib-2.0/glib/glist.h' line='41' column='1' id='type-id-136'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='data' type-id='type-id-134' visibility='default' filepath='/usr/include/glib-2.0/glib/glist.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='next' type-id='type-id-137' visibility='default' filepath='/usr/include/glib-2.0/glib/glist.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='prev' type-id='type-id-137' visibility='default' filepath='/usr/include/glib-2.0/glib/glist.h' line='45' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_IO_FILE' size-in-bits='1728' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='49' column='1' id='type-id-138'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='_flags' type-id='type-id-2' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='_IO_read_ptr' type-id='type-id-62' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='_IO_read_end' type-id='type-id-62' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='_IO_read_base' type-id='type-id-62' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='56' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='_IO_write_base' type-id='type-id-62' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='_IO_write_ptr' type-id='type-id-62' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='_IO_write_end' type-id='type-id-62' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='_IO_buf_base' type-id='type-id-62' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='_IO_buf_end' type-id='type-id-62' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='_IO_save_base' type-id='type-id-62' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='_IO_backup_base' type-id='type-id-62' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='_IO_save_end' type-id='type-id-62' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='_markers' type-id='type-id-139' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='_chain' type-id='type-id-140' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='_fileno' type-id='type-id-2' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='_flags2' type-id='type-id-2' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='_old_offset' type-id='type-id-141' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='_cur_column' type-id='type-id-142' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='77' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1040'>
        <var-decl name='_vtable_offset' type-id='type-id-131' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1048'>
        <var-decl name='_shortbuf' type-id='type-id-92' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='_lock' type-id='type-id-143' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='81' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='_offset' type-id='type-id-144' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='89' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='_codecvt' type-id='type-id-145' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='91' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='_wide_data' type-id='type-id-146' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='_freeres_list' type-id='type-id-140' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='_freeres_buf' type-id='type-id-36' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='__pad5' type-id='type-id-49' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='_mode' type-id='type-id-2' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='96' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='_unused2' type-id='type-id-94' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='98' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='authentication_settings' size-in-bits='704' is-struct='yes' visibility='default' filepath='../src/abi.h' line='169' column='1' id='type-id-147'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='key_management' type-id='type-id-102' visibility='default' filepath='../src/abi.h' line='170' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='eap_method' type-id='type-id-100' visibility='default' filepath='../src/abi.h' line='171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='pmf_mode' type-id='type-id-104' visibility='default' filepath='../src/abi.h' line='172' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='identity' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='173' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='anonymous_identity' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='password' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='ca_certificate' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='client_certificate' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='client_key' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='client_key_password' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='phase2_auth' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='psk' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='181' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='dhcp_overrides' size-in-bits='384' is-struct='yes' visibility='default' filepath='../src/abi.h' line='65' column='1' id='type-id-148'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='use_dns' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='use_ntp' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='send_hostname' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='use_hostname' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='use_mtu' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='use_routes' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='use_domains' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='72' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='hostname' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='metric' type-id='type-id-26' visibility='default' filepath='../src/abi.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='netplan_backend_settings' size-in-bits='320' is-struct='yes' visibility='default' filepath='../src/abi.h' line='209' column='1' id='type-id-149'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='uuid' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='211' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='stable_id' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='212' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='device' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='passthrough' type-id='type-id-150' visibility='default' filepath='../src/abi.h' line='214' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='netplan_net_definition' size-in-bits='9920' is-struct='yes' visibility='default' filepath='../src/abi.h' line='222' column='1' id='type-id-151'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-90' visibility='default' filepath='../src/abi.h' line='223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='backend' type-id='type-id-87' visibility='default' filepath='../src/abi.h' line='224' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='id' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='225' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='uuid' type-id='type-id-152' visibility='default' filepath='../src/abi.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='optional' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='optional_addresses' type-id='type-id-110' visibility='default' filepath='../src/abi.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='critical' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='dhcp4' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='dhcp6' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='dhcp_identifier' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='237' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='dhcp4_overrides' type-id='type-id-153' visibility='default' filepath='../src/abi.h' line='238' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='dhcp6_overrides' type-id='type-id-153' visibility='default' filepath='../src/abi.h' line='239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='accept_ra' type-id='type-id-112' visibility='default' filepath='../src/abi.h' line='240' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='ip4_addresses' type-id='type-id-154' visibility='default' filepath='../src/abi.h' line='241' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='ip6_addresses' type-id='type-id-154' visibility='default' filepath='../src/abi.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='address_options' type-id='type-id-154' visibility='default' filepath='../src/abi.h' line='243' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='ip6_privacy' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='244' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1568'>
        <var-decl name='ip6_addr_gen_mode' type-id='type-id-26' visibility='default' filepath='../src/abi.h' line='245' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='ip6_addr_gen_token' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='246' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='gateway4' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='247' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='gateway6' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='248' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='ip4_nameservers' type-id='type-id-154' visibility='default' filepath='../src/abi.h' line='249' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='ip6_nameservers' type-id='type-id-154' visibility='default' filepath='../src/abi.h' line='250' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='search_domains' type-id='type-id-154' visibility='default' filepath='../src/abi.h' line='251' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='routes' type-id='type-id-154' visibility='default' filepath='../src/abi.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='ip_rules' type-id='type-id-154' visibility='default' filepath='../src/abi.h' line='253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='wireguard_peers' type-id='type-id-154' visibility='default' filepath='../src/abi.h' line='254' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='linklocal' type-id='type-id-155' visibility='default' filepath='../src/abi.h' line='258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='bridge' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='bond' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='262' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='peer' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='vlan_id' type-id='type-id-26' visibility='default' filepath='../src/abi.h' line='268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='vlan_link' type-id='type-id-156' visibility='default' filepath='../src/abi.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2560'>
        <var-decl name='has_vlans' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='270' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='set_mac' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='273' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='mtubytes' type-id='type-id-26' visibility='default' filepath='../src/abi.h' line='276' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='ipv6_mtubytes' type-id='type-id-26' visibility='default' filepath='../src/abi.h' line='279' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='set_name' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='282' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2816'>
        <var-decl name='match' type-id='type-id-157' visibility='default' filepath='../src/abi.h' line='288' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='has_match' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='289' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3040'>
        <var-decl name='wake_on_lan' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='290' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='wowlan' type-id='type-id-15' visibility='default' filepath='../src/abi.h' line='291' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3104'>
        <var-decl name='emit_lldp' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='292' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='access_points' type-id='type-id-158' visibility='default' filepath='../src/abi.h' line='295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='bond_params' type-id='type-id-159' visibility='default' filepath='../src/abi.h' line='319' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='4416'>
        <var-decl name='modem_params' type-id='type-id-160' visibility='default' filepath='../src/abi.h' line='333' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5056'>
        <var-decl name='bridge_params' type-id='type-id-161' visibility='default' filepath='../src/abi.h' line='344' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5440'>
        <var-decl name='custom_bridging' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='345' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5504'>
        <var-decl name='tunnel' type-id='type-id-162' visibility='default' filepath='../src/abi.h' line='356' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='5952'>
        <var-decl name='auth' type-id='type-id-163' visibility='default' filepath='../src/abi.h' line='358' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6656'>
        <var-decl name='has_auth' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='359' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6720'>
        <var-decl name='sriov_link' type-id='type-id-156' visibility='default' filepath='../src/abi.h' line='363' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6784'>
        <var-decl name='sriov_vlan_filter' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='364' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6816'>
        <var-decl name='sriov_explicit_vf_count' type-id='type-id-26' visibility='default' filepath='../src/abi.h' line='365' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='6848'>
        <var-decl name='ovs_settings' type-id='type-id-164' visibility='default' filepath='../src/abi.h' line='369' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8128'>
        <var-decl name='backend_settings' type-id='type-id-165' visibility='default' filepath='../src/abi.h' line='371' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8448'>
        <var-decl name='filepath' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='373' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8512'>
        <var-decl name='tunnel_ttl' type-id='type-id-26' visibility='default' filepath='../src/abi.h' line='375' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8576'>
        <var-decl name='activation_mode' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='378' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8640'>
        <var-decl name='ignore_carrier' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='381' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8672'>
        <var-decl name='receive_checksum_offload' type-id='type-id-114' visibility='default' filepath='../src/abi.h' line='384' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8704'>
        <var-decl name='transmit_checksum_offload' type-id='type-id-114' visibility='default' filepath='../src/abi.h' line='385' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8736'>
        <var-decl name='tcp_segmentation_offload' type-id='type-id-114' visibility='default' filepath='../src/abi.h' line='386' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8768'>
        <var-decl name='tcp6_segmentation_offload' type-id='type-id-114' visibility='default' filepath='../src/abi.h' line='387' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8800'>
        <var-decl name='generic_segmentation_offload' type-id='type-id-114' visibility='default' filepath='../src/abi.h' line='388' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8832'>
        <var-decl name='generic_receive_offload' type-id='type-id-114' visibility='default' filepath='../src/abi.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8864'>
        <var-decl name='large_receive_offload' type-id='type-id-114' visibility='default' filepath='../src/abi.h' line='390' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8896'>
        <var-decl name='_private' type-id='type-id-166' visibility='default' filepath='../src/abi.h' line='392' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8960'>
        <var-decl name='embedded_switch_mode' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='395' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9024'>
        <var-decl name='sriov_delay_virtual_functions_rebind' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='396' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9056'>
        <var-decl name='ib_mode' type-id='type-id-106' visibility='default' filepath='../src/abi.h' line='399' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9088'>
        <var-decl name='regulatory_domain' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='402' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9152'>
        <var-decl name='vrf_link' type-id='type-id-156' visibility='default' filepath='../src/abi.h' line='406' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9216'>
        <var-decl name='vrf_table' type-id='type-id-26' visibility='default' filepath='../src/abi.h' line='407' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9248'>
        <var-decl name='bridge_neigh_suppress' type-id='type-id-114' visibility='default' filepath='../src/abi.h' line='409' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9280'>
        <var-decl name='has_vxlans' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='413' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9344'>
        <var-decl name='vxlan' type-id='type-id-167' visibility='default' filepath='../src/abi.h' line='414' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9408'>
        <var-decl name='bridge_link' type-id='type-id-156' visibility='default' filepath='../src/abi.h' line='416' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9472'>
        <var-decl name='bond_link' type-id='type-id-156' visibility='default' filepath='../src/abi.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9536'>
        <var-decl name='peer_link' type-id='type-id-156' visibility='default' filepath='../src/abi.h' line='418' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9600'>
        <var-decl name='has_backend_settings_nm' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='421' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9632'>
        <var-decl name='tunnel_private_key_flags' type-id='type-id-26' visibility='default' filepath='../src/abi.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9664'>
        <var-decl name='veth_peer_link' type-id='type-id-156' visibility='default' filepath='../src/abi.h' line='427' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9728'>
        <var-decl name='bridge_hairpin' type-id='type-id-114' visibility='default' filepath='../src/abi.h' line='429' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9760'>
        <var-decl name='bridge_learning' type-id='type-id-114' visibility='default' filepath='../src/abi.h' line='430' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='9792'>
        <var-decl name='ra_overrides' type-id='type-id-168' visibility='default' filepath='../src/abi.h' line='432' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='netplan_state' size-in-bits='1600' is-struct='yes' visibility='default' filepath='../src/types-internal.h' line='192' column='1' id='type-id-169'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='netdefs' type-id='type-id-158' visibility='default' filepath='../src/types-internal.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='netdefs_ordered' type-id='type-id-137' visibility='default' filepath='../src/types-internal.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='backend' type-id='type-id-87' visibility='default' filepath='../src/types-internal.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='ovs_settings' type-id='type-id-164' visibility='default' filepath='../src/types-internal.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='sources' type-id='type-id-158' visibility='default' filepath='../src/types-internal.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='global_renderer' type-id='type-id-158' visibility='default' filepath='../src/types-internal.h' line='206' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='netplan_vxlan' size-in-bits='576' is-struct='yes' visibility='default' filepath='../src/types-internal.h' line='173' column='1' id='type-id-170'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='link' type-id='type-id-156' visibility='default' filepath='../src/types-internal.h' line='174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='vni' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='175' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='ageing' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='176' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='limit' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='tos' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='flow_label' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='179' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='source_port_min' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='180' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='source_port_max' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='181' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='mac_learning' type-id='type-id-114' visibility='default' filepath='../src/types-internal.h' line='182' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='arp_proxy' type-id='type-id-114' visibility='default' filepath='../src/types-internal.h' line='183' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='short_circuit' type-id='type-id-114' visibility='default' filepath='../src/types-internal.h' line='184' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='independent' type-id='type-id-135' visibility='default' filepath='../src/types-internal.h' line='185' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='notifications' type-id='type-id-171' visibility='default' filepath='../src/types-internal.h' line='186' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='checksums' type-id='type-id-171' visibility='default' filepath='../src/types-internal.h' line='187' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='extensions' type-id='type-id-171' visibility='default' filepath='../src/types-internal.h' line='188' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='do_not_fragment' type-id='type-id-114' visibility='default' filepath='../src/types-internal.h' line='189' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ovs_controller' size-in-bits='128' is-struct='yes' visibility='default' filepath='../src/abi.h' line='192' column='1' id='type-id-172'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='connection_mode' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='addresses' type-id='type-id-154' visibility='default' filepath='../src/abi.h' line='194' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ovs_settings' size-in-bits='1280' is-struct='yes' visibility='default' filepath='../src/abi.h' line='197' column='1' id='type-id-173'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='external_ids' type-id='type-id-158' visibility='default' filepath='../src/abi.h' line='198' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='other_config' type-id='type-id-158' visibility='default' filepath='../src/abi.h' line='199' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='lacp' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='fail_mode' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='201' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='mcast_snooping' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='protocols' type-id='type-id-154' visibility='default' filepath='../src/abi.h' line='203' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='rstp' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='controller' type-id='type-id-174' visibility='default' filepath='../src/abi.h' line='205' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='ssl' type-id='type-id-163' visibility='default' filepath='../src/abi.h' line='206' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='private_netdef_data' size-in-bits='64' is-struct='yes' visibility='default' filepath='../src/types-internal.h' line='70' column='1' id='type-id-175'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='dirty_fields' type-id='type-id-158' visibility='default' filepath='../src/types-internal.h' line='71' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='ra_overrides' size-in-bits='96' is-struct='yes' visibility='default' filepath='../src/abi.h' line='77' column='1' id='type-id-176'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='use_dns' type-id='type-id-114' visibility='default' filepath='../src/abi.h' line='78' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='use_domains' type-id='type-id-118' visibility='default' filepath='../src/abi.h' line='79' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='table' type-id='type-id-26' visibility='default' filepath='../src/abi.h' line='80' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_anchors_s' size-in-bits='96' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='1530' column='1' id='type-id-177'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='references' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1532' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='anchor' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1534' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='serialized' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1536' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_document_s' size-in-bits='832' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='780' column='1' id='type-id-178'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='nodes' type-id='type-id-179' visibility='default' filepath='/usr/include/yaml.h' line='790' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='version_directive' type-id='type-id-180' visibility='default' filepath='/usr/include/yaml.h' line='793' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='tag_directives' type-id='type-id-181' visibility='default' filepath='/usr/include/yaml.h' line='801' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='start_implicit' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='804' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='end_implicit' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='806' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='start_mark' type-id='type-id-182' visibility='default' filepath='/usr/include/yaml.h' line='809' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='end_mark' type-id='type-id-182' visibility='default' filepath='/usr/include/yaml.h' line='811' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_emitter_s' size-in-bits='3456' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='1546' column='1' id='type-id-183'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='error' type-id='type-id-184' visibility='default' filepath='/usr/include/yaml.h' line='1554' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='problem' type-id='type-id-64' visibility='default' filepath='/usr/include/yaml.h' line='1556' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='write_handler' type-id='type-id-185' visibility='default' filepath='/usr/include/yaml.h' line='1568' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='write_handler_data' type-id='type-id-36' visibility='default' filepath='/usr/include/yaml.h' line='1571' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='output' type-id='type-id-186' visibility='default' filepath='/usr/include/yaml.h' line='1587' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='buffer' type-id='type-id-187' visibility='default' filepath='/usr/include/yaml.h' line='1599' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='raw_buffer' type-id='type-id-188' visibility='default' filepath='/usr/include/yaml.h' line='1611' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='encoding' type-id='type-id-189' visibility='default' filepath='/usr/include/yaml.h' line='1614' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='992'>
        <var-decl name='canonical' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1626' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='best_indent' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1628' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1056'>
        <var-decl name='best_width' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1630' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='unicode' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1632' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1120'>
        <var-decl name='line_break' type-id='type-id-190' visibility='default' filepath='/usr/include/yaml.h' line='1634' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='states' type-id='type-id-191' visibility='default' filepath='/usr/include/yaml.h' line='1644' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='state' type-id='type-id-192' visibility='default' filepath='/usr/include/yaml.h' line='1647' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='events' type-id='type-id-193' visibility='default' filepath='/usr/include/yaml.h' line='1659' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='indents' type-id='type-id-194' visibility='default' filepath='/usr/include/yaml.h' line='1669' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='tag_directives' type-id='type-id-195' visibility='default' filepath='/usr/include/yaml.h' line='1679' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='indent' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1682' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2080'>
        <var-decl name='flow_level' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1685' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='root_context' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1688' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2144'>
        <var-decl name='sequence_context' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1690' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='mapping_context' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1692' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2208'>
        <var-decl name='simple_key_context' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1694' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='line' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1697' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2272'>
        <var-decl name='column' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1699' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='whitespace' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1701' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2336'>
        <var-decl name='indention' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1703' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='open_ended' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1705' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='anchor_data' type-id='type-id-196' visibility='default' filepath='/usr/include/yaml.h' line='1715' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2624'>
        <var-decl name='tag_data' type-id='type-id-197' visibility='default' filepath='/usr/include/yaml.h' line='1727' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2880'>
        <var-decl name='scalar_data' type-id='type-id-198' visibility='default' filepath='/usr/include/yaml.h' line='1747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='opened' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1759' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3232'>
        <var-decl name='closed' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1761' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='anchors' type-id='type-id-199' visibility='default' filepath='/usr/include/yaml.h' line='1764' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='last_anchor_id' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1767' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='document' type-id='type-id-200' visibility='default' filepath='/usr/include/yaml.h' line='1770' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_event_s' size-in-bits='832' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='386' column='1' id='type-id-201'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-202' visibility='default' filepath='/usr/include/yaml.h' line='389' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-203' visibility='default' filepath='/usr/include/yaml.h' line='471' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='start_mark' type-id='type-id-182' visibility='default' filepath='/usr/include/yaml.h' line='474' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='end_mark' type-id='type-id-182' visibility='default' filepath='/usr/include/yaml.h' line='476' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_mark_s' size-in-bits='192' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='147' column='1' id='type-id-204'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='index' type-id='type-id-49' visibility='default' filepath='/usr/include/yaml.h' line='149' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='line' type-id='type-id-49' visibility='default' filepath='/usr/include/yaml.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='column' type-id='type-id-49' visibility='default' filepath='/usr/include/yaml.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_node_pair_s' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='711' column='1' id='type-id-205'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='key' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='713' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='value' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='715' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_node_s' size-in-bits='768' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='719' column='1' id='type-id-206'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-207' visibility='default' filepath='/usr/include/yaml.h' line='722' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tag' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='725' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='data' type-id='type-id-209' visibility='default' filepath='/usr/include/yaml.h' line='770' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='start_mark' type-id='type-id-182' visibility='default' filepath='/usr/include/yaml.h' line='773' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='end_mark' type-id='type-id-182' visibility='default' filepath='/usr/include/yaml.h' line='775' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_tag_directive_s' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='91' column='1' id='type-id-210'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='93' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prefix' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='95' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_version_directive_s' size-in-bits='64' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='83' column='1' id='type-id-211'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='major' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='minor' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__30' size-in-bits='448' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/abi.h' line='347' column='1' id='type-id-162'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mode' type-id='type-id-116' visibility='default' filepath='../src/abi.h' line='348' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='local_ip' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='349' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='remote_ip' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='350' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='input_key' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='351' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='output_key' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='352' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='private_key' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='353' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='fwmark' type-id='type-id-26' visibility='default' filepath='../src/abi.h' line='354' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='416'>
        <var-decl name='port' type-id='type-id-26' visibility='default' filepath='../src/abi.h' line='355' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__29' size-in-bits='384' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/abi.h' line='335' column='1' id='type-id-161'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ageing_time' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='336' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='priority' type-id='type-id-26' visibility='default' filepath='../src/abi.h' line='337' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='port_priority' type-id='type-id-26' visibility='default' filepath='../src/abi.h' line='338' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='forward_delay' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='339' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='hello_time' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='340' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='max_age' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='341' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='path_cost' type-id='type-id-26' visibility='default' filepath='../src/abi.h' line='342' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='352'>
        <var-decl name='stp' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='343' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__28' size-in-bits='640' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/abi.h' line='322' column='1' id='type-id-160'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='apn' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='323' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='auto_config' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='device_id' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='325' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='network_id' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='326' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='number' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='327' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='password' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='328' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='pin' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='sim_id' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='330' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='sim_operator_id' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='331' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='username' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='332' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__26' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/abi.h' line='283' column='1' id='type-id-157'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='driver' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='285' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='mac' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='286' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='original_name' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='287' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__27' size-in-bits='1216' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/abi.h' line='297' column='1' id='type-id-159'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mode' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lacp_rate' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='299' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='monitor_interval' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='min_links' type-id='type-id-26' visibility='default' filepath='../src/abi.h' line='301' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='transmit_hash_policy' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='302' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='selection_logic' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='303' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='all_members_active' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='304' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='arp_interval' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='305' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='arp_ip_targets' type-id='type-id-154' visibility='default' filepath='../src/abi.h' line='306' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='arp_validate' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='307' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='arp_all_targets' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='308' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='up_delay' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='309' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='down_delay' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='310' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='fail_over_mac_policy' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='311' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='gratuitous_arp' type-id='type-id-26' visibility='default' filepath='../src/abi.h' line='312' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='928'>
        <var-decl name='packets_per_member' type-id='type-id-26' visibility='default' filepath='../src/abi.h' line='314' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='primary_reselect_policy' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='315' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='resend_igmp' type-id='type-id-26' visibility='default' filepath='../src/abi.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='learn_interval' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='317' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='primary_member' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='318' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__25' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/abi.h' line='255' column='1' id='type-id-155'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ipv4' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='256' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ipv6' type-id='type-id-135' visibility='default' filepath='../src/abi.h' line='257' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='418' column='1' id='type-id-212'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='implicit' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='420' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1662' column='1' id='type-id-194'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-213' visibility='default' filepath='/usr/include/yaml.h' line='1664' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-213' visibility='default' filepath='/usr/include/yaml.h' line='1666' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-213' visibility='default' filepath='/usr/include/yaml.h' line='1668' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__20' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='741' column='1' id='type-id-214'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='items' type-id='type-id-215' visibility='default' filepath='/usr/include/yaml.h' line='750' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='style' type-id='type-id-216' visibility='default' filepath='/usr/include/yaml.h' line='752' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__22' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='756' column='1' id='type-id-217'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='pairs' type-id='type-id-218' visibility='default' filepath='/usr/include/yaml.h' line='765' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='style' type-id='type-id-219' visibility='default' filepath='/usr/include/yaml.h' line='767' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1576' column='1' id='type-id-220'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-221' visibility='default' filepath='/usr/include/yaml.h' line='1578' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='size' type-id='type-id-49' visibility='default' filepath='/usr/include/yaml.h' line='1580' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='size_written' type-id='type-id-222' visibility='default' filepath='/usr/include/yaml.h' line='1582' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__2' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1602' column='1' id='type-id-188'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-221' visibility='default' filepath='/usr/include/yaml.h' line='1604' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-221' visibility='default' filepath='/usr/include/yaml.h' line='1606' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pointer' type-id='type-id-221' visibility='default' filepath='/usr/include/yaml.h' line='1608' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='last' type-id='type-id-221' visibility='default' filepath='/usr/include/yaml.h' line='1610' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1708' column='1' id='type-id-196'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='anchor' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='1710' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='anchor_length' type-id='type-id-49' visibility='default' filepath='/usr/include/yaml.h' line='1712' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='alias' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1714' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__12' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='460' column='1' id='type-id-223'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='anchor' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='462' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tag' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='464' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='implicit' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='466' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='style' type-id='type-id-219' visibility='default' filepath='/usr/include/yaml.h' line='468' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='448' column='1' id='type-id-224'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='anchor' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='450' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tag' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='452' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='implicit' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='454' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='style' type-id='type-id-216' visibility='default' filepath='/usr/include/yaml.h' line='456' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='384' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='430' column='1' id='type-id-225'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='anchor' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='432' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tag' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='434' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='value' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='436' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='length' type-id='type-id-49' visibility='default' filepath='/usr/include/yaml.h' line='438' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='plain_implicit' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='quoted_implicit' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='442' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='style' type-id='type-id-226' visibility='default' filepath='/usr/include/yaml.h' line='444' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__9' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='424' column='1' id='type-id-227'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='anchor' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='426' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__16' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1718' column='1' id='type-id-197'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='1720' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='handle_length' type-id='type-id-49' visibility='default' filepath='/usr/include/yaml.h' line='1722' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='suffix' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='1724' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='suffix_length' type-id='type-id-49' visibility='default' filepath='/usr/include/yaml.h' line='1726' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1590' column='1' id='type-id-187'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='1592' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='1594' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='pointer' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='1596' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='last' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='1598' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1730' column='1' id='type-id-198'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='1732' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='length' type-id='type-id-49' visibility='default' filepath='/usr/include/yaml.h' line='1734' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='multiline' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1736' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='flow_plain_allowed' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1738' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='block_plain_allowed' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1740' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='single_quoted_allowed' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1742' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='block_allowed' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1744' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='style' type-id='type-id-226' visibility='default' filepath='/usr/include/yaml.h' line='1746' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__19' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='731' column='1' id='type-id-228'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='733' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='length' type-id='type-id-49' visibility='default' filepath='/usr/include/yaml.h' line='735' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='style' type-id='type-id-226' visibility='default' filepath='/usr/include/yaml.h' line='737' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__3' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1637' column='1' id='type-id-191'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-229' visibility='default' filepath='/usr/include/yaml.h' line='1639' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-229' visibility='default' filepath='/usr/include/yaml.h' line='1641' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-229' visibility='default' filepath='/usr/include/yaml.h' line='1643' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__5' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='395' column='1' id='type-id-230'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='encoding' type-id='type-id-189' visibility='default' filepath='/usr/include/yaml.h' line='397' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1650' column='1' id='type-id-193'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-231' visibility='default' filepath='/usr/include/yaml.h' line='1652' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-231' visibility='default' filepath='/usr/include/yaml.h' line='1654' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='head' type-id='type-id-231' visibility='default' filepath='/usr/include/yaml.h' line='1656' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tail' type-id='type-id-231' visibility='default' filepath='/usr/include/yaml.h' line='1658' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__21' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='743' column='1' id='type-id-215'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-232' visibility='default' filepath='/usr/include/yaml.h' line='745' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-232' visibility='default' filepath='/usr/include/yaml.h' line='747' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-232' visibility='default' filepath='/usr/include/yaml.h' line='749' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__23' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='758' column='1' id='type-id-218'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-233' visibility='default' filepath='/usr/include/yaml.h' line='760' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-233' visibility='default' filepath='/usr/include/yaml.h' line='762' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-233' visibility='default' filepath='/usr/include/yaml.h' line='764' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__18' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='783' column='1' id='type-id-179'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-234' visibility='default' filepath='/usr/include/yaml.h' line='785' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-234' visibility='default' filepath='/usr/include/yaml.h' line='787' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-234' visibility='default' filepath='/usr/include/yaml.h' line='789' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1672' column='1' id='type-id-195'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-235' visibility='default' filepath='/usr/include/yaml.h' line='1674' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-235' visibility='default' filepath='/usr/include/yaml.h' line='1676' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-235' visibility='default' filepath='/usr/include/yaml.h' line='1678' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='406' column='1' id='type-id-181'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-235' visibility='default' filepath='/usr/include/yaml.h' line='408' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-235' visibility='default' filepath='/usr/include/yaml.h' line='410' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='401' column='1' id='type-id-236'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='version_directive' type-id='type-id-180' visibility='default' filepath='/usr/include/yaml.h' line='403' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tag_directives' type-id='type-id-181' visibility='default' filepath='/usr/include/yaml.h' line='411' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='implicit' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='414' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='FILE' type-id='type-id-138' filepath='/usr/include/x86_64-linux-gnu/bits/types/FILE.h' line='7' column='1' id='type-id-237'/>
    <typedef-decl name='GArray' type-id='type-id-132' filepath='/usr/include/glib-2.0/glib/garray.h' line='39' column='1' id='type-id-238'/>
    <typedef-decl name='GCompareFunc' type-id='type-id-239' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='112' column='1' id='type-id-240'/>
    <typedef-decl name='GDataForeachFunc' type-id='type-id-241' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='40' column='1' id='type-id-242'/>
    <typedef-decl name='GDestroyNotify' type-id='type-id-243' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='140' column='1' id='type-id-244'/>
    <typedef-decl name='GEqualFunc' type-id='type-id-239' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='117' column='1' id='type-id-245'/>
    <typedef-decl name='GHashFunc' type-id='type-id-246' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='143' column='1' id='type-id-247'/>
    <typedef-decl name='GHashTableIter' type-id='type-id-133' filepath='/usr/include/glib-2.0/glib/ghash.h' line='46' column='1' id='type-id-248'/>
    <typedef-decl name='GList' type-id='type-id-136' filepath='/usr/include/glib-2.0/glib/glist.h' line='39' column='1' id='type-id-249'/>
    <typedef-decl name='GLogLevelFlags' type-id='type-id-97' filepath='/usr/include/glib-2.0/glib/gmessages.h' line='70' column='1' id='type-id-96'/>
    <typedef-decl name='NetplanAddrGenMode' type-id='type-id-99' filepath='../src/types-internal.h' line='35' column='1' id='type-id-98'/>
    <typedef-decl name='NetplanAuthEAPMethod' type-id='type-id-101' filepath='../src/abi.h' line='160' column='1' id='type-id-100'/>
    <typedef-decl name='NetplanAuthKeyManagementType' type-id='type-id-103' filepath='../src/abi.h' line='149' column='1' id='type-id-102'/>
    <typedef-decl name='NetplanAuthPMFMode' type-id='type-id-105' filepath='../src/abi.h' line='167' column='1' id='type-id-104'/>
    <typedef-decl name='NetplanAuthenticationSettings' type-id='type-id-147' filepath='../src/abi.h' line='182' column='1' id='type-id-163'/>
    <typedef-decl name='NetplanBackendSettings' type-id='type-id-149' filepath='../src/abi.h' line='215' column='1' id='type-id-165'/>
    <typedef-decl name='NetplanDHCPOverrides' type-id='type-id-148' filepath='../src/abi.h' line='75' column='1' id='type-id-153'/>
    <typedef-decl name='NetplanFlags' type-id='type-id-2' filepath='../src/abi.h' line='23' column='1' id='type-id-171'/>
    <typedef-decl name='NetplanInfinibandMode' type-id='type-id-107' filepath='../src/abi.h' line='95' column='1' id='type-id-106'/>
    <typedef-decl name='NetplanKeyFlags' type-id='type-id-109' filepath='../src/abi.h' line='190' column='1' id='type-id-108'/>
    <typedef-decl name='NetplanNetDefinition' type-id='type-id-151' filepath='../include/types.h' line='83' column='1' id='type-id-250'/>
    <typedef-decl name='NetplanOVSController' type-id='type-id-172' filepath='../src/abi.h' line='195' column='1' id='type-id-174'/>
    <typedef-decl name='NetplanOVSSettings' type-id='type-id-173' filepath='../src/abi.h' line='207' column='1' id='type-id-164'/>
    <typedef-decl name='NetplanOptionalAddressFlag' type-id='type-id-111' filepath='../src/abi.h' line='33' column='1' id='type-id-110'/>
    <typedef-decl name='NetplanRAMode' type-id='type-id-113' filepath='../src/abi.h' line='87' column='1' id='type-id-112'/>
    <typedef-decl name='NetplanRAOverrides' type-id='type-id-176' filepath='../src/abi.h' line='81' column='1' id='type-id-168'/>
    <typedef-decl name='NetplanState' type-id='type-id-169' filepath='../include/types.h' line='79' column='1' id='type-id-251'/>
    <typedef-decl name='NetplanTristate' type-id='type-id-115' filepath='../src/abi.h' line='54' column='1' id='type-id-114'/>
    <typedef-decl name='NetplanTunnelMode' type-id='type-id-117' filepath='../src/abi.h' line='138' column='1' id='type-id-116'/>
    <typedef-decl name='NetplanUseDomainMode' type-id='type-id-119' filepath='../src/abi.h' line='62' column='1' id='type-id-118'/>
    <typedef-decl name='NetplanVxlan' type-id='type-id-170' filepath='../src/abi.h' line='217' column='1' id='type-id-252'/>
    <typedef-decl name='NetplanWifiMode' type-id='type-id-121' filepath='../src/types-internal.h' line='80' column='1' id='type-id-120'/>
    <typedef-decl name='_IO_lock_t' type-id='type-id-84' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h' line='43' column='1' id='type-id-253'/>
    <typedef-decl name='__mode_t' type-id='type-id-35' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='150' column='1' id='type-id-254'/>
    <typedef-decl name='__off64_t' type-id='type-id-3' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='153' column='1' id='type-id-144'/>
    <typedef-decl name='__off_t' type-id='type-id-3' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='152' column='1' id='type-id-141'/>
    <typedef-decl name='gboolean' type-id='type-id-15' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='56' column='1' id='type-id-135'/>
    <typedef-decl name='uuid_t' type-id='type-id-255' filepath='/usr/include/uuid/uuid.h' line='44' column='1' id='type-id-152'/>
    <typedef-decl name='yaml_anchors_t' type-id='type-id-177' filepath='/usr/include/yaml.h' line='1537' column='1' id='type-id-256'/>
    <typedef-decl name='yaml_break_t' type-id='type-id-122' filepath='/usr/include/yaml.h' line='121' column='1' id='type-id-190'/>
    <typedef-decl name='yaml_char_t' type-id='type-id-257' filepath='/usr/include/yaml.h' line='80' column='1' id='type-id-258'/>
    <typedef-decl name='yaml_document_t' type-id='type-id-178' filepath='/usr/include/yaml.h' line='813' column='1' id='type-id-259'/>
    <typedef-decl name='yaml_emitter_state_t' type-id='type-id-123' filepath='/usr/include/yaml.h' line='1525' column='1' id='type-id-192'/>
    <typedef-decl name='yaml_emitter_t' type-id='type-id-183' filepath='/usr/include/yaml.h' line='1776' column='1' id='type-id-260'/>
    <typedef-decl name='yaml_encoding_t' type-id='type-id-124' filepath='/usr/include/yaml.h' line='108' column='1' id='type-id-189'/>
    <typedef-decl name='yaml_error_type_t' type-id='type-id-125' filepath='/usr/include/yaml.h' line='144' column='1' id='type-id-184'/>
    <typedef-decl name='yaml_event_t' type-id='type-id-201' filepath='/usr/include/yaml.h' line='478' column='1' id='type-id-261'/>
    <typedef-decl name='yaml_event_type_t' type-id='type-id-126' filepath='/usr/include/yaml.h' line='383' column='1' id='type-id-202'/>
    <typedef-decl name='yaml_mapping_style_t' type-id='type-id-127' filepath='/usr/include/yaml.h' line='205' column='1' id='type-id-219'/>
    <typedef-decl name='yaml_mark_t' type-id='type-id-204' filepath='/usr/include/yaml.h' line='156' column='1' id='type-id-182'/>
    <typedef-decl name='yaml_node_item_t' type-id='type-id-2' filepath='/usr/include/yaml.h' line='708' column='1' id='type-id-262'/>
    <typedef-decl name='yaml_node_pair_t' type-id='type-id-205' filepath='/usr/include/yaml.h' line='716' column='1' id='type-id-263'/>
    <typedef-decl name='yaml_node_t' type-id='type-id-206' filepath='/usr/include/yaml.h' line='705' column='1' id='type-id-264'/>
    <typedef-decl name='yaml_node_type_t' type-id='type-id-128' filepath='/usr/include/yaml.h' line='702' column='1' id='type-id-207'/>
    <typedef-decl name='yaml_scalar_style_t' type-id='type-id-129' filepath='/usr/include/yaml.h' line='182' column='1' id='type-id-226'/>
    <typedef-decl name='yaml_sequence_style_t' type-id='type-id-130' filepath='/usr/include/yaml.h' line='193' column='1' id='type-id-216'/>
    <typedef-decl name='yaml_tag_directive_t' type-id='type-id-210' filepath='/usr/include/yaml.h' line='96' column='1' id='type-id-265'/>
    <typedef-decl name='yaml_version_directive_t' type-id='type-id-211' filepath='/usr/include/yaml.h' line='88' column='1' id='type-id-266'/>
    <typedef-decl name='yaml_write_handler_t' type-id='type-id-267' filepath='/usr/include/yaml.h' line='1482' column='1' id='type-id-268'/>
    <union-decl name='__anonymous_union__' size-in-bits='192' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1574' column='1' id='type-id-186'>
      <data-member access='public'>
        <var-decl name='string' type-id='type-id-220' visibility='default' filepath='/usr/include/yaml.h' line='1583' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='file' type-id='type-id-269' visibility='default' filepath='/usr/include/yaml.h' line='1586' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__2' size-in-bits='256' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='728' column='1' id='type-id-209'>
      <data-member access='public'>
        <var-decl name='scalar' type-id='type-id-228' visibility='default' filepath='/usr/include/yaml.h' line='738' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sequence' type-id='type-id-214' visibility='default' filepath='/usr/include/yaml.h' line='753' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mapping' type-id='type-id-217' visibility='default' filepath='/usr/include/yaml.h' line='768' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='392' column='1' id='type-id-203'>
      <data-member access='public'>
        <var-decl name='stream_start' type-id='type-id-230' visibility='default' filepath='/usr/include/yaml.h' line='398' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='document_start' type-id='type-id-236' visibility='default' filepath='/usr/include/yaml.h' line='415' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='document_end' type-id='type-id-212' visibility='default' filepath='/usr/include/yaml.h' line='421' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='alias' type-id='type-id-227' visibility='default' filepath='/usr/include/yaml.h' line='427' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='scalar' type-id='type-id-225' visibility='default' filepath='/usr/include/yaml.h' line='445' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='sequence_start' type-id='type-id-224' visibility='default' filepath='/usr/include/yaml.h' line='457' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='mapping_start' type-id='type-id-223' visibility='default' filepath='/usr/include/yaml.h' line='469' column='1'/>
      </data-member>
    </union-decl>
    <type-decl name='unsigned char' size-in-bits='8' id='type-id-257'/>
    <array-type-def dimensions='1' type-id='type-id-257' size-in-bits='128' id='type-id-255'>
      <subrange length='16' lower-bound='0' upper-bound='15' type-id='type-id-46' id='type-id-270'/>
    </array-type-def>
    <type-decl name='unsigned short int' size-in-bits='16' id='type-id-142'/>
    <pointer-type-def type-id='type-id-237' size-in-bits='64' id='type-id-269'/>
    <pointer-type-def type-id='type-id-238' size-in-bits='64' id='type-id-154'/>
    <pointer-type-def type-id='type-id-248' size-in-bits='64' id='type-id-271'/>
    <pointer-type-def type-id='type-id-249' size-in-bits='64' id='type-id-137'/>
    <pointer-type-def type-id='type-id-250' size-in-bits='64' id='type-id-156'/>
    <pointer-type-def type-id='type-id-252' size-in-bits='64' id='type-id-167'/>
    <pointer-type-def type-id='type-id-138' size-in-bits='64' id='type-id-140'/>
    <qualified-type-def type-id='type-id-163' const='yes' id='type-id-272'/>
    <pointer-type-def type-id='type-id-272' size-in-bits='64' id='type-id-273'/>
    <qualified-type-def type-id='type-id-250' const='yes' id='type-id-274'/>
    <pointer-type-def type-id='type-id-274' size-in-bits='64' id='type-id-275'/>
    <qualified-type-def type-id='type-id-164' const='yes' id='type-id-276'/>
    <pointer-type-def type-id='type-id-276' size-in-bits='64' id='type-id-277'/>
    <qualified-type-def type-id='type-id-251' const='yes' id='type-id-278'/>
    <pointer-type-def type-id='type-id-278' size-in-bits='64' id='type-id-279'/>
    <qualified-type-def type-id='type-id-64' restrict='yes' id='type-id-280'/>
    <qualified-type-def type-id='type-id-258' const='yes' id='type-id-281'/>
    <pointer-type-def type-id='type-id-281' size-in-bits='64' id='type-id-282'/>
    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-283'/>
    <pointer-type-def type-id='type-id-2' size-in-bits='64' id='type-id-213'/>
    <pointer-type-def type-id='type-id-175' size-in-bits='64' id='type-id-166'/>
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-222'/>
    <pointer-type-def type-id='type-id-284' size-in-bits='64' id='type-id-239'/>
    <pointer-type-def type-id='type-id-285' size-in-bits='64' id='type-id-246'/>
    <pointer-type-def type-id='type-id-257' size-in-bits='64' id='type-id-221'/>
    <pointer-type-def type-id='type-id-286' size-in-bits='64' id='type-id-241'/>
    <pointer-type-def type-id='type-id-287' size-in-bits='64' id='type-id-243'/>
    <pointer-type-def type-id='type-id-256' size-in-bits='64' id='type-id-199'/>
    <pointer-type-def type-id='type-id-258' size-in-bits='64' id='type-id-208'/>
    <pointer-type-def type-id='type-id-259' size-in-bits='64' id='type-id-200'/>
    <pointer-type-def type-id='type-id-192' size-in-bits='64' id='type-id-229'/>
    <pointer-type-def type-id='type-id-260' size-in-bits='64' id='type-id-288'/>
    <pointer-type-def type-id='type-id-261' size-in-bits='64' id='type-id-231'/>
    <pointer-type-def type-id='type-id-262' size-in-bits='64' id='type-id-232'/>
    <pointer-type-def type-id='type-id-263' size-in-bits='64' id='type-id-233'/>
    <pointer-type-def type-id='type-id-264' size-in-bits='64' id='type-id-234'/>
    <pointer-type-def type-id='type-id-265' size-in-bits='64' id='type-id-235'/>
    <pointer-type-def type-id='type-id-266' size-in-bits='64' id='type-id-180'/>
    <pointer-type-def type-id='type-id-268' size-in-bits='64' id='type-id-185'/>
    <pointer-type-def type-id='type-id-289' size-in-bits='64' id='type-id-150'/>
    <pointer-type-def type-id='type-id-150' size-in-bits='64' id='type-id-290'/>
    <pointer-type-def type-id='type-id-291' size-in-bits='64' id='type-id-158'/>
    <pointer-type-def type-id='type-id-292' size-in-bits='64' id='type-id-145'/>
    <pointer-type-def type-id='type-id-253' size-in-bits='64' id='type-id-143'/>
    <pointer-type-def type-id='type-id-293' size-in-bits='64' id='type-id-139'/>
    <pointer-type-def type-id='type-id-294' size-in-bits='64' id='type-id-146'/>
    <class-decl name='_GData' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-295'/>
    <class-decl name='_GHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-296'/>
    <class-decl name='_IO_codecvt' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-292'/>
    <class-decl name='_IO_marker' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-293'/>
    <class-decl name='_IO_wide_data' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-294'/>
    <function-decl name='netplan_state_get_backend' filepath='../include/state.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='netplan_auth_key_management_type_name' filepath='../src/names.h' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-102'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='netplan_auth_eap_method_name' filepath='../src/names.h' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-100'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='netplan_tunnel_mode_name' filepath='../src/names.h' line='36' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-116'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='netplan_addr_gen_mode_name' filepath='../src/names.h' line='39' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-98'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='netplan_wifi_mode_name' filepath='../src/names.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-120'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='netplan_infiniband_mode_name' filepath='../src/names.h' line='45' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-106'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='netplan_key_flags_name' filepath='../src/names.h' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-108'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='netplan_vxlan_notification_name' filepath='../src/names.h' line='51' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='netplan_vxlan_checksum_name' filepath='../src/names.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='netplan_vxlan_extension_name' filepath='../src/names.h' line='57' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='netplan_netdef_write_yaml' mangled-name='netplan_netdef_write_yaml' filepath='../src/netplan.c' line='974' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_netdef_write_yaml'>
      <parameter type-id='type-id-279' name='np_state' filepath='../src/netplan.c' line='975' column='1'/>
      <parameter type-id='type-id-275' name='netdef' filepath='../src/netplan.c' line='976' column='1'/>
      <parameter type-id='type-id-64' name='rootdir' filepath='../src/netplan.c' line='977' column='1'/>
      <parameter type-id='type-id-55' name='error' filepath='../src/netplan.c' line='978' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='netplan_state_write_yaml_file' mangled-name='netplan_state_write_yaml_file' filepath='../src/netplan.c' line='1144' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_write_yaml_file'>
      <parameter type-id='type-id-279' name='np_state' filepath='../src/netplan.c' line='1144' column='1'/>
      <parameter type-id='type-id-64' name='filename' filepath='../src/netplan.c' line='1144' column='1'/>
      <parameter type-id='type-id-64' name='rootdir' filepath='../src/netplan.c' line='1144' column='1'/>
      <parameter type-id='type-id-55' name='error' filepath='../src/netplan.c' line='1144' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='netplan_state_dump_yaml' mangled-name='netplan_state_dump_yaml' filepath='../src/netplan.c' line='1201' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_dump_yaml'>
      <parameter type-id='type-id-279' name='np_state' filepath='../src/netplan.c' line='1201' column='1'/>
      <parameter type-id='type-id-2' name='out_fd' filepath='../src/netplan.c' line='1201' column='1'/>
      <parameter type-id='type-id-55' name='error' filepath='../src/netplan.c' line='1201' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='netplan_state_update_yaml_hierarchy' mangled-name='netplan_state_update_yaml_hierarchy' filepath='../src/netplan.c' line='1210' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_update_yaml_hierarchy'>
      <parameter type-id='type-id-279' name='np_state' filepath='../src/netplan.c' line='1210' column='1'/>
      <parameter type-id='type-id-64' name='default_filename' filepath='../src/netplan.c' line='1210' column='1'/>
      <parameter type-id='type-id-64' name='rootdir' filepath='../src/netplan.c' line='1210' column='1'/>
      <parameter type-id='type-id-55' name='error' filepath='../src/netplan.c' line='1210' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='netplan_state_has_nondefault_globals' filepath='../src/types-internal.h' line='326' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='get_default_backend_for_type' filepath='../src/util-internal.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-90'/>
      <return type-id='type-id-87'/>
    </function-decl>
    <function-decl name='has_openvswitch' filepath='../src/util-internal.h' line='88' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-277'/>
      <parameter type-id='type-id-87'/>
      <parameter type-id='type-id-158'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='complex_object_is_dirty' filepath='../src/util-internal.h' line='94' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-275'/>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='_is_auth_key_management_psk' filepath='../src/util-internal.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-273'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='__errno_location' filepath='/usr/include/errno.h' line='37' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-213'/>
    </function-decl>
    <function-decl name='g_array_new' filepath='/usr/include/glib-2.0/glib/garray.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-135'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-154'/>
    </function-decl>
    <function-decl name='g_array_free' filepath='/usr/include/glib-2.0/glib/garray.h' line='95' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-135'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_array_append_vals' filepath='/usr/include/glib-2.0/glib/garray.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-154'/>
      <parameter type-id='type-id-297'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-154'/>
    </function-decl>
    <typedef-decl name='GData' type-id='type-id-295' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='38' column='1' id='type-id-289'/>
    <function-decl name='g_datalist_foreach' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='82' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-290'/>
      <parameter type-id='type-id-242'/>
      <parameter type-id='type-id-134'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_build_path' filepath='/usr/include/glib-2.0/glib/gfileutils.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <typedef-decl name='GHashTable' type-id='type-id-296' filepath='/usr/include/glib-2.0/glib/ghash.h' line='40' column='1' id='type-id-291'/>
    <function-decl name='g_hash_table_new_full' filepath='/usr/include/glib-2.0/glib/ghash.h' line='63' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-247'/>
      <parameter type-id='type-id-245'/>
      <parameter type-id='type-id-244'/>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-158'/>
    </function-decl>
    <function-decl name='g_hash_table_destroy' filepath='/usr/include/glib-2.0/glib/ghash.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_hash_table_insert' filepath='/usr/include/glib-2.0/glib/ghash.h' line='72' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-134'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='g_hash_table_steal_extended' filepath='/usr/include/glib-2.0/glib/ghash.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-297'/>
      <parameter type-id='type-id-283'/>
      <parameter type-id='type-id-283'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='g_hash_table_lookup' filepath='/usr/include/glib-2.0/glib/ghash.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-297'/>
      <return type-id='type-id-134'/>
    </function-decl>
    <function-decl name='g_hash_table_contains' filepath='/usr/include/glib-2.0/glib/ghash.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-297'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='g_hash_table_lookup_extended' filepath='/usr/include/glib-2.0/glib/ghash.h' line='108' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <parameter type-id='type-id-297'/>
      <parameter type-id='type-id-283'/>
      <parameter type-id='type-id-283'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='g_hash_table_size' filepath='/usr/include/glib-2.0/glib/ghash.h' line='129' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-158'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_hash_table_iter_init' filepath='/usr/include/glib-2.0/glib/ghash.h' line='144' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-271'/>
      <parameter type-id='type-id-158'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_hash_table_iter_next' filepath='/usr/include/glib-2.0/glib/ghash.h' line='147' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-271'/>
      <parameter type-id='type-id-283'/>
      <parameter type-id='type-id-283'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='g_hash_table_iter_remove' filepath='/usr/include/glib-2.0/glib/ghash.h' line='153' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-271'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_str_equal' filepath='/usr/include/glib-2.0/glib/ghash.h' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-297'/>
      <parameter type-id='type-id-297'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='g_str_hash' filepath='/usr/include/glib-2.0/glib/ghash.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-297'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_list_free' filepath='/usr/include/glib-2.0/glib/glist.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-137'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_list_append' filepath='/usr/include/glib-2.0/glib/glist.h' line='61' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-137'/>
      <parameter type-id='type-id-134'/>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='g_list_find_custom' filepath='/usr/include/glib-2.0/glib/glist.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-137'/>
      <parameter type-id='type-id-297'/>
      <parameter type-id='type-id-240'/>
      <return type-id='type-id-137'/>
    </function-decl>
    <function-decl name='g_log' filepath='/usr/include/glib-2.0/glib/gmessages.h' line='105' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-96'/>
      <parameter type-id='type-id-66'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_quark_to_string' filepath='/usr/include/glib-2.0/glib/gquark.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-14'/>
      <return type-id='type-id-66'/>
    </function-decl>
    <function-decl name='g_strdup' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_strdup_printf' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='286' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-66'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_strconcat' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='298' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-66'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_strsplit' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='368' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='g_strfreev' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='379' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_assertion_message_expr' filepath='/usr/include/glib-2.0/glib/gtestutils.h' line='594' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <typedef-decl name='gpointer' type-id='type-id-36' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='109' column='1' id='type-id-134'/>
    <typedef-decl name='gconstpointer' type-id='type-id-36' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='110' column='1' id='type-id-297'/>
    <function-decl name='rename' filepath='/usr/include/stdio.h' line='160' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fclose' filepath='/usr/include/stdio.h' line='184' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-269'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='fdopen' filepath='/usr/include/stdio.h' line='299' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-269'/>
    </function-decl>
    <function-decl name='strchr' filepath='/usr/include/string.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-62'/>
    </function-decl>
    <function-decl name='strlen' filepath='/usr/include/string.h' line='407' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='close' filepath='/usr/include/unistd.h' line='358' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='dup' filepath='/usr/include/unistd.h' line='552' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='unlink' filepath='/usr/include/unistd.h' line='858' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='umask' filepath='/usr/include/x86_64-linux-gnu/sys/stat.h' line='380' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-254'/>
      <return type-id='type-id-254'/>
    </function-decl>
    <function-decl name='yaml_stream_start_event_initialize' filepath='/usr/include/yaml.h' line='490' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-189'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='yaml_stream_end_event_initialize' filepath='/usr/include/yaml.h' line='502' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='yaml_document_start_event_initialize' filepath='/usr/include/yaml.h' line='524' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-180'/>
      <parameter type-id='type-id-235'/>
      <parameter type-id='type-id-235'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='yaml_document_end_event_initialize' filepath='/usr/include/yaml.h' line='543' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='yaml_scalar_event_initialize' filepath='/usr/include/yaml.h' line='580' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-226'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='yaml_sequence_start_event_initialize' filepath='/usr/include/yaml.h' line='603' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-216'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='yaml_sequence_end_event_initialize' filepath='/usr/include/yaml.h' line='616' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='yaml_mapping_start_event_initialize' filepath='/usr/include/yaml.h' line='635' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-282'/>
      <parameter type-id='type-id-2'/>
      <parameter type-id='type-id-219'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='yaml_mapping_end_event_initialize' filepath='/usr/include/yaml.h' line='648' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-231'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='yaml_emitter_initialize' filepath='/usr/include/yaml.h' line='1790' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-288'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='yaml_emitter_delete' filepath='/usr/include/yaml.h' line='1799' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-288'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='yaml_emitter_set_output_file' filepath='/usr/include/yaml.h' line='1831' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-288'/>
      <parameter type-id='type-id-269'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='yaml_emitter_set_unicode' filepath='/usr/include/yaml.h' line='1895' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-288'/>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='yaml_emitter_emit' filepath='/usr/include/yaml.h' line='1922' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-288'/>
      <parameter type-id='type-id-231'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-267'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-221'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-2'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-284'>
      <parameter type-id='type-id-297'/>
      <parameter type-id='type-id-297'/>
      <return type-id='type-id-135'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-285'>
      <parameter type-id='type-id-297'/>
      <return type-id='type-id-26'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-286'>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-134'/>
      <parameter type-id='type-id-134'/>
      <return type-id='type-id-84'/>
    </function-type>
    <function-type size-in-bits='64' id='type-id-287'>
      <parameter type-id='type-id-134'/>
      <return type-id='type-id-84'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../src/networkd.c' comp-dir-path='/root/netplan-slyon/_build' language='LANG_C99'>
    <class-decl name='NetplanAddressOptions' size-in-bits='192' is-struct='yes' naming-typedef-id='type-id-298' visibility='default' filepath='../src/types-internal.h' line='96' column='1' id='type-id-299'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='address' type-id='type-id-62' visibility='default' filepath='../src/types-internal.h' line='97' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lifetime' type-id='type-id-62' visibility='default' filepath='../src/types-internal.h' line='98' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='label' type-id='type-id-62' visibility='default' filepath='../src/types-internal.h' line='99' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='_NetplanStateIterator' size-in-bits='64' is-struct='yes' visibility='default' filepath='../include/types.h' line='107' column='1' id='type-id-300'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='placeholder' type-id='type-id-36' visibility='default' filepath='../include/types.h' line='108' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='address_iter' size-in-bits='256' is-struct='yes' visibility='default' filepath='../src/types-internal.h' line='102' column='1' id='type-id-301'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='ip4_index' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='ip6_index' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='104' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='address_options_index' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='netdef' type-id='type-id-156' visibility='default' filepath='../src/types-internal.h' line='106' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='last_address' type-id='type-id-302' visibility='default' filepath='../src/types-internal.h' line='107' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='if_nameindex' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/net/if.h' line='33' column='1' id='type-id-303'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='if_index' type-id='type-id-35' visibility='default' filepath='/usr/include/net/if.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='if_name' type-id='type-id-62' visibility='default' filepath='/usr/include/net/if.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GHFunc' type-id='type-id-304' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='144' column='1' id='type-id-305'/>
    <typedef-decl name='NetplanAddressOptions' type-id='type-id-299' filepath='../src/types-internal.h' line='100' column='1' id='type-id-298'/>
    <typedef-decl name='NetplanStateIterator' type-id='type-id-300' filepath='../include/types.h' line='100' column='1' id='type-id-306'/>
    <typedef-decl name='gssize' type-id='type-id-3' filepath='/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h' line='82' column='1' id='type-id-307'/>
    <typedef-decl name='guint64' type-id='type-id-46' filepath='/usr/lib/x86_64-linux-gnu/glib-2.0/include/glibconfig.h' line='67' column='1' id='type-id-308'/>
    <typedef-decl name='mode_t' type-id='type-id-254' filepath='/usr/include/x86_64-linux-gnu/sys/types.h' line='69' column='1' id='type-id-309'/>
    <pointer-type-def type-id='type-id-298' size-in-bits='64' id='type-id-302'/>
    <pointer-type-def type-id='type-id-306' size-in-bits='64' id='type-id-310'/>
    <pointer-type-def type-id='type-id-301' size-in-bits='64' id='type-id-311'/>
    <qualified-type-def type-id='type-id-306' const='yes' id='type-id-312'/>
    <pointer-type-def type-id='type-id-312' size-in-bits='64' id='type-id-313'/>
    <qualified-type-def type-id='type-id-142' const='yes' id='type-id-314'/>
    <pointer-type-def type-id='type-id-314' size-in-bits='64' id='type-id-315'/>
    <pointer-type-def type-id='type-id-315' size-in-bits='64' id='type-id-316'/>
    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-317'/>
    <pointer-type-def type-id='type-id-303' size-in-bits='64' id='type-id-318'/>
    <pointer-type-def type-id='type-id-319' size-in-bits='64' id='type-id-304'/>
    <pointer-type-def type-id='type-id-320' size-in-bits='64' id='type-id-321'/>
    <class-decl name='_GHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-322'/>
    <function-decl name='netplan_netdef_get_type' filepath='../include/netdef.h' line='69' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-275'/>
      <return type-id='type-id-90'/>
    </function-decl>
    <function-decl name='netplan_netdef_get_bridge_link' filepath='../include/netdef.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-275'/>
      <return type-id='type-id-156'/>
    </function-decl>
    <function-decl name='netplan_netdef_get_bond_link' filepath='../include/netdef.h' line='100' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-275'/>
      <return type-id='type-id-156'/>
    </function-decl>
    <function-decl name='netplan_netdef_has_match' filepath='../include/netdef.h' line='160' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-275'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='netplan_netdef_match_interface' filepath='../include/netdef.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-275'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='netplan_netdef_get_dhcp4' filepath='../include/netdef.h' line='181' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-275'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='netplan_netdef_get_dhcp6' filepath='../include/netdef.h' line='189' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-275'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='netplan_netdef_get_link_local_ipv4' filepath='../include/netdef.h' line='197' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-275'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='netplan_netdef_get_link_local_ipv6' filepath='../include/netdef.h' line='205' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-275'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='netplan_state_iterator_init' filepath='../include/state.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-310'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='netplan_state_iterator_next' filepath='../include/state.h' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-310'/>
      <return type-id='type-id-156'/>
    </function-decl>
    <function-decl name='netplan_state_iterator_has_next' filepath='../include/state.h' line='175' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-313'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='_netplan_netdef_write_network_file' mangled-name='_netplan_netdef_write_network_file' filepath='../src/networkd.c' line='835' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_netplan_netdef_write_network_file'>
      <parameter type-id='type-id-279' name='np_state' filepath='../src/networkd.c' line='836' column='1'/>
      <parameter type-id='type-id-275' name='def' filepath='../src/networkd.c' line='837' column='1'/>
      <parameter type-id='type-id-64' name='rootdir' filepath='../src/networkd.c' line='838' column='1'/>
      <parameter type-id='type-id-64' name='path' filepath='../src/networkd.c' line='839' column='1'/>
      <parameter type-id='type-id-317' name='has_been_written' filepath='../src/networkd.c' line='840' column='1'/>
      <parameter type-id='type-id-55' name='error' filepath='../src/networkd.c' line='841' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='_netplan_netdef_write_networkd' mangled-name='_netplan_netdef_write_networkd' filepath='../src/networkd.c' line='1461' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_netplan_netdef_write_networkd'>
      <parameter type-id='type-id-279' name='np_state' filepath='../src/networkd.c' line='1462' column='1'/>
      <parameter type-id='type-id-275' name='def' filepath='../src/networkd.c' line='1463' column='1'/>
      <parameter type-id='type-id-64' name='rootdir' filepath='../src/networkd.c' line='1464' column='1'/>
      <parameter type-id='type-id-317' name='has_been_written' filepath='../src/networkd.c' line='1465' column='1'/>
      <parameter type-id='type-id-55' name='error' filepath='../src/networkd.c' line='1466' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='_netplan_networkd_write_wait_online' mangled-name='_netplan_networkd_write_wait_online' filepath='../src/networkd.c' line='1540' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_netplan_networkd_write_wait_online'>
      <parameter type-id='type-id-279' name='np_state' filepath='../src/networkd.c' line='1540' column='1'/>
      <parameter type-id='type-id-64' name='rootdir' filepath='../src/networkd.c' line='1540' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='_netplan_networkd_cleanup' mangled-name='_netplan_networkd_cleanup' filepath='../src/networkd.c' line='1666' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_netplan_networkd_cleanup'>
      <parameter type-id='type-id-64' name='rootdir' filepath='../src/networkd.c' line='1666' column='1'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='_netplan_safe_mkdir_p_dir' filepath='../src/util-internal.h' line='38' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='_netplan_g_string_free_to_file_with_permissions' filepath='../src/util-internal.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-309'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='_netplan_unlink_glob' filepath='../src/util-internal.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='get_global_network' filepath='../src/util-internal.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='wifi_get_freq24' filepath='../src/util-internal.h' line='59' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='wifi_get_freq5' filepath='../src/util-internal.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='systemd_escape' filepath='../src/util-internal.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='is_multicast_address' filepath='../src/util-internal.h' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='_is_macaddress_special_nd_option' filepath='../src/util-internal.h' line='142' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='_is_valid_macaddress' filepath='../src/util-internal.h' line='145' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='_netplan_netdef_new_address_iter' filepath='../src/util-internal.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-156'/>
      <return type-id='type-id-311'/>
    </function-decl>
    <function-decl name='_netplan_address_iter_next' filepath='../src/util-internal.h' line='151' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-311'/>
      <return type-id='type-id-302'/>
    </function-decl>
    <function-decl name='_netplan_address_iter_free' filepath='../src/util-internal.h' line='154' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-311'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='_netplan_scrub_string' filepath='../src/util-internal.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='_netplan_scrub_systemd_unit_contents' filepath='../src/util-internal.h' line='222' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='is_wireguard_key' filepath='../src/validation.h' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='__ctype_b_loc' filepath='/usr/include/ctype.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-316'/>
    </function-decl>
    <function-decl name='g_file_get_contents' filepath='/usr/include/glib-2.0/glib/gfileutils.h' line='120' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='g_file_read_link' filepath='/usr/include/glib-2.0/glib/gfileutils.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_path_get_basename' filepath='/usr/include/glib-2.0/glib/gfileutils.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <typedef-decl name='GHashTable' type-id='type-id-322' filepath='/usr/include/glib-2.0/glib/ghash.h' line='40' column='1' id='type-id-320'/>
    <function-decl name='g_hash_table_replace' filepath='/usr/include/glib-2.0/glib/ghash.h' line='76' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-321'/>
      <parameter type-id='type-id-323'/>
      <parameter type-id='type-id-323'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='g_hash_table_add' filepath='/usr/include/glib-2.0/glib/ghash.h' line='80' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-321'/>
      <parameter type-id='type-id-323'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='g_hash_table_foreach' filepath='/usr/include/glib-2.0/glib/ghash.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-321'/>
      <parameter type-id='type-id-305'/>
      <parameter type-id='type-id-323'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_hash_table_unref' filepath='/usr/include/glib-2.0/glib/ghash.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-321'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_malloc0' filepath='/usr/include/glib-2.0/glib/gmem.h' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-323'/>
    </function-decl>
    <function-decl name='g_ascii_strtoull' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='220' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-67'/>
      <parameter type-id='type-id-26'/>
      <return type-id='type-id-308'/>
    </function-decl>
    <function-decl name='g_strchug' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='243' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_strchomp' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='246' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-16'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_strjoin' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='301' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-66'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_string_new' filepath='/usr/include/glib-2.0/glib/gstring.h' line='53' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='g_string_free' filepath='/usr/include/glib-2.0/glib/gstring.h' line='62' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-135'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_string_insert_len' filepath='/usr/include/glib-2.0/glib/gstring.h' line='96' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-307'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-307'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='g_string_append_len' filepath='/usr/include/glib-2.0/glib/gstring.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-307'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='g_string_insert_c' filepath='/usr/include/glib-2.0/glib/gstring.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-307'/>
      <parameter type-id='type-id-48'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='g_string_overwrite' filepath='/usr/include/glib-2.0/glib/gstring.h' line='139' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <function-decl name='g_string_printf' filepath='/usr/include/glib-2.0/glib/gstring.h' line='166' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-66'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <typedef-decl name='gpointer' type-id='type-id-36' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='109' column='1' id='type-id-323'/>
    <typedef-decl name='gconstpointer' type-id='type-id-36' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='110' column='1' id='type-id-324'/>
    <function-decl name='g_uri_escape_string' filepath='/usr/include/glib-2.0/glib/guri.h' line='403' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-135'/>
      <return type-id='type-id-62'/>
    </function-decl>
    <function-decl name='if_nameindex' filepath='/usr/include/net/if.h' line='199' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-318'/>
    </function-decl>
    <function-decl name='if_freenameindex' filepath='/usr/include/net/if.h' line='202' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-318'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='memcpy' filepath='/usr/include/string.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='memmove' filepath='/usr/include/string.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-36'/>
    </function-decl>
    <function-decl name='strncmp' filepath='/usr/include/string.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='symlink' filepath='/usr/include/unistd.h' line='832' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-type size-in-bits='64' id='type-id-319'>
      <parameter type-id='type-id-323'/>
      <parameter type-id='type-id-323'/>
      <parameter type-id='type-id-323'/>
      <return type-id='type-id-84'/>
    </function-type>
  </abi-instr>
  <abi-instr address-size='64' path='../src/nm.c' comp-dir-path='/root/netplan-slyon/_build' language='LANG_C99'>
    <enum-decl name='GFileTest' naming-typedef-id='type-id-325' filepath='/usr/include/glib-2.0/glib/gfileutils.h' line='69' column='1' id='type-id-326'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='G_FILE_TEST_IS_REGULAR' value='1'/>
      <enumerator name='G_FILE_TEST_IS_SYMLINK' value='2'/>
      <enumerator name='G_FILE_TEST_IS_DIR' value='4'/>
      <enumerator name='G_FILE_TEST_IS_EXECUTABLE' value='8'/>
      <enumerator name='G_FILE_TEST_EXISTS' value='16'/>
    </enum-decl>
    <typedef-decl name='GFileTest' type-id='type-id-326' filepath='/usr/include/glib-2.0/glib/gfileutils.h' line='75' column='1' id='type-id-325'/>
    <qualified-type-def type-id='type-id-66' const='yes' id='type-id-327'/>
    <pointer-type-def type-id='type-id-327' size-in-bits='64' id='type-id-328'/>
    <qualified-type-def type-id='type-id-257' const='yes' id='type-id-329'/>
    <pointer-type-def type-id='type-id-329' size-in-bits='64' id='type-id-330'/>
    <pointer-type-def type-id='type-id-331' size-in-bits='64' id='type-id-332'/>
    <pointer-type-def type-id='type-id-332' size-in-bits='64' id='type-id-333'/>
    <pointer-type-def type-id='type-id-334' size-in-bits='64' id='type-id-335'/>
    <pointer-type-def type-id='type-id-336' size-in-bits='64' id='type-id-337'/>
    <class-decl name='_GData' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-338'/>
    <class-decl name='_GHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-339'/>
    <class-decl name='_GKeyFile' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-340'/>
    <function-decl name='netplan_state_get_netdefs_size' filepath='../include/state.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-279'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='_netplan_netdef_write_nm' mangled-name='_netplan_netdef_write_nm' filepath='../src/nm.c' line='1008' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_netplan_netdef_write_nm'>
      <parameter type-id='type-id-279' name='np_state' filepath='../src/nm.c' line='1009' column='1'/>
      <parameter type-id='type-id-275' name='netdef' filepath='../src/nm.c' line='1010' column='1'/>
      <parameter type-id='type-id-64' name='rootdir' filepath='../src/nm.c' line='1011' column='1'/>
      <parameter type-id='type-id-317' name='has_been_written' filepath='../src/nm.c' line='1012' column='1'/>
      <parameter type-id='type-id-55' name='error' filepath='../src/nm.c' line='1013' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='netplan_state_finish_nm_write' mangled-name='netplan_state_finish_nm_write' filepath='../src/nm.c' line='1065' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_finish_nm_write'>
      <parameter type-id='type-id-279' name='np_state' filepath='../src/nm.c' line='1066' column='1'/>
      <parameter type-id='type-id-64' name='rootdir' filepath='../src/nm.c' line='1067' column='1'/>
      <parameter type-id='type-id-55' name='error' filepath='../src/nm.c' line='1068' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='_netplan_nm_cleanup' mangled-name='_netplan_nm_cleanup' filepath='../src/nm.c' line='1181' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_netplan_nm_cleanup'>
      <parameter type-id='type-id-64' name='rootdir' filepath='../src/nm.c' line='1181' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='validate_veth_pair' filepath='../src/validation.h' line='49' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-279'/>
      <parameter type-id='type-id-275'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <typedef-decl name='GData' type-id='type-id-338' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='38' column='1' id='type-id-331'/>
    <function-decl name='g_datalist_get_data' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='125' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-333'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-341'/>
    </function-decl>
    <function-decl name='g_file_test' filepath='/usr/include/glib-2.0/glib/gfileutils.h' line='117' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-325'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <typedef-decl name='GHashTable' type-id='type-id-339' filepath='/usr/include/glib-2.0/glib/ghash.h' line='40' column='1' id='type-id-334'/>
    <typedef-decl name='GKeyFile' type-id='type-id-340' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='50' column='1' id='type-id-336'/>
    <function-decl name='g_key_file_new' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
      <return type-id='type-id-337'/>
    </function-decl>
    <function-decl name='g_key_file_unref' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-337'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_key_file_save_to_file' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='104' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-337'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='g_key_file_has_key' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='121' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-337'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='g_key_file_set_value' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-337'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_key_file_get_string' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-337'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_key_file_set_string' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='141' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-337'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_key_file_set_boolean' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='168' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-337'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-135'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_key_file_set_integer' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-337'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-15'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_key_file_set_uint64' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='198' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-337'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-308'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_key_file_set_string_list' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='219' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-337'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-328'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_key_file_set_comment' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='275' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-337'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='g_key_file_remove_key' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='292' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-337'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='g_ascii_strcasecmp' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='251' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='g_strjoinv' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='376' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <function-decl name='g_strv_length' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='383' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-67'/>
      <return type-id='type-id-26'/>
    </function-decl>
    <function-decl name='g_string_ascii_down' filepath='/usr/include/glib-2.0/glib/gstring.h' line='157' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-57'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <typedef-decl name='gpointer' type-id='type-id-36' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='109' column='1' id='type-id-341'/>
    <function-decl name='strpbrk' filepath='/usr/include/string.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-62'/>
    </function-decl>
    <function-decl name='strnlen' filepath='/usr/include/string.h' line='413' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-49'/>
    </function-decl>
    <function-decl name='uuid_generate' filepath='/usr/include/uuid/uuid.h' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-221'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='uuid_is_null' filepath='/usr/include/uuid/uuid.h' line='100' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-330'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='uuid_unparse' filepath='/usr/include/uuid/uuid.h' line='107' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-330'/>
      <parameter type-id='type-id-62'/>
      <return type-id='type-id-84'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../src/openvswitch.c' comp-dir-path='/root/netplan-slyon/_build' language='LANG_C99'>
    <pointer-type-def type-id='type-id-342' size-in-bits='64' id='type-id-343'/>
    <class-decl name='_GHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-344'/>
    <function-decl name='_netplan_netdef_write_ovs' mangled-name='_netplan_netdef_write_ovs' filepath='../src/openvswitch.c' line='325' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_netplan_netdef_write_ovs'>
      <parameter type-id='type-id-279' name='np_state' filepath='../src/openvswitch.c' line='325' column='1'/>
      <parameter type-id='type-id-275' name='def' filepath='../src/openvswitch.c' line='325' column='1'/>
      <parameter type-id='type-id-64' name='rootdir' filepath='../src/openvswitch.c' line='325' column='1'/>
      <parameter type-id='type-id-317' name='has_been_written' filepath='../src/openvswitch.c' line='325' column='1'/>
      <parameter type-id='type-id-55' name='error' filepath='../src/openvswitch.c' line='325' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='netplan_state_finish_ovs_write' mangled-name='netplan_state_finish_ovs_write' filepath='../src/openvswitch.c' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_finish_ovs_write'>
      <parameter type-id='type-id-279' name='np_state' filepath='../src/openvswitch.c' line='467' column='1'/>
      <parameter type-id='type-id-64' name='rootdir' filepath='../src/openvswitch.c' line='467' column='1'/>
      <parameter type-id='type-id-55' name='error' filepath='../src/openvswitch.c' line='467' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='_netplan_ovs_cleanup' mangled-name='_netplan_ovs_cleanup' filepath='../src/openvswitch.c' line='513' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='_netplan_ovs_cleanup'>
      <parameter type-id='type-id-64' name='rootdir' filepath='../src/openvswitch.c' line='513' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <typedef-decl name='GHashTable' type-id='type-id-344' filepath='/usr/include/glib-2.0/glib/ghash.h' line='40' column='1' id='type-id-342'/>
    <function-decl name='g_str_has_prefix' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='146' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='g_string_erase' filepath='/usr/include/glib-2.0/glib/gstring.h' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-57'/>
      <parameter type-id='type-id-307'/>
      <parameter type-id='type-id-307'/>
      <return type-id='type-id-57'/>
    </function-decl>
    <typedef-decl name='gpointer' type-id='type-id-36' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='109' column='1' id='type-id-345'/>
    <function-decl name='memcmp' filepath='/usr/include/string.h' line='64' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-36'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-2'/>
    </function-decl>
    <function-decl name='strcmp' filepath='/usr/include/string.h' line='156' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-2'/>
    </function-decl>
  </abi-instr>
  <abi-instr address-size='64' path='../src/parse-nm.c' comp-dir-path='/root/netplan-slyon/_build' language='LANG_C99'>
    <enum-decl name='GKeyFileFlags' naming-typedef-id='type-id-346' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='53' column='1' id='type-id-347'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='G_KEY_FILE_NONE' value='0'/>
      <enumerator name='G_KEY_FILE_KEEP_COMMENTS' value='1'/>
      <enumerator name='G_KEY_FILE_KEEP_TRANSLATIONS' value='2'/>
    </enum-decl>
    <typedef-decl name='GKeyFileFlags' type-id='type-id-347' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='57' column='1' id='type-id-346'/>
    <pointer-type-def type-id='type-id-348' size-in-bits='64' id='type-id-349'/>
    <pointer-type-def type-id='type-id-349' size-in-bits='64' id='type-id-350'/>
    <pointer-type-def type-id='type-id-351' size-in-bits='64' id='type-id-352'/>
    <pointer-type-def type-id='type-id-353' size-in-bits='64' id='type-id-354'/>
    <class-decl name='_GData' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-355'/>
    <class-decl name='_GHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-356'/>
    <class-decl name='_GKeyFile' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-357'/>
    <function-decl name='netplan_get_id_from_nm_filepath' filepath='../include/util.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-62'/>
      <parameter type-id='type-id-49'/>
      <return type-id='type-id-50'/>
    </function-decl>
    <function-decl name='netplan_parser_load_keyfile' mangled-name='netplan_parser_load_keyfile' filepath='../src/parse-nm.c' line='621' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_load_keyfile'>
      <parameter type-id='type-id-358' name='npp' filepath='../src/parse-nm.c' line='621' column='1'/>
      <parameter type-id='type-id-64' name='filename' filepath='../src/parse-nm.c' line='621' column='1'/>
      <parameter type-id='type-id-55' name='error' filepath='../src/parse-nm.c' line='621' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='reset_vxlan' filepath='../src/types-internal.h' line='308' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-167'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='get_unspecified_address' filepath='../src/util-internal.h' line='56' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-2'/>
      <return type-id='type-id-64'/>
    </function-decl>
    <function-decl name='netplan_netdef_new' filepath='../src/util-internal.h' line='79' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-358'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-156'/>
    </function-decl>
    <function-decl name='is_ip4_address' filepath='../src/validation.h' line='25' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='is_ip6_address' filepath='../src/validation.h' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-64'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='validate_netdef_grammar' filepath='../src/validation.h' line='34' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-359'/>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <typedef-decl name='GData' type-id='type-id-355' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='38' column='1' id='type-id-348'/>
    <function-decl name='g_datalist_init' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-350'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='g_datalist_id_set_data_full' filepath='/usr/include/glib-2.0/glib/gdataset.h' line='54' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-350'/>
      <parameter type-id='type-id-14'/>
      <parameter type-id='type-id-360'/>
      <parameter type-id='type-id-244'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <typedef-decl name='GHashTable' type-id='type-id-356' filepath='/usr/include/glib-2.0/glib/ghash.h' line='40' column='1' id='type-id-351'/>
    <function-decl name='g_hash_table_new' filepath='/usr/include/glib-2.0/glib/ghash.h' line='60' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-247'/>
      <parameter type-id='type-id-245'/>
      <return type-id='type-id-352'/>
    </function-decl>
    <typedef-decl name='GKeyFile' type-id='type-id-357' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='50' column='1' id='type-id-353'/>
    <function-decl name='g_key_file_load_from_file' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='71' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-354'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-346'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='g_key_file_get_groups' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='110' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-354'/>
      <parameter type-id='type-id-68'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='g_key_file_get_keys' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='113' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-354'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='g_key_file_has_group' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='118' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-354'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='g_key_file_get_boolean' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='163' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-354'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='g_key_file_get_integer' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='173' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-354'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-15'/>
    </function-decl>
    <function-decl name='g_key_file_get_uint64' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='193' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-354'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-308'/>
    </function-decl>
    <function-decl name='g_key_file_get_string_list' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='213' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-354'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-68'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-67'/>
    </function-decl>
    <function-decl name='g_key_file_remove_group' filepath='/usr/include/glib-2.0/glib/gkeyfile.h' line='297' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-354'/>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='g_malloc0_n' filepath='/usr/include/glib-2.0/glib/gmem.h' line='102' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-29'/>
      <parameter type-id='type-id-29'/>
      <return type-id='type-id-360'/>
    </function-decl>
    <function-decl name='g_quark_from_string' filepath='/usr/include/glib-2.0/glib/gquark.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-14'/>
    </function-decl>
    <function-decl name='g_strrstr' filepath='/usr/include/glib-2.0/glib/gstrfuncs.h' line='135' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-66'/>
      <parameter type-id='type-id-66'/>
      <return type-id='type-id-16'/>
    </function-decl>
    <typedef-decl name='gpointer' type-id='type-id-36' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='109' column='1' id='type-id-360'/>
    <typedef-decl name='gconstpointer' type-id='type-id-36' filepath='/usr/include/glib-2.0/glib/gtypes.h' line='110' column='1' id='type-id-361'/>
  </abi-instr>
  <abi-instr address-size='64' path='../src/parse.c' comp-dir-path='/root/netplan-slyon/_build' language='LANG_C99'>
    <array-type-def dimensions='1' type-id='type-id-362' size-in-bits='768' id='type-id-363'>
      <subrange length='6' lower-bound='0' upper-bound='5' type-id='type-id-46' id='type-id-364'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-362' size-in-bits='unknown' id='type-id-365'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' id='type-id-366'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-367' size-in-bits='1280' id='type-id-368'>
      <subrange length='10' lower-bound='0' upper-bound='9' type-id='type-id-46' id='type-id-369'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-367' size-in-bits='unknown' id='type-id-370'>
      <subrange length='unknown' lower-bound='0' upper-bound='0' id='type-id-366'/>
    </array-type-def>
    <array-type-def dimensions='1' type-id='type-id-371' size-in-bits='192' id='type-id-372'>
      <subrange length='3' lower-bound='0' upper-bound='2' type-id='type-id-46' id='type-id-373'/>
    </array-type-def>
    <enum-decl name='NetplanWifiBand' naming-typedef-id='type-id-374' filepath='../src/types-internal.h' line='90' column='1' id='type-id-375'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='NETPLAN_WIFI_BAND_DEFAULT' value='0'/>
      <enumerator name='NETPLAN_WIFI_BAND_5' value='1'/>
      <enumerator name='NETPLAN_WIFI_BAND_24' value='2'/>
    </enum-decl>
    <enum-decl name='NetplanWifiWowlanFlag' naming-typedef-id='type-id-376' filepath='../src/abi.h' line='97' column='1' id='type-id-377'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_DEFAULT' value='1'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_ANY' value='2'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_DISCONNECT' value='4'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_MAGIC' value='8'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_GTK_REKEY_FAILURE' value='16'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_EAP_IDENTITY_REQ' value='32'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_4WAY_HANDSHAKE' value='64'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_RFKILL_RELEASE' value='128'/>
      <enumerator name='NETPLAN_WIFI_WOWLAN_TCP' value='256'/>
    </enum-decl>
    <enum-decl name='yaml_parser_state_e' filepath='/usr/include/yaml.h' line='1012' column='1' id='type-id-378'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='YAML_PARSE_STREAM_START_STATE' value='0'/>
      <enumerator name='YAML_PARSE_IMPLICIT_DOCUMENT_START_STATE' value='1'/>
      <enumerator name='YAML_PARSE_DOCUMENT_START_STATE' value='2'/>
      <enumerator name='YAML_PARSE_DOCUMENT_CONTENT_STATE' value='3'/>
      <enumerator name='YAML_PARSE_DOCUMENT_END_STATE' value='4'/>
      <enumerator name='YAML_PARSE_BLOCK_NODE_STATE' value='5'/>
      <enumerator name='YAML_PARSE_BLOCK_NODE_OR_INDENTLESS_SEQUENCE_STATE' value='6'/>
      <enumerator name='YAML_PARSE_FLOW_NODE_STATE' value='7'/>
      <enumerator name='YAML_PARSE_BLOCK_SEQUENCE_FIRST_ENTRY_STATE' value='8'/>
      <enumerator name='YAML_PARSE_BLOCK_SEQUENCE_ENTRY_STATE' value='9'/>
      <enumerator name='YAML_PARSE_INDENTLESS_SEQUENCE_ENTRY_STATE' value='10'/>
      <enumerator name='YAML_PARSE_BLOCK_MAPPING_FIRST_KEY_STATE' value='11'/>
      <enumerator name='YAML_PARSE_BLOCK_MAPPING_KEY_STATE' value='12'/>
      <enumerator name='YAML_PARSE_BLOCK_MAPPING_VALUE_STATE' value='13'/>
      <enumerator name='YAML_PARSE_FLOW_SEQUENCE_FIRST_ENTRY_STATE' value='14'/>
      <enumerator name='YAML_PARSE_FLOW_SEQUENCE_ENTRY_STATE' value='15'/>
      <enumerator name='YAML_PARSE_FLOW_SEQUENCE_ENTRY_MAPPING_KEY_STATE' value='16'/>
      <enumerator name='YAML_PARSE_FLOW_SEQUENCE_ENTRY_MAPPING_VALUE_STATE' value='17'/>
      <enumerator name='YAML_PARSE_FLOW_SEQUENCE_ENTRY_MAPPING_END_STATE' value='18'/>
      <enumerator name='YAML_PARSE_FLOW_MAPPING_FIRST_KEY_STATE' value='19'/>
      <enumerator name='YAML_PARSE_FLOW_MAPPING_KEY_STATE' value='20'/>
      <enumerator name='YAML_PARSE_FLOW_MAPPING_VALUE_STATE' value='21'/>
      <enumerator name='YAML_PARSE_FLOW_MAPPING_EMPTY_VALUE_STATE' value='22'/>
      <enumerator name='YAML_PARSE_END_STATE' value='23'/>
    </enum-decl>
    <enum-decl name='yaml_token_type_e' filepath='/usr/include/yaml.h' line='215' column='1' id='type-id-379'>
      <underlying-type type-id='type-id-89'/>
      <enumerator name='YAML_NO_TOKEN' value='0'/>
      <enumerator name='YAML_STREAM_START_TOKEN' value='1'/>
      <enumerator name='YAML_STREAM_END_TOKEN' value='2'/>
      <enumerator name='YAML_VERSION_DIRECTIVE_TOKEN' value='3'/>
      <enumerator name='YAML_TAG_DIRECTIVE_TOKEN' value='4'/>
      <enumerator name='YAML_DOCUMENT_START_TOKEN' value='5'/>
      <enumerator name='YAML_DOCUMENT_END_TOKEN' value='6'/>
      <enumerator name='YAML_BLOCK_SEQUENCE_START_TOKEN' value='7'/>
      <enumerator name='YAML_BLOCK_MAPPING_START_TOKEN' value='8'/>
      <enumerator name='YAML_BLOCK_END_TOKEN' value='9'/>
      <enumerator name='YAML_FLOW_SEQUENCE_START_TOKEN' value='10'/>
      <enumerator name='YAML_FLOW_SEQUENCE_END_TOKEN' value='11'/>
      <enumerator name='YAML_FLOW_MAPPING_START_TOKEN' value='12'/>
      <enumerator name='YAML_FLOW_MAPPING_END_TOKEN' value='13'/>
      <enumerator name='YAML_BLOCK_ENTRY_TOKEN' value='14'/>
      <enumerator name='YAML_FLOW_ENTRY_TOKEN' value='15'/>
      <enumerator name='YAML_KEY_TOKEN' value='16'/>
      <enumerator name='YAML_VALUE_TOKEN' value='17'/>
      <enumerator name='YAML_ALIAS_TOKEN' value='18'/>
      <enumerator name='YAML_ANCHOR_TOKEN' value='19'/>
      <enumerator name='YAML_TAG_TOKEN' value='20'/>
      <enumerator name='YAML_SCALAR_TOKEN' value='21'/>
    </enum-decl>
    <class-decl name='NetplanIPRoute' size-in-bits='640' is-struct='yes' naming-typedef-id='type-id-380' visibility='default' filepath='../src/types-internal.h' line='136' column='1' id='type-id-381'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='family' type-id='type-id-15' visibility='default' filepath='../src/types-internal.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='type' type-id='type-id-62' visibility='default' filepath='../src/types-internal.h' line='138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='scope' type-id='type-id-62' visibility='default' filepath='../src/types-internal.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='table' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='from' type-id='type-id-62' visibility='default' filepath='../src/types-internal.h' line='142' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='to' type-id='type-id-62' visibility='default' filepath='../src/types-internal.h' line='143' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='via' type-id='type-id-62' visibility='default' filepath='../src/types-internal.h' line='144' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='onlink' type-id='type-id-135' visibility='default' filepath='../src/types-internal.h' line='146' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='480'>
        <var-decl name='metric' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='150' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='mtubytes' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='152' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='544'>
        <var-decl name='congestion_window' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='advertised_receive_window' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='608'>
        <var-decl name='advmss' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='NetplanIPRule' size-in-bits='320' is-struct='yes' naming-typedef-id='type-id-382' visibility='default' filepath='../src/types-internal.h' line='158' column='1' id='type-id-383'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='family' type-id='type-id-15' visibility='default' filepath='../src/types-internal.h' line='159' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='from' type-id='type-id-62' visibility='default' filepath='../src/types-internal.h' line='161' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='to' type-id='type-id-62' visibility='default' filepath='../src/types-internal.h' line='162' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='table' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='165' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='priority' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='166' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fwmark' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='tos' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='170' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='NetplanOptionalAddressType' size-in-bits='128' is-struct='yes' visibility='default' filepath='../src/types-internal.h' line='37' column='1' id='type-id-362'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-62' visibility='default' filepath='../src/types-internal.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flag' type-id='type-id-110' visibility='default' filepath='../src/types-internal.h' line='39' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='NetplanWifiAccessPoint' size-in-bits='1408' is-struct='yes' naming-typedef-id='type-id-384' visibility='default' filepath='../src/types-internal.h' line='122' column='1' id='type-id-385'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='mode' type-id='type-id-120' visibility='default' filepath='../src/types-internal.h' line='123' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='ssid' type-id='type-id-62' visibility='default' filepath='../src/types-internal.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='band' type-id='type-id-374' visibility='default' filepath='../src/types-internal.h' line='125' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='bssid' type-id='type-id-62' visibility='default' filepath='../src/types-internal.h' line='126' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='hidden' type-id='type-id-135' visibility='default' filepath='../src/types-internal.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='channel' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='128' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='auth' type-id='type-id-163' visibility='default' filepath='../src/types-internal.h' line='130' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='has_auth' type-id='type-id-135' visibility='default' filepath='../src/types-internal.h' line='131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='backend_settings' type-id='type-id-165' visibility='default' filepath='../src/types-internal.h' line='133' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='NetplanWifiWowlanType' size-in-bits='128' is-struct='yes' visibility='default' filepath='../src/abi.h' line='109' column='1' id='type-id-367'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='name' type-id='type-id-62' visibility='default' filepath='../src/abi.h' line='110' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='flag' type-id='type-id-376' visibility='default' filepath='../src/abi.h' line='111' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='NetplanWireguardPeer' size-in-bits='320' is-struct='yes' naming-typedef-id='type-id-386' visibility='default' filepath='../src/types-internal.h' line='82' column='1' id='type-id-387'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='endpoint' type-id='type-id-62' visibility='default' filepath='../src/types-internal.h' line='83' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='public_key' type-id='type-id-62' visibility='default' filepath='../src/types-internal.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='preshared_key' type-id='type-id-62' visibility='default' filepath='../src/types-internal.h' line='85' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='allowed_ips' type-id='type-id-154' visibility='default' filepath='../src/types-internal.h' line='86' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='keepalive' type-id='type-id-26' visibility='default' filepath='../src/types-internal.h' line='87' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='netplan_parser' size-in-bits='3456' is-struct='yes' visibility='default' filepath='../src/types-internal.h' line='209' column='1' id='type-id-388'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='doc' type-id='type-id-259' visibility='default' filepath='../src/types-internal.h' line='210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='parsed_defs' type-id='type-id-389' visibility='default' filepath='../src/types-internal.h' line='213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='ordered' type-id='type-id-137' visibility='default' filepath='../src/types-internal.h' line='216' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='global_backend' type-id='type-id-87' visibility='default' filepath='../src/types-internal.h' line='217' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='global_ovs_settings' type-id='type-id-164' visibility='default' filepath='../src/types-internal.h' line='218' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='sources' type-id='type-id-389' visibility='default' filepath='../src/types-internal.h' line='221' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='current' type-id='type-id-390' visibility='default' filepath='../src/types-internal.h' line='242' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3008'>
        <var-decl name='missing_id' type-id='type-id-389' visibility='default' filepath='../src/types-internal.h' line='252' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3072'>
        <var-decl name='ids_in_file' type-id='type-id-389' visibility='default' filepath='../src/types-internal.h' line='260' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='missing_ids_found' type-id='type-id-2' visibility='default' filepath='../src/types-internal.h' line='261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='null_fields' type-id='type-id-389' visibility='default' filepath='../src/types-internal.h' line='264' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3264'>
        <var-decl name='null_overrides' type-id='type-id-389' visibility='default' filepath='../src/types-internal.h' line='265' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3328'>
        <var-decl name='global_renderer' type-id='type-id-389' visibility='default' filepath='../src/types-internal.h' line='266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='flags' type-id='type-id-35' visibility='default' filepath='../src/types-internal.h' line='269' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3424'>
        <var-decl name='error_count' type-id='type-id-35' visibility='default' filepath='../src/types-internal.h' line='275' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='re_pattern_buffer' size-in-bits='512' is-struct='yes' visibility='default' filepath='/usr/include/regex.h' line='413' column='1' id='type-id-391'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='buffer' type-id='type-id-392' visibility='default' filepath='/usr/include/regex.h' line='417' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='allocated' type-id='type-id-393' visibility='default' filepath='/usr/include/regex.h' line='420' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='used' type-id='type-id-393' visibility='default' filepath='/usr/include/regex.h' line='423' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='syntax' type-id='type-id-394' visibility='default' filepath='/usr/include/regex.h' line='426' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='fastmap' type-id='type-id-62' visibility='default' filepath='/usr/include/regex.h' line='431' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='translate' type-id='type-id-221' visibility='default' filepath='/usr/include/regex.h' line='437' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='re_nsub' type-id='type-id-49' visibility='default' filepath='/usr/include/regex.h' line='440' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='can_be_null' type-id='type-id-35' visibility='default' filepath='/usr/include/regex.h' line='446' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='449'>
        <var-decl name='regs_allocated' type-id='type-id-35' visibility='default' filepath='/usr/include/regex.h' line='457' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='451'>
        <var-decl name='fastmap_accurate' type-id='type-id-35' visibility='default' filepath='/usr/include/regex.h' line='461' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='452'>
        <var-decl name='no_sub' type-id='type-id-35' visibility='default' filepath='/usr/include/regex.h' line='465' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='453'>
        <var-decl name='not_bol' type-id='type-id-35' visibility='default' filepath='/usr/include/regex.h' line='469' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='454'>
        <var-decl name='not_eol' type-id='type-id-35' visibility='default' filepath='/usr/include/regex.h' line='472' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='455'>
        <var-decl name='newline_anchor' type-id='type-id-35' visibility='default' filepath='/usr/include/regex.h' line='475' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='regmatch_t' size-in-bits='64' is-struct='yes' naming-typedef-id='type-id-395' visibility='default' filepath='/usr/include/regex.h' line='517' column='1' id='type-id-396'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='rm_so' type-id='type-id-397' visibility='default' filepath='/usr/include/regex.h' line='519' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='rm_eo' type-id='type-id-397' visibility='default' filepath='/usr/include/regex.h' line='520' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='stat' size-in-bits='1152' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_stat.h' line='26' column='1' id='type-id-398'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='st_dev' type-id='type-id-399' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_stat.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='st_ino' type-id='type-id-400' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_stat.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='st_nlink' type-id='type-id-401' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_stat.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='st_mode' type-id='type-id-254' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_stat.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='st_uid' type-id='type-id-402' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_stat.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='st_gid' type-id='type-id-403' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_stat.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <var-decl name='__pad0' type-id='type-id-2' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_stat.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='st_rdev' type-id='type-id-399' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_stat.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='st_size' type-id='type-id-141' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_stat.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='st_blksize' type-id='type-id-404' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_stat.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='st_blocks' type-id='type-id-405' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_stat.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='st_atim' type-id='type-id-406' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_stat.h' line='74' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='st_mtim' type-id='type-id-406' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_stat.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='st_ctim' type-id='type-id-406' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_stat.h' line='76' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='__glibc_reserved' type-id='type-id-372' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/struct_stat.h' line='89' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='11' column='1' id='type-id-406'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='tv_sec' type-id='type-id-407' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='tv_nsec' type-id='type-id-371' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='21' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_alias_data_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='1071' column='1' id='type-id-408'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='anchor' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='1073' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='index' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1075' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mark' type-id='type-id-182' visibility='default' filepath='/usr/include/yaml.h' line='1077' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_parser_s' size-in-bits='3840' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='1087' column='1' id='type-id-409'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='error' type-id='type-id-184' visibility='default' filepath='/usr/include/yaml.h' line='1095' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='problem' type-id='type-id-64' visibility='default' filepath='/usr/include/yaml.h' line='1097' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='problem_offset' type-id='type-id-49' visibility='default' filepath='/usr/include/yaml.h' line='1099' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='problem_value' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1101' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='problem_mark' type-id='type-id-182' visibility='default' filepath='/usr/include/yaml.h' line='1103' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='context' type-id='type-id-64' visibility='default' filepath='/usr/include/yaml.h' line='1105' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='context_mark' type-id='type-id-182' visibility='default' filepath='/usr/include/yaml.h' line='1107' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='read_handler' type-id='type-id-410' visibility='default' filepath='/usr/include/yaml.h' line='1119' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='read_handler_data' type-id='type-id-36' visibility='default' filepath='/usr/include/yaml.h' line='1122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='input' type-id='type-id-411' visibility='default' filepath='/usr/include/yaml.h' line='1138' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='eof' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1141' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='buffer' type-id='type-id-187' visibility='default' filepath='/usr/include/yaml.h' line='1153' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='unread' type-id='type-id-49' visibility='default' filepath='/usr/include/yaml.h' line='1156' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='raw_buffer' type-id='type-id-188' visibility='default' filepath='/usr/include/yaml.h' line='1168' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='encoding' type-id='type-id-189' visibility='default' filepath='/usr/include/yaml.h' line='1171' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='offset' type-id='type-id-49' visibility='default' filepath='/usr/include/yaml.h' line='1174' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='mark' type-id='type-id-182' visibility='default' filepath='/usr/include/yaml.h' line='1177' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='stream_start_produced' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1189' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2016'>
        <var-decl name='stream_end_produced' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='flow_level' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1195' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='tokens' type-id='type-id-412' visibility='default' filepath='/usr/include/yaml.h' line='1207' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='tokens_parsed' type-id='type-id-49' visibility='default' filepath='/usr/include/yaml.h' line='1210' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2432'>
        <var-decl name='token_available' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1213' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2496'>
        <var-decl name='indents' type-id='type-id-194' visibility='default' filepath='/usr/include/yaml.h' line='1223' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2688'>
        <var-decl name='indent' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2720'>
        <var-decl name='simple_key_allowed' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1229' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2752'>
        <var-decl name='simple_keys' type-id='type-id-413' visibility='default' filepath='/usr/include/yaml.h' line='1239' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2944'>
        <var-decl name='states' type-id='type-id-414' visibility='default' filepath='/usr/include/yaml.h' line='1258' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3136'>
        <var-decl name='state' type-id='type-id-415' visibility='default' filepath='/usr/include/yaml.h' line='1261' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3200'>
        <var-decl name='marks' type-id='type-id-416' visibility='default' filepath='/usr/include/yaml.h' line='1271' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3392'>
        <var-decl name='tag_directives' type-id='type-id-195' visibility='default' filepath='/usr/include/yaml.h' line='1281' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3584'>
        <var-decl name='aliases' type-id='type-id-417' visibility='default' filepath='/usr/include/yaml.h' line='1300' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='3776'>
        <var-decl name='document' type-id='type-id-200' visibility='default' filepath='/usr/include/yaml.h' line='1303' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_simple_key_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='995' column='1' id='type-id-418'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='possible' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='997' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='required' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='1000' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='token_number' type-id='type-id-49' visibility='default' filepath='/usr/include/yaml.h' line='1003' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='mark' type-id='type-id-182' visibility='default' filepath='/usr/include/yaml.h' line='1006' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='yaml_token_s' size-in-bits='640' is-struct='yes' visibility='default' filepath='/usr/include/yaml.h' line='269' column='1' id='type-id-419'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='type' type-id='type-id-420' visibility='default' filepath='/usr/include/yaml.h' line='272' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='data' type-id='type-id-421' visibility='default' filepath='/usr/include/yaml.h' line='329' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='start_mark' type-id='type-id-182' visibility='default' filepath='/usr/include/yaml.h' line='332' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='end_mark' type-id='type-id-182' visibility='default' filepath='/usr/include/yaml.h' line='334' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__' size-in-bits='640' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../src/types-internal.h' line='224' column='1' id='type-id-390'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='netdef' type-id='type-id-156' visibility='default' filepath='../src/types-internal.h' line='226' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='auth' type-id='type-id-422' visibility='default' filepath='../src/types-internal.h' line='227' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='access_point' type-id='type-id-423' visibility='default' filepath='../src/types-internal.h' line='230' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='wireguard_peer' type-id='type-id-424' visibility='default' filepath='../src/types-internal.h' line='231' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='addr_options' type-id='type-id-302' visibility='default' filepath='../src/types-internal.h' line='232' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='route' type-id='type-id-425' visibility='default' filepath='../src/types-internal.h' line='233' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='ip_rule' type-id='type-id-426' visibility='default' filepath='../src/types-internal.h' line='234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='vxlan' type-id='type-id-167' visibility='default' filepath='../src/types-internal.h' line='235' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='filepath' type-id='type-id-64' visibility='default' filepath='../src/types-internal.h' line='236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='backend' type-id='type-id-87' visibility='default' filepath='../src/types-internal.h' line='241' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__1' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1127' column='1' id='type-id-427'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-330' visibility='default' filepath='/usr/include/yaml.h' line='1129' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-330' visibility='default' filepath='/usr/include/yaml.h' line='1131' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='current' type-id='type-id-330' visibility='default' filepath='/usr/include/yaml.h' line='1133' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__10' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='314' column='1' id='type-id-428'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='major' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='316' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='minor' type-id='type-id-2' visibility='default' filepath='/usr/include/yaml.h' line='318' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__17' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1293' column='1' id='type-id-417'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-429' visibility='default' filepath='/usr/include/yaml.h' line='1295' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-429' visibility='default' filepath='/usr/include/yaml.h' line='1297' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-429' visibility='default' filepath='/usr/include/yaml.h' line='1299' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__11' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='322' column='1' id='type-id-430'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='324' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='prefix' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='326' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__8' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='296' column='1' id='type-id-431'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='handle' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='298' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='suffix' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='300' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__6' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='284' column='1' id='type-id-432'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='value' type-id='type-id-208' visibility='default' filepath='/usr/include/yaml.h' line='286' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__15' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1264' column='1' id='type-id-416'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-433' visibility='default' filepath='/usr/include/yaml.h' line='1266' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-433' visibility='default' filepath='/usr/include/yaml.h' line='1268' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-433' visibility='default' filepath='/usr/include/yaml.h' line='1270' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__14' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1251' column='1' id='type-id-414'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-434' visibility='default' filepath='/usr/include/yaml.h' line='1253' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-434' visibility='default' filepath='/usr/include/yaml.h' line='1255' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-434' visibility='default' filepath='/usr/include/yaml.h' line='1257' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__13' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1232' column='1' id='type-id-413'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-435' visibility='default' filepath='/usr/include/yaml.h' line='1234' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-435' visibility='default' filepath='/usr/include/yaml.h' line='1236' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='top' type-id='type-id-435' visibility='default' filepath='/usr/include/yaml.h' line='1238' column='1'/>
      </data-member>
    </class-decl>
    <class-decl name='__anonymous_struct__4' size-in-bits='256' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1198' column='1' id='type-id-412'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='start' type-id='type-id-436' visibility='default' filepath='/usr/include/yaml.h' line='1200' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='end' type-id='type-id-436' visibility='default' filepath='/usr/include/yaml.h' line='1202' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='head' type-id='type-id-436' visibility='default' filepath='/usr/include/yaml.h' line='1204' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='tail' type-id='type-id-436' visibility='default' filepath='/usr/include/yaml.h' line='1206' column='1'/>
      </data-member>
    </class-decl>
    <typedef-decl name='GHRFunc' type-id='type-id-437' filepath='/usr/include/glib-2.0/glib/ghash.h' line='42' column='1' id='type-id-438'/>
    <typedef-decl name='NetplanIPRoute' type-id='type-id-381' filepath='../src/types-internal.h' line='156' column='1' id='type-id-380'/>
    <typedef-decl name='NetplanIPRule' type-id='type-id-383' filepath='../src/types-internal.h' line='171' column='1' id='type-id-382'/>
    <typedef-decl name='NetplanParser' type-id='type-id-388' filepath='../include/types.h' line='75' column='1' id='type-id-439'/>
    <typedef-decl name='NetplanWifiAccessPoint' type-id='type-id-385' filepath='../src/types-internal.h' line='134' column='1' id='type-id-384'/>
    <typedef-decl name='NetplanWifiBand' type-id='type-id-375' filepath='../src/types-internal.h' line='94' column='1' id='type-id-374'/>
    <typedef-decl name='NetplanWifiWowlanFlag' type-id='type-id-377' filepath='../src/abi.h' line='107' column='1' id='type-id-376'/>
    <typedef-decl name='NetplanWireguardPeer' type-id='type-id-387' filepath='../src/types-internal.h' line='88' column='1' id='type-id-386'/>
    <typedef-decl name='__blkcnt_t' type-id='type-id-3' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='180' column='1' id='type-id-405'/>
    <typedef-decl name='__blksize_t' type-id='type-id-3' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='175' column='1' id='type-id-404'/>
    <typedef-decl name='__dev_t' type-id='type-id-46' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='145' column='1' id='type-id-399'/>
    <typedef-decl name='__gid_t' type-id='type-id-35' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='147' column='1' id='type-id-403'/>
    <typedef-decl name='__ino_t' type-id='type-id-46' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='148' column='1' id='type-id-400'/>
    <typedef-decl name='__nlink_t' type-id='type-id-46' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='151' column='1' id='type-id-401'/>
    <typedef-decl name='__re_long_size_t' type-id='type-id-46' filepath='/usr/include/regex.h' line='56' column='1' id='type-id-393'/>
    <typedef-decl name='__syscall_slong_t' type-id='type-id-3' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='197' column='1' id='type-id-371'/>
    <typedef-decl name='__time_t' type-id='type-id-3' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='160' column='1' id='type-id-407'/>
    <typedef-decl name='__uid_t' type-id='type-id-35' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='146' column='1' id='type-id-402'/>
    <typedef-decl name='reg_syntax_t' type-id='type-id-46' filepath='/usr/include/regex.h' line='72' column='1' id='type-id-394'/>
    <typedef-decl name='regex_t' type-id='type-id-391' filepath='/usr/include/regex.h' line='478' column='1' id='type-id-440'/>
    <typedef-decl name='regmatch_t' type-id='type-id-396' filepath='/usr/include/regex.h' line='521' column='1' id='type-id-395'/>
    <typedef-decl name='regoff_t' type-id='type-id-2' filepath='/usr/include/regex.h' line='490' column='1' id='type-id-397'/>
    <typedef-decl name='yaml_alias_data_t' type-id='type-id-408' filepath='/usr/include/yaml.h' line='1078' column='1' id='type-id-441'/>
    <typedef-decl name='yaml_parser_state_t' type-id='type-id-378' filepath='/usr/include/yaml.h' line='1065' column='1' id='type-id-415'/>
    <typedef-decl name='yaml_parser_t' type-id='type-id-409' filepath='/usr/include/yaml.h' line='1309' column='1' id='type-id-442'/>
    <typedef-decl name='yaml_read_handler_t' type-id='type-id-443' filepath='/usr/include/yaml.h' line='988' column='1' id='type-id-444'/>
    <typedef-decl name='yaml_simple_key_t' type-id='type-id-418' filepath='/usr/include/yaml.h' line='1007' column='1' id='type-id-445'/>
    <typedef-decl name='yaml_token_t' type-id='type-id-419' filepath='/usr/include/yaml.h' line='336' column='1' id='type-id-446'/>
    <typedef-decl name='yaml_token_type_t' type-id='type-id-379' filepath='/usr/include/yaml.h' line='266' column='1' id='type-id-420'/>
    <union-decl name='__anonymous_union__' size-in-bits='192' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='1125' column='1' id='type-id-411'>
      <data-member access='public'>
        <var-decl name='string' type-id='type-id-427' visibility='default' filepath='/usr/include/yaml.h' line='1134' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='file' type-id='type-id-269' visibility='default' filepath='/usr/include/yaml.h' line='1137' column='1'/>
      </data-member>
    </union-decl>
    <union-decl name='__anonymous_union__1' size-in-bits='192' is-anonymous='yes' visibility='default' filepath='/usr/include/yaml.h' line='275' column='1' id='type-id-421'>
      <data-member access='public'>
        <var-decl name='stream_start' type-id='type-id-230' visibility='default' filepath='/usr/include/yaml.h' line='281' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='alias' type-id='type-id-432' visibility='default' filepath='/usr/include/yaml.h' line='287' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='anchor' type-id='type-id-432' visibility='default' filepath='/usr/include/yaml.h' line='293' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='tag' type-id='type-id-431' visibility='default' filepath='/usr/include/yaml.h' line='301' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='scalar' type-id='type-id-228' visibility='default' filepath='/usr/include/yaml.h' line='311' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='version_directive' type-id='type-id-428' visibility='default' filepath='/usr/include/yaml.h' line='319' column='1'/>
      </data-member>
      <data-member access='public'>
        <var-decl name='tag_directive' type-id='type-id-430' visibility='default' filepath='/usr/include/yaml.h' line='327' column='1'/>
      </data-member>
    </union-decl>
    <pointer-type-def type-id='type-id-302' size-in-bits='64' id='type-id-447'/>
    <pointer-type-def type-id='type-id-163' size-in-bits='64' id='type-id-422'/>
    <pointer-type-def type-id='type-id-380' size-in-bits='64' id='type-id-425'/>
    <pointer-type-def type-id='type-id-425' size-in-bits='64' id='type-id-448'/>
    <pointer-type-def type-id='type-id-382' size-in-bits='64' id='type-id-426'/>
    <pointer-type-def type-id='type-id-426' size-in-bits='64' id='type-id-449'/>
    <pointer-type-def type-id='type-id-164' size-in-bits='64' id='type-id-450'/>
    <pointer-type-def type-id='type-id-439' size-in-bits='64' id='type-id-358'/>
    <pointer-type-def type-id='type-id-358' size-in-bits='64' id='type-id-451'/>
    <pointer-type-def type-id='type-id-251' size-in-bits='64' id='type-id-452'/>
    <pointer-type-def type-id='type-id-384' size-in-bits='64' id='type-id-423'/>
    <pointer-type-def type-id='type-id-423' size-in-bits='64' id='type-id-453'/>
    <pointer-type-def type-id='type-id-386' size-in-bits='64' id='type-id-424'/>
    <pointer-type-def type-id='type-id-424' size-in-bits='64' id='type-id-454'/>
    <pointer-type-def type-id='type-id-62' size-in-bits='64' id='type-id-455'/>
    <qualified-type-def type-id='type-id-455' restrict='yes' id='type-id-456'/>
    <qualified-type-def type-id='type-id-380' const='yes' id='type-id-457'/>
    <pointer-type-def type-id='type-id-457' size-in-bits='64' id='type-id-458'/>
    <qualified-type-def type-id='type-id-382' const='yes' id='type-id-459'/>
    <pointer-type-def type-id='type-id-459' size-in-bits='64' id='type-id-460'/>
    <qualified-type-def type-id='type-id-439' const='yes' id='type-id-461'/>
    <pointer-type-def type-id='type-id-461' size-in-bits='64' id='type-id-359'/>
    <qualified-type-def type-id='type-id-440' const='yes' id='type-id-462'/>
    <pointer-type-def type-id='type-id-462' size-in-bits='64' id='type-id-463'/>
    <qualified-type-def type-id='type-id-463' restrict='yes' id='type-id-464'/>
    <qualified-type-def type-id='type-id-35' const='yes' id='type-id-465'/>
    <qualified-type-def type-id='type-id-264' const='yes' id='type-id-466'/>
    <pointer-type-def type-id='type-id-466' size-in-bits='64' id='type-id-467'/>
    <qualified-type-def type-id='type-id-442' const='yes' id='type-id-468'/>
    <pointer-type-def type-id='type-id-468' size-in-bits='64' id='type-id-469'/>
    <pointer-type-def type-id='type-id-440' size-in-bits='64' id='type-id-470'/>
    <qualified-type-def type-id='type-id-470' restrict='yes' id='type-id-471'/>
    <pointer-type-def type-id='type-id-395' size-in-bits='64' id='type-id-472'/>
    <qualified-type-def type-id='type-id-472' restrict='yes' id='type-id-473'/>
    <pointer-type-def type-id='type-id-398' size-in-bits='64' id='type-id-474'/>
    <qualified-type-def type-id='type-id-474' restrict='yes' id='type-id-475'/>
    <pointer-type-def type-id='type-id-476' size-in-bits='64' id='type-id-437'/>
    <pointer-type-def type-id='type-id-441' size-in-bits='64' id='type-id-429'/>
    <pointer-type-def type-id='type-id-182' size-in-bits='64' id='type-id-433'/>
    <pointer-type-def type-id='type-id-415' size-in-bits='64' id='type-id-434'/>
    <pointer-type-def type-id='type-id-442' size-in-bits='64' id='type-id-477'/>
    <pointer-type-def type-id='type-id-444' size-in-bits='64' id='type-id-410'/>
    <pointer-type-def type-id='type-id-445' size-in-bits='64' id='type-id-435'/>
    <pointer-type-def type-id='type-id-446' size-in-bits='64' id='type-id-436'/>
    <pointer-type-def type-id='type-id-478' size-in-bits='64' id='type-id-479'/>
    <pointer-type-def type-id='type-id-479' size-in-bits='64' id='type-id-480'/>
    <pointer-type-def type-id='type-id-481' size-in-bits='64' id='type-id-389'/>
    <pointer-type-def type-id='type-id-482' size-in-bits='64' id='type-id-392'/>
    <class-decl name='_GData' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-483'/>
    <class-decl name='_GHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-484'/>
    <class-decl name='re_dfa_t' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-482'/>
    <function-decl name='parser_error' filepath='../src/error.h' line='29' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-469'/>
      <parameter type-id='type-id-64'/>
      <parameter type-id='type-id-55'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='yaml_error' filepath='../src/error.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-359'/>
      <parameter type-id='type-id-467'/>
      <parameter type-id='type-id-55'/>
      <parameter type-id='type-id-64'/>
      <parameter is-variadic='yes'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='netplan_parser_load_yaml_from_fd' mangled-name='netplan_parser_load_yaml_from_fd' filepath='../src/parse.c' line='3630' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_load_yaml_from_fd'>
      <parameter type-id='type-id-358' name='npp' filepath='../src/parse.c' line='3630' column='1'/>
      <parameter type-id='type-id-2' name='fd' filepath='../src/parse.c' line='3630' column='1'/>
      <parameter type-id='type-id-55' name='error' filepath='../src/parse.c' line='3630' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='netplan_parser_load_yaml' mangled-name='netplan_parser_load_yaml' filepath='../src/parse.c' line='3641' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_load_yaml'>
      <parameter type-id='type-id-358' name='npp' filepath='../src/parse.c' line='3641' column='1'/>
      <parameter type-id='type-id-64' name='filename' filepath='../src/parse.c' line='3641' column='1'/>
      <parameter type-id='type-id-55' name='error' filepath='../src/parse.c' line='3641' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='netplan_state_import_parser_results' mangled-name='netplan_state_import_parser_results' filepath='../src/parse.c' line='3685' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_state_import_parser_results'>
      <parameter type-id='type-id-452' name='np_state' filepath='../src/parse.c' line='3685' column='1'/>
      <parameter type-id='type-id-358' name='npp' filepath='../src/parse.c' line='3685' column='1'/>
      <parameter type-id='type-id-55' name='error' filepath='../src/parse.c' line='3685' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='netplan_parser_new' mangled-name='netplan_parser_new' filepath='../src/parse.c' line='3756' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_new'>
      <return type-id='type-id-358'/>
    </function-decl>
    <function-decl name='netplan_parser_reset' mangled-name='netplan_parser_reset' filepath='../src/parse.c' line='3764' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_reset'>
      <parameter type-id='type-id-358' name='npp' filepath='../src/parse.c' line='3764' column='1'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='netplan_parser_clear' mangled-name='netplan_parser_clear' filepath='../src/parse.c' line='3834' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_clear'>
      <parameter type-id='type-id-451' name='npp_p' filepath='../src/parse.c' line='3834' column='1'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='netplan_parser_set_flags' mangled-name='netplan_parser_set_flags' filepath='../src/parse.c' line='3843' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_set_flags'>
      <parameter type-id='type-id-358' name='npp' filepath='../src/parse.c' line='3843' column='1'/>
      <parameter type-id='type-id-465' name='flags' filepath='../src/parse.c' line='3843' column='1'/>
      <parameter type-id='type-id-55' name='error' filepath='../src/parse.c' line='3843' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='netplan_parser_get_flags' mangled-name='netplan_parser_get_flags' filepath='../src/parse.c' line='3856' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_get_flags'>
      <parameter type-id='type-id-359' name='npp' filepath='../src/parse.c' line='3856' column='1'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='netplan_parser_get_error_count' mangled-name='netplan_parser_get_error_count' filepath='../src/parse.c' line='3862' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_get_error_count'>
      <parameter type-id='type-id-359' name='npp' filepath='../src/parse.c' line='3862' column='1'/>
      <return type-id='type-id-35'/>
    </function-decl>
    <function-decl name='netplan_parser_load_nullable_fields' mangled-name='netplan_parser_load_nullable_fields' filepath='../src/parse.c' line='3952' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_load_nullable_fields'>
      <parameter type-id='type-id-358' name='npp' filepath='../src/parse.c' line='3952' column='1'/>
      <parameter type-id='type-id-2' name='input_fd' filepath='../src/parse.c' line='3952' column='1'/>
      <parameter type-id='type-id-55' name='error' filepath='../src/parse.c' line='3952' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <function-decl name='netplan_parser_load_nullable_overrides' mangled-name='netplan_parser_load_nullable_overrides' filepath='../src/parse.c' line='3971' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='netplan_parser_load_nullable_overrides'>
      <parameter type-id='type-id-358' name='npp' filepath='../src/parse.c' line='3972' column='1'/>
      <parameter type-id='type-id-2' name='input_fd' filepath='../src/parse.c' line='3972' column='1'/>
      <parameter type-id='type-id-64' name='constraint' filepath='../src/parse.c' line='3972' column='1'/>
      <parameter type-id='type-id-55' name='error' filepath='../src/parse.c' line='3972' column='1'/>
      <return type-id='type-id-135'/>
    </function-decl>
    <var-decl name='NETPLAN_OPTIONAL_ADDRESS_TYPES' type-id='type-id-363' visibility='default' filepath='../src/types-internal.h' line='61' column='1'/>
    <var-decl name='NETPLAN_WIFI_WOWLAN_TYPES' type-id='type-id-368' visibility='default' filepath='../src/types-internal.h' line='63' column='1'/>
    <function-decl name='reset_netdef' filepath='../src/types-internal.h' line='299' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-156'/>
      <parameter type-id='type-id-90'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='reset_ip_rule' filepath='../src/types-internal.h' line='302' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-426'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='reset_ovs_settings' filepath='../src/types-internal.h' line='305' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-450'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='access_point_clear' filepath='../src/types-internal.h' line='311' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-453'/>
      <parameter type-id='type-id-87'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='wireguard_peer_clear' filepath='../src/types-internal.h' line='314' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-454'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='address_options_clear' filepath='../src/types-internal.h' line='317' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-447'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='ip_rule_clear' filepath='../src/types-internal.h' line='320' column='1' visibility='default' binding='global' size-in-bits='64'>
      <parameter type-id='type-id-449'/>
      <return type-id='type-id-84'/>
    </function-decl>
    <function-decl name='route_clear' filepath='../src/types-internal.h' line='323' column='1' visibility='default' binding='global' size-in-bits='64'>
